[
  {
    "name": "The Fall of Erebor",
    "lotr_page_id": "41246",
    "location": "Lonely Mountain",
    "text": "THE FALL OF EREBOR was a catastrophic event in the Third Age. In summer,\nan enormous Fire-drake named Smaug descended on the mountain and\ndestroyed Dale and the Kingdom of the Dwarves of the Lonely Mountain."
  },
  {
    "name": "Fall of Umbar",
    "lotr_page_id": "9734",
    "text": "The BATTLE OF UMBAR was a battle between Gondor and the Corsairs of\nUmbar. \n\nKing Telumehtar of Gondor led the Gondorians to war because of the death\nof Minardil two centuries earlier. The attack was a complete surprise\nand the Corsairs were annihilated, the line of Castamir came to an end\nand Telemuhtar took the name 'Umbardacil' meaning 'victor over Umbar'.\nThe city remained in the hands of Gondor until 1944, when the Haradrim\nconquered the city. It is possible that a few hundred Haradrim also\nfought.",
    "conflict": "Corsair Wars",
    "date": "TA 1810",
    "location": "Umbar",
    "outcome": "Gondorian Victory"
  },
  {
    "name": "Siege of Utumno",
    "lotr_page_id": "40069",
    "text": "The SIEGE OF UTUMNO was an assault by the hosts of Valinor to destroy\nthe ancient fortress of Melkor, Utumno. The battle took place at the\nGates of Utumno, and as the battle wore on for years, the hosts of Aman\nwere finally able to drive Melkor to the lowest parts of his fortress,\nwhere Tulkas and Melkor fought. Melkor was subdued and cast down by\nTulkas, and was later taken back to the Halls of Mandos in Valinor, to\nbe judged by Manwë. After the battle, Utumno was laid waste and the\nservants of Melkor escaped.\n",
    "conflict": "War for Sake of the Elves",
    "date": "VY 1092 - VY 1099",
    "location": "Utumno",
    "outcome": "Victory of the Valarin forces, Utumno destroyed"
  },
  {
    "name": "Sack of Amon Rûdh",
    "lotr_page_id": "20329",
    "text": "The SACK OF AMON RÛDH was a battle, or more like a massacre of the First\nAge.\n\n\nHistory\n\nThe Sack was caused by Mîm, the Petty-dwarf who betrayed Túrin's friend\nand allies to the Orcs of Morgoth. The battle took place in FA 489 in\nthe House of Ransom. The sack marked the end of Dor-Cúarthol, the “Land\nof Bow and Helm” and the near capture of Túrin and Beleg by the forces\nof Morgoth who able to escape due to the bravery of Andróg, who later\ndied of an arrow-wound. The only other survivor besides Túrin and Beleg\nwas Andvír, Andróg's son.",
    "conflict": "War of the Great Jewels",
    "date": "FA 489",
    "location": "Amon Rûdh",
    "outcome": "Orcs of Morgoth victory; End of Dor-Cúarthol"
  },
  {
    "name": "Defense of Minas Anor and Osgiliath",
    "lotr_page_id": "34735",
    "location": "Ithilien",
    "text": "The DEFENSE OF MINAS ANOR AND OSGILIATH was a siege/battle between the\nDúnedain of Gondor just before the formal formation of the Last\nAlliance.\n\n\nHistory\n\nAfter the loss of Minas Ithil, Anárion was able to assemble a large\nenough force to successfully prevent Sauron's forces from taking\nOsgiliath and Minas Anor. The enemy was driven from Ithilien and into\nthe mountains. However, it was only a temporary relief as Sauron's\nforces would soon regroup to once again become a threat to Gondor,\nleading Elendil and Gil-galad to form the Last Alliance."
  },
  {
    "name": "Battle of Cirith Ungol",
    "lotr_page_id": "23160",
    "text": "The BATTLE OF CIRITH UNGOL was a vague fight between the Orc company of\nGorbag from Minas Morgul and the Black Uruks of Shagrat stationed at\nCirith Ungol over Frodo's mithril vest.\n\n\nHistory\n\nThe commanders of the two sides were Shagrat and Gorbag. The fight\nallowed Sam to sneak into the tower and find Frodo and rescue him. Every\nsoldier stationed at the tower was killed except Shagrat and a few other\nBlack Uruks, who were later killed by Sam, he also killed Gorbag\nhimself, Shagrat managed to get away with the _mithril_ coat.\n\npl:Bitwa w Cirith Ungol",
    "conflict": "War of the Ring",
    "date": "TA 3019",
    "location": "Cirith Ungol",
    "outcome": "Frodo rescued"
  },
  {
    "name": "Turambar's defeat of the Easterlings",
    "lotr_page_id": "28419",
    "text": "TURAMBAR'S DEFEAT OF THE EASTERLINGS was a battle or perhaps a series of\nbattles in which King Turambar decisively defeated the Easterling\ninvaders.\n\n\nHistory\n\nAfter the death of his father, Turambar became King and moved quickly\nagainst the Easterlings who had slain his father and invaded his peoples\nlands. Gondor and the Easterling armies clashed somewhere perhaps in\nnorth-eastern Gondor and Gondor emerged victorious.\n\nAftermath\n\nAfter the victory, the armies of Gondor moved eastward into Rhûn and\nproceeded to conquer the area which would later become part of\nGondor.\n",
    "conflict": "First Easterling War",
    "date": "TA 541",
    "location": "Gondor",
    "outcome": "Decisive Gondor victory"
  },
  {
    "name": "Battle of the Crossings of Erui",
    "lotr_page_id": "3769",
    "location": "Gondor",
    "text": "The BATTLE OF THE CROSSINGS OF ERUI was the last battle of the\nKin-strife of Gondor.\n\n\nHistory\n\nAfter a decade of cruel rule by Castamir the Usurper, the people of\nGondor rebelled, and the rightful king Eldacar of Gondor returned to his\nKingdom from the north in TA 1447. Castamir and his men were cornered at\nthe Crossings of the river Erui, on the road from Minas Tirith to\nPelargir, and Eldacar personally killed Castamir there. The Castamir's\nheirs were then besieged in Pelargir after the victory, eventually\nfleeing to Umbar. However, many Dúnedain of pure Númenórean blood were\nkilled at Erui."
  },
  {
    "name": "Battle of the Lammoth",
    "lotr_page_id": "2748",
    "text": "The BATTLE OF THE LAMMOTH was the first battle fought after Fingolfin\nand the second, greater Host of the Ñoldor arrived in Lammoth - during\nthe First Age.\n\n\nHistory\n\nFingolfin's host was attacked by a force of Orcs as they marched\nsouthwards from the Helcaraxë into the Beleriand in Middle-earth, that\nhad been sent there by Morgoth to attack Fëanor in the rear and they\nfought their first battle. The Ñoldor were caught off-guard, and\nFingolfin's son Argon was slain. Fingolfin and his host pursued the Orcs\nuntil they were completely destroyed, and then passed into Mithrim as\nthe Moon first rose.",
    "conflict": "Wars of Beleriand",
    "date": "FA 1",
    "location": "Lammoth",
    "outcome": "Victory for the Ñoldor"
  },
  {
    "name": "First War",
    "lotr_page_id": "9438",
    "location": "Eä",
    "text": "The FIRST WAR was the first conflict between Melkor and the Valar in Eä\nfor the control of Arda, long before the War of the Great Jewels.\n\n\nHistory\n\nWhen the Valar descended into Eä, Melkor followed them proclaiming the\nworld to be _his_ own kingdom and no others'. He contested their rule by\ncreating chaos and ruin so whatever the Valar built was thrown down and\ndespoiled. With much of their works in ruin and their labors wasted, the\nworld was nevertheless made firm. The war ended when Tulkas the strong\ndescended from the heavens and defeated Melkor, driving him away. This\nwas the first deed of Arda Marred."
  },
  {
    "name": "Battle of the Crossings of Poros",
    "lotr_page_id": "42144",
    "location": "Ithilien",
    "text": "The BATTLE OF THE CROSSINGS OF POROS was the result of Gondor and\nRohan's response to an attack by Harad upon Ithilien.\n\n\nHistory\n\nIn the year 2885 of the Third Age, during the reign of Steward Túrin II,\nthe Haradrim assailed Southern Ithilien with great strength at the\nCrossings of Poros where Túrin II and King Folcwine of Rohan mustered\ntheir armies for defense against the Southern storm. The Haradrim, when\nthey were ready, launched the assault, but were beaten back by the\ncombined arms of Rohan and Gondor.\n\nOverall, this battle was somewhat a Pyrrhic victory for Rohan and Gondor\nalike, due to the deaths of Folcwine's sons, Fastred and Folcred."
  },
  {
    "name": "Attack on the Woodland Realm",
    "lotr_page_id": "36334",
    "text": "The ATTACK ON THE WOODLAND REALM was a small battle of the War of the\nRing.\n\n\nHistory\n\nOn June 20, 3018, Sauron attacked the Woodland Realm. Although Thranduil\nled his forces to victory, Gollum, who had previously been imprisoned in\nthe dungeons (entrusted into Thranduil's keeping by Aragorn under orders\nfrom Gandalf), escaped.\n\nWhen Legolas recounts the event at the Council of Elrond, he states that\nit was an orchestrated event between Sauron and Gollum to ensure\nGollum's escape. He states that Gollum had been allowed to climb a tree,\nand at this time, Orcs from Dol Guldur ambushed them, and all of\nGollum's guards were either captured or slain.\n\nThis is the earliest event in the War of the Ring.",
    "conflict": "War of the Ring",
    "date": "June 20, 3018",
    "location": "Mirkwood",
    "outcome": "Gollum escapes, Beginning of the War of the Ring, Victory for Woodland Realm"
  },
  {
    "name": "Battle of Ithilien",
    "location": "Ithilien",
    "lotr_page_id": "10381",
    "text": "The BATTLE OF ITHILIEN was a skirmish between the Rangers of Ithilien\nand the Haradrim Warriors travelling to Mordor to aid Sauron. The\nHaradrim were traveling along the Harad road through Ithilien when\nsuddenly arrows began falling amongst their ranks. Hooded men, the\nrangers, were shooting at them from behind trees and rocks. The Haradrim\nbegan to scatter as soon as the Rangers of Ithilien shot down one of\ntheir Mumakil. The Rangers pursued them until they had slain nearly all\nof the Haradrim. Some escaped but were hunted down later that night. A\nMumakil escaped, and nothing was ever heard of what happened to it.\nFrodo Baggins and Samwise Gamgee watched the battle raged from a nearby\nwooded hill, right before they were captured by the Rangers."
  },
  {
    "name": "The War of the Great Jewels",
    "lotr_page_id": "7562",
    "location": "Beleriand",
    "text": "THE WAR OF THE JEWELS was a war that started when Morgoth stole the\nSilmarils from Fëanor, the elf who created them. Fëanor, subsequently,\ndeclared war on Morgoth and vowed that he would not rest until his\nprecious Silmarils were recovered, using even the name of Ilúvatar in\nhis foul and foolish oath. Convincing most of the Noldor to leave\nValinor and the “dictatorial” Valar behind and to journey back to\nBeleriand, Fëanor left Valinor with a great host using the stolen ships\nof the Teleri obtained from the Kinslaying. From there, the War of the\nGreat Jewels truly began.\n\nSome notable battles of this war include (in order): the First Battle of\nBeleriand, the Dagor-nuin-Giliath, the Dagor Aglareb, the Dagor\nBragollach, the Nirnaeth Arnoediad, and the final battle of the war, the\nWar of Wrath."
  },
  {
    "name": "Battle of Greenfields",
    "lotr_page_id": "3773",
    "location": "Shire",
    "text": "The BATTLE OF GREENFIELDS was a battle that took place in the northern\npart of the Shire in the latter-half of the Third Age, and was the only\ntime the Shire was ever attacked by Orcs.\n\n\nHistory\n\nIn TA 2747, a band of Orcs from Mount Gram led by their king Golfimbul\ninvaded the Shire. The Hobbits were prepared and met them with a force\nled by Bandobras Took in the Northfarthing. According to the traditional\nstory, Bullroarer charged the ranks of the Orcs on horseback and with a\nwooden club knocked Golfimbul's head clean off, sending it sailing a\nhundred yards through the air and down a rabbit-hole, thus winning the\nbattle and simultaneously inventing the game of golf.\n\nNo other battle occurred within the borders of the Shire until the\nBattle of Bywater on November 1, 3019, over two-hundred years\nlater."
  },
  {
    "name": "First Easterling invasion of Gondor",
    "lotr_page_id": "28363",
    "text": "The FIRST EASTERLING INVASION OF GONDOR was the first war between Gondor\nand the Easterlings during the early stages of their threat.\n\n\nHistory\n\nThe Easterlings attacked Gondor without warning or reason other then\npossibly that they coveted the lands of the Dúnedain, or out of some\nancient hatred of them. The invasion left little to no details nor were\nthere any named individual battles recorded but it is no doubt that the\nclashes were brutal and destructive as it took the armies of Gondor ten\nyears to defeat them. Never-the-less, they were finally defeated in TA\n500 by Tarostar, son of King Ostoher who took the name of Rómendacil\n“East-victor” after their defeat. Despite Rómendacil's glorious victory,\nthe Easterlings would remain a threat and would again renew their\nattacks on Gondor forty-one years later.\n",
    "conflict": "First Easterling War",
    "date": "TA 490 - TA 500",
    "location": "Gondor",
    "outcome": "Gondor victory"
  },
  {
    "name": "Ambush in Ithilien",
    "lotr_page_id": "22307",
    "location": "Ithilien",
    "text": "The AMBUSH IN ITHILIEN took place on March 21, 3019 during the War of\nthe Ring. A small force of Easterlings and Haradrim ambushed the Armies\nof the West as they were marching to the Black Gate.\n\n\nHistory\n\nBackground\n\nThe Armies of the West had decided to march to the Black Gate for a\nfinal encounter with Sauron. Aragorn wanted to make Sauron think that he\nhad the One Ring. That way, Frodo Baggins and Samwise Gamgee could\ndestroy the Ring inside Mount Doom. The Armies of Gondor and Rohan had\nabout 7,000 men.\n\nBattle\n\nAs the Armies of the West were marching through the Gondor province of\nIthilien, they were set upon by Easterlings and Haradrim also known as\nSouthrons. The Gondor and Rohirrim troops fended of the attack with no\nlosses. The Easterlings and Haradrim retreated. The Armies of the West\nwon the battle.\n"
  },
  {
    "name": "Fall of Rómendacil I",
    "lotr_page_id": "28366",
    "text": "The FALL OF RÓMENDACIL I was the battle in which Gondor fought the\nEasterlings and King Rómendacil I was slain.\n\n\nHistory\n\nForty-one years after their defeat by the then Tarostar, the Easterlings\nonce again attacked Gondor and this time with more success. Hordes and\nhordes of Easterlings fell upon Gondor with great strength. King\nRómendacil moved to stop them but was slain in a battle with them.\n\nAftermath\n\nIt is not mentioned what happened afterwards nor is it known what the\nEasterlings gained from this aside from the killing of a King of Gondor,\nas it is possible that Gondor had indeed lost the battle with the death\nof one of their greatest leaders. However, the realm of Gondor survived\nas Rómendacil's son Turambar immediately became King following his\nfather's death and quickly moved to avenge his father's death.\n",
    "conflict": "First Easterling War",
    "date": "TA 541",
    "location": "Ithilien",
    "outcome": "Apparent Easterling victory"
  },
  {
    "name": "Siege of Eregion",
    "lotr_page_id": "14131",
    "location": "Eregion",
    "text": "The SIEGE OF EREGION was a deadly battle between Sauron and the Elves of\nEregion during the Second Age, marking the beginning of the War of the\nElves and Sauron.\n\n\nHistory\n\nThe lord of Eregion, Celebrimbor, supervised the defense of the border\nof Eregion as he realized that Sauron was taking the route to the Fords\nof Isen. The High King Gil-galad sent Elrond to help Celebrimbor defend\nEregion from Sauron. Elrond marched at the head of a small army,\nintending to confront Sauron at Ost-in-Edhil. But he arrived too late,\nas the city was in ruins. When the army arrived they were surprised at\nthe fall of the city, and shocked by the death of Celebrimbor at the\nhands of Sauron. As such, they were quickly defeated by Sauron's forces.\nElrond managed to retreat and build a fortress in a valley of the Misty\nMountains called Rivendell."
  },
  {
    "name": "First Siege of Imladris",
    "lotr_page_id": "14133",
    "location": "Rivendell",
    "text": "The FIRST SIEGE OF IMLADRIS was an assault on Rivendell in mid-Second\nAge during the War of the Elves and Sauron.\n\n\nHistory\n\nElrond fled with the other Elves of Eregion to the Valley on the North\nof the Misty Mountains. Sauron, in the beginning, paid little heed\nbecause he suspected that Gil-galad, being the High King of the Ñoldor\nand thus Celebrimbor's superior, was in possession of all three Elven\nrings, although in truth he had two. Because of this, Sauron was focused\non defeating his ancient enemy and this spared the survivors of Eregion\nfrom annihilation. But knowing that Elrond will attack him from the\nrear, he sent a small force to lay siege on Rivendell. This force was\neventually defeated just in time for Elrond to come in from behind,\ncrushing Sauron's forces that survived the Battle of Gwathló between his\narmy and that of Gil-galad and the Numenoreans."
  },
  {
    "name": "Siege of Osgiliath",
    "lotr_page_id": "34770",
    "location": "Osgiliath",
    "text": "SIEGE OF OSGILIATH was a battle between the hosts of Mordor a Gondor\nduring the War of the Last Alliance at Second Age.\n\n\nPrelude\n\nSoon after conquest of Minas Ithil the Witch-king of Angmar took control\nof the fort, having collected a huge army of Orcs and Evil Men he\nprepared to attack Osgiliath\n\n\nBackground\n\nWhen the Witch King fell on Osgiliath, Isildur as best he could be\norganized and prepared a desperate defense, reflecting catapults Isildur\ndid pay dearly for the crossing of Anduin to the forces of Mordor, but\ncould not hold the Legions of Mordor and forced to retire. The main\ncontingent attacked Osgiliath East, while two other contingent the river\nto the north and south and attack Osgiliath West.\n\nIsildur had to leave Osgiliath East to defend the West but when he cross\nthe river saw could not contain both armies, so he run to Minas Anor as\nquicker possible to prepare for the attack."
  },
  {
    "name": "Battle of the Gwathló",
    "lotr_page_id": "10044",
    "location": "Tharbad",
    "text": "The BATTLE OF THE GWATHLÓ was the decisive battle of the War of the\nElves and Sauron that brought an end to Sauron's power for many\ncenturies.\n\n\nHistory\n\nAfter being driven off to the south-east of Eriador after heavy losses\nat Sarn Ford, Sauron's forces regrouped and joined with his forces in\nTharbad where they were assailed by the pursuing forces of Gil-galad,\nand then by a force of Númenóreans coming up through the Greyflood and\nattacking from their rear.\n\nIn the battle Sauron and his armies were utterly routed. The remaining\nsurvivors narrowly escaped but were assailed by Elrond just east of\nCalenardhon and destroyed, leaving Sauron with little more than a\nbodyguard to safely escape back into Mordor.\n\nThe ensuing victory left Sauron crippled but not defeated and being\nunconquered he slowly rebuilt himself throughout the ages until the\nthirty-third century, when he challenged Ar-Pharazôn for the\nover-lordship of Middle-earth."
  },
  {
    "name": "Battle of the Firth of Drengist",
    "lotr_page_id": "9494",
    "location": "Beleriand",
    "text": "The BATTLE OF THE FIRTH OF DRENGIST was a battle of the War of the\nJewels between the forces of Morgoth and the forces of the Ñoldor of\nHithlum.\n\n\nHistory\n\nAlmost one-hundred years after the Dagor Aglareb, Morgoth, believing\nthat Fingolfin's watch was weak, chose to attack him from the west\ninstead of from the northeast. Coming down from the cold north where no\nelf would dare enter, they came down the coasts of the Beleriand\nfollowing the route of the exiles long ago and entered the Firth of\nDrengist, hoping to take them by surprise but they were espied before\nthey could do so. The Ñoldor, led by Fingon easily defeated them and\ndrove the survivors into the sea. Afterwards, Morgoth choose to achieve\nhis ends by stealth biding his time and waiting until his strength was\nbuilt before he ever attacked in force again.\n\nThe battle was relatively small compared to those of past and was\nhistorically considered to be relatively unimportant despite the\nvictory"
  },
  {
    "name": "Battle of Dagorlad",
    "lotr_page_id": "2947",
    "location": "Dagorlad",
    "text": "The BATTLE OF DAGORLAD was the major battle of the War of the Last\nAlliance during the late Second Age.\n\n\nHistory\n\nThe battle took place in the year SA 3434. It was fought between the\narmy of the Last Alliance under Gil-galad and Elendil against an army of\nOrcs and other creatures loyal to Sauron, on the plains of Dagorlad just\noutside Mordor between Emyn Muil and Cirith Gorgor. The Last Alliance\nmet with the Anarion's Numenorean army which was holding Osgiliath and\nMinas Ithil, they marched to Dagorlad. Oropher and Amdír, annoyed by\nGil-galad's command, prematurely charged at the enemy and were driven\nback, and Amdír along with many Galadhrim Warriors died in the Dead\nMarshes. Eventually, the Alliance was able to drive back the the enemy\nforces and the army of the Last Alliance won the battle and was able to\nattack the Black Gate and proceeded to Udûn.\n\n\nEtymology\n\nThe word 'Dagorlad' means “Battle plain”, from the Sindarin _dagor_\n(“battle”) and _lad_ (“plain, valley”).\n"
  },
  {
    "name": "Battle of Sarn Athrad",
    "lotr_page_id": "12221",
    "location": "East Beleriand",
    "text": "The BATTLE OF SARN ATHRAD was a battle fought during the early sixth\ncentury of the First Age, at Sarn Athrad in the eastern Beleriand.\n\n\nHistory\n\nAfter sacking the ancient Elven kingdom of Doriath, the Dwarves of\nNogrod returning to Nogrod heavy laden and slowed by the spoils of their\nvictory. Upon reaching Sarn Athrad, they were suddenly assailed by a foe\nthey could not at first identify but as they climbed the river-banks of\nthe Gelion, they saw that they were elves.\n\nFrom the local woods, the Laiquendi of the Ossiriand led by Beren\nErchamion and accompanied by his son Dior defeated the Dwarves with\nBeren slaying the Lord of Nogrod himself and taking the Nauglamír, the\nNecklace of the Dwarves from him.\n\nThe Dwarves that managed to escape the route attempted to climb the\nslopes beneath Mount Dolmed were waylaid by the Ents who lived in the\nwoods next to the Blue Mountains, and destroyed.\n\nThis was Beren's last battle before retiring permanently to Tol Galen in\nthe Ossiriand with his wife Lúthien."
  },
  {
    "name": "Battle of Dol Guldur",
    "lotr_page_id": "10389",
    "text": "The BATTLE OF DOL GULDUR, also known as the FALL OF DOL GULDUR, was one\nof the battles of the north fought during the War of the Ring. The Elves\nof Lothlórien and Mirkwood decided to attack and destroy the last\nremaining fortress of Sauron's servants in Rhovanion: Dol Guldur.\n\n\nHistory\n\nThe Nazgûl who guarded the castle were absent, and its army had been\ndefeated four times by the Elves of Lórien. The actual manner of the\nbattle is not mentioned, but the end is certain. On April 6, Galadriel\ncame to the gates and through unspecified means cast down the walls,\nfoul pits and crevices. The evil realm of Dol Guldur was finally\ndestroyed and the forest was cleansed.\n\nOn the same day, Celeborn and King Thranduil met in the midst of the\nforest and renamed it _Eryn Lasgalen_, “wood of green leaves”. Celeborn\ntook the land south of The Narrows for himself and named it East Lórien,\nwhile Thranduil took all wood north of the Mountains of Mirkwood, and\nthey gave the middle of the wood to the Beornings and Woodmen.",
    "conflict": "War of the Ring",
    "date": "March 28 - April 6, 3019",
    "location": "Dol Guldur",
    "outcome": "Dol Guldur destroyed and Mirkwood is cleansed of evil"
  },
  {
    "name": "Conquest of Rhûn",
    "lotr_page_id": "28430",
    "location": "Rhûn",
    "text": "The CONQUEST OF RHÛN was the last event of the First Easterling War and\nthe first expansion of Gondor's power.\n\n\nHistory\n\nAfter King Turambar defeated the Easterlings on the field in TA 541\navenging his father's death, Turambar led Gondor's armies deep into Rhûn\npast the Sea of Rhûn. All the lands east of Dagorlad, south of the\nrealm of Rhovanion, north of the Ash Mountains, and west of the Sea of\nRhûn fell to the might of Gondor. The conquest was complete by TA 550\nand marked the foundation of the East-lands.\n\nAftermath\n\nWhether this meant Gondor ruled over Easterlings or subjugated them is\nnot known only that these new eastern territories became a province of\nthe Kingdom of Gondor. It is possible that the Easterling\npopulation was expelled from the territory and forced further east where\nthey continued to live, as there is no mention of Easterlings being\nsubjected by Gondor in the East-lands. This seems likely since new\ntribes of Easterlings, organized and still hostile to Gondor would\nappear though it would be nearly 800 years later.\n"
  },
  {
    "name": "Burning of the Ships",
    "lotr_page_id": "30458",
    "location": "Alqualondë",
    "text": "The BURNING OF THE SHIPS was an event which occurred at the beginning of\nthe First Age at Losgar after Fëanor and his followers stole the\nswanships of the Teleri from Alqualondë.\n\n\nHistory\n\nPrelude\n\n\n\nAfter the death of Finwë and the theft of the Silmarils by Melkor,\nFëanor and his seven sons swore an oath and went into exile. Many Elves\nfollowed them, including the House of Fingolfin and the children of\nFinarfin.\n\nThey came to Alqualondë and Fëanor demanded to use the swanships of the\nTeleri. However, the Teleri refused and resisted when Fëanor tried to\ntake them by force. The first kinslaying took place and many of the\nTeleri were slain.\n\nThe Event\n\nIn YT 1497, Fëanor had ordered the burning of the ships, and had left\nthe host of Fingolfin behind. At dawn, Fëanor and his sons discovered\nthe death of Amrod, who slept in the first burned ship. This was\nchanged in the published _Silmarillion_, which states that all seven of\nthe Sons of Fëanor reached Middle-earth.\n\nAftermath\n\nAfter the burning of the ships, Fëanor fought in the Dagor-nuin-Giliath\nand died afterward."
  },
  {
    "name": "Second Siege of Minas Ithil",
    "lotr_page_id": "33178",
    "location": "Minas Morgul",
    "text": "The SECOND SIEGE OF MINAS ITHIL was an engagement between the armies of\nGondor and Mordor during the War of the Last Alliance. The Gondorian\nhost, commanded by Anárion, brother of Isildur, counterattacked the\ncitadel after it had fallen a year before, defeating Mordor's garrison\nand recapturing Minas Ithil.\n\n\nThe Siege\n\nIn SA 3429, Isildur, who was then in command of Minas Ithil, lost the\ncitadel to a large army that had marched from Mordor's interior. Though\nhe managed to escape with his family, Mordor's hosts now were poised to\nassault the Anduin, and caused terror and bloodshed for the forces of\nGondor in Ithilien. A year after Minas Ithil fell, Anárion led an army\nfrom Osgiliath in an attempt to take the fortress. In less than a year,\nthey were victorious.\n\n\nAftermath\n\nThe reconquest of Minas Ithil helped to prevent a Mordor assault from\nbeing launched across the Anduin unopposed, and allowed the Last\nAlliance to concentrate on a single front of war, far to the north.\nAnárion rebuilt Minas Ithil, but in the Third Age it fell into\nnear-abandonment by Gondor, only to be retaken by the Ringwraiths in TA\n2002."
  },
  {
    "name": "Battle Under the Trees",
    "lotr_page_id": "26030",
    "text": "The BATTLE UNDER THE TREES was a battle that took place during the War\nof the Ring, between the forces of Mirkwood, under the command of its\nElven-king Thranduil, and the forces of Sauron from Dol-Guldur.\n\n\nHistory\n\nOn March 15, 3019, the realm of Thranduil was invaded by the forces of\nDol-Guldur. The majority of the forces were sent to Lothlórien, using\nits remaining forces to attack the Woodland realm, trying to secure the\nElvenking's flank. Easterlings were supposed to arrive and overwhelm\ntheir army, but they were occupied in battle with the Dwarves and Men at\nthe Lonely Mountain. The Elvenking himself repels these forces, and\nthere is a long battle from which ensued a “great ruin of fire” among\nthe woods. King Thranduil and his people emerged as victors, and he\nannounced a New Year of the Elves.\n\nAftermath\n\nOn the day of the New Year, Thranduil and Celeborn met in the forest\nwhere they rename Mirkwood as Eryn Lasgalen, The Wood of the\nGreenleaves. Thranduil gave the southern part of his realm to\nCeleborn, and kept the northern part as far as the mountains for himself\nand his people. The woodlands in between were given to the Beornings and\nWoodmen.",
    "conflict": "War of the Ring; Dol-Guldur invades Mirkwood",
    "date": "March 15, 3019",
    "location": "Mirkwood",
    "outcome": "Thranduil claims victory"
  },
  {
    "name": "Battle of the Powers",
    "lotr_page_id": "9120",
    "location": "Utumno",
    "text": "The BATTLE OF THE POWERS was the last great battle of the War for Sake\nof the Elves in which the forces of the Valar defeated Melkor's forces\non the fields of Middle-earth and forced them to retreat into Utumno.\nThe ensuing siege was very costly for the Valar, but their forces\nfinally overcame Melkor's defenses and captured him.\n\n\nHistory\n\nThe hosts met each other in the northeast of Middle-earth and for an\nunknown time they fought, until the Host of the Valar was victorious.\nFrom the perspective of the Ainur, the battle was short and was a swift\nvictory for the Valar; the remaining forces of Melkor retreated to the\nsafety of Utumno where they fortified themselves, and thus began the\nSiege of Utumno. Its effects on the continent were devastating and shook\nthe earth and broke the lands and seas, changing them forever until the\nend of the War of Wrath thousands of years later.\n\nAlthough the Valar host initially suffered light casualties and\ndecisively defeated Melkor's forces, the following siege of Utumno was\ndescribed as long and terrible for the Valar. After many years of\nbesieging the fortress, and with severe casualties, the Valar were\nfinally victorious, chaining Melkor and scattering his host."
  },
  {
    "name": "Angmar War",
    "lotr_page_id": "14079",
    "text": "The ANGMAR WAR was a centuries-long struggle between the Northern\nDúnedain kingdom of Arnor (mainly Arthedain) and the forces of Angmar,\nled by the Witch-king of Angmar.\n\n\nHistory\n\nAfter 1000 years of peace that followed the Battle of the Last Alliance,\nevil once more began to spread across Middle-earth. In the year 1300 of\nthe Third Age, evil things started to stir in Middle-earth again, and\nthe Nazgûl re-appeared. The Witch-king settled in Angmar with its\ncapital city at Carn Dûm, and after having built an army there, invades\nArnor in the year TA 1409, and wages a war lasting nearly 500 years\nagainst the Kingdom of Arnor, the Northern-Kingdom of Men. The tower of\nAmon-Sûl is destroyed, but the great fortress of Fornost is defended,\nand war continues. After the Great Plague in TA 1636 which devastates\nGondor and desolates many parts of Eriador, the southern part of Arnor,\nthe Witch-King finally destroys Fornost TA 1974, and takes it as his own\nfortress.\n\nKing Eärnur of Gondor, after receiving a message from Arnor from help\nfinally arrived with a formidable force and defeated the forces the\nWitch-king at the Battle of Fornost. Despite the victory of the allies\non the field, the already divided Kingdom of Arnor fell but its remnants\ncontinues under the leadership of the Chieftain of the Dúnedain.",
    "conflict": "Angmar War",
    "date": "TA 1300 - TA 1975",
    "location": "Eriador",
    "outcome": "Pyrrhic victory for the Free Peoples of Middle-earth; Angmar completely, destroyed, but Arnor also destroyed"
  },
  {
    "name": "War of the Dwarves and Dragons",
    "lotr_page_id": "33947",
    "location": "Grey Mountains",
    "text": "The WAR OF THE DWARVES AND DRAGONS was a conflict that took place from\nTA 2570 to 2589.\n\n\nBackground\n\nThe defeat of Morgoth in the War of Wrath left the Dragons few and weak,\nhiding mostly in the Forodwaith of Middle-earth. But over the millennia\nthe Dragons multiplied and became strong once again. Even centuries\nbefore the beginning of the war, the Dragon Scatha had stolen treasure\nfrom the Dwarves and kept it in his hoard; unfortunately, Scatha was\nslain by Fram of the Éothéod, who kept the treasure for himself.\n\n\nHistory\n\n\n\nIn TA 2570, the Dragons made war on the Dwarves of the Grey Mountains,\nsacking and plundering their halls and mines. The war lasted for almost\ntwenty years, but in TA 2589 the Dragons attacked the halls of King Dáin\nI, and outside city a great Cold-drake killed the king and his second\nson Frór.\n\nAfter this defeat, most of Durin's folk abandoned the Grey Mountains.\nKing Thrór and some of his followers went back to the former Dwarven\ndwelling of the Lonely Mountain, while his younger brother Grór led\nothers to the Iron Hills.\n\n\nAftermath\n\nThe Dwarves of the Iron Hills, as well as the Dwarves of the Lonely\nMountain, managed to prosper for the following couple of centuries.\nHowever the threat of Dragons would revisit their history: in TA 2770,\nSmaug flew south from the North “like a hurricane” and attacked the\nwealthy Dwarven Kingdom."
  },
  {
    "name": "Battle of South Ithilien",
    "lotr_page_id": "28897",
    "text": "The BATTLE OF SOUTH ITHILIEN was a battle between Gondor and the\nHaradrim.\n\n\nHistory\n\nBackground\n\nThe Wainriders were beginning to recover themselves from their defeat at\nDagorland and were apparently not completely driven out by the rebellion\nin Rhovanion, and now had new allies from Khand and Harad. The new\nÉothéod lord, Forthwini found out about this and warned King Ondoher of\nit. Meanwhile, Eärnil, based at Pelargir received this news on the ninth\nday of Cermië and prepared a force that crossed the river Anduin in\npart, leaving the Fords of the Poros purposely undefended.\n\nPrelude\n\nEärnil's southern army camped forty miles north in South Ithilien\napparently waiting to face the enemy from the south or to support the\nforces led by his king in the north. Unfortunately, things went ill for\nthe king at the Black Gate leading to the death of him and his son. Now\nEärnil would face an army of Haradrim.\n\nThe Battle\n\nThe Haradrim crossed the Poros and Eärnil met them. Eärnil utterly\ndefeated them destroying the entire army. Little to no\ndetails are known about the battle itself save that the Haradrim army\nwas completely destroyed, and Eärnil's losses were apparently light.\n\nAftermath\n\nAfter Eärnil's victory, he and his army moved north to assail the\nWainriders, who believing they were now victorious over Gondor were busy\nfeasting and celebrating in their camps. Here, Eärnil would defeat them\nonce and for all.\n",
    "conflict": "Wainrider War",
    "date": "Cermië ?, 1944",
    "location": "Ithilien",
    "outcome": "Decisive Gondor victory."
  },
  {
    "name": "War of the Elves and Sauron",
    "lotr_page_id": "895",
    "location": "Eriador",
    "text": "The WAR OF THE ELVES AND SAURON was the great war fought in the\nmid-Second Age in Middle-earth, which ended with his defeat at Mount\nDoom.\n\n\nHistory\n\nThe war began in SA 1693, almost a century after Sauron had deceived the\nÑoldor of Eregion and had forged the One Ring, deceiving and claiming\nall the Rings of Power from the fortress Ost-in-Edhil, except the Three\nRings of the Elves.\n\nMessages of this betrayal were sent north to Lindon where the High King\nGil-galad ruled, and he began amassing his forces, preparing for an\ninvasion. He also called for help from Númenor.\n\nIn SA 1695 Sauron attacked, crossing the Fords of Isen and beginning the\nSiege of Eregion. Elrond was sent to Eregion by Gil-galad with\nreinforcements. However, in SA 1697 Eregion was laid waste. Celebrimbor,\nLord of Eregion, was killed, and Khazad-dûm's gates were closed. Elrond\nfled north with the survivors, founding Rivendell.\n\nBy SA 1699 all of Eriador fell under Sauron's control, and he set fire\nto the great forests in Enedwaith and Minhiriath to drive off the Elves\nand their allies, the Edain. Imladris was besieged, and Lindon cut off\nfrom Rivendell and Khazad-dûm.\n\nThe next year a great army of Númenor arrived, sent by Tar-Minastir and\ncommanded by Ciryatur, which landed in Lindon, at Tharbad on the\nGwathló, and south near Pelargir. Sauron's forces were caught in between\nthe armies, and destroyed. The war ended in SA 1701 when Sauron\nretreated to the east, but Eregion was gone, and most of Eriador\ndestroyed."
  },
  {
    "name": "Siege of Angband",
    "lotr_page_id": "2750",
    "text": "The SIEGE OF ANGBAND was the name given to a 400 year-long Ñoldor\ncontainment of Morgoth's forces within his fortress of Angband during\nthe First Age, which began following the Dagor Aglareb. Though called a\nsiege, this containment was not technically a siege at all as the Elves\nand Edain were unable to actually assault Angband; they were merely able\nto battle Morgoth's Orcs when they chose to emerge.\n\n\nHistory\n\nThe encirclement of Angband was incomplete, as Morgoth was still capable\nof sending out various forces of Orcs to weaken the Ñoldor (such as the\nattack of Hithlum), mainly from the impassable north flanks of the\nfortress near the unguarded Iron Mountains. The Ñoldor had grown strong\nenough, however, and these raiding forces posed no significant threat.\nBut these raids enabled Morgoth to coerce people who were captured to\nhis service, which would later prove very disastrous to the Ñoldor and\ntheir allies.\n\nThough considered by Fingolfin, the Elves never planned in earnest nor\nexecuted any sort of offensive action against Angband. The Elven\nkingdoms had prospered greatly during the time of the siege, and most\nwere unwilling to engage in a seemingly needless battle in which they\nbelieved innumerable Elves would perish, whether in victory or defeat.\nThe Elves in fact did not have the ability to overthrow Angband no\nmatter what they did, but at the time, Fingolfin did not fully\ncomprehend the power of Morgoth. The Siege was broken in the Dagor\nBragollach in FA 455, and no similar leaguer was ever re-established.",
    "conflict": "The War of the Great Jewels",
    "date": "FA 60",
    "location": "Angband",
    "outcome": "Angband victory"
  },
  {
    "name": "Battle of Tumhalad",
    "lotr_page_id": "2449",
    "location": "West Beleriand",
    "text": "The BATTLE OF TUMHALAD was the last battle of the Elves of Nargothrond\nand the last of the pitched battles against the forces of Morgoth until\nthe War of Wrath. It was fought on the plain of Tumhalad between the\nriver Narog and its tributary, the river Ginglith in FA 495.\n\n\nHistory\n\nThe battle was fought as result of a massive Orc buildup beneath the\nEred Wethrin and in the Pass of Sirion. Messengers from Círdan the\nShipwright brought these tidings, with a message from Círdan concerning\na warning given to Círdan by the Vala Ulmo. Ulmo had told Círdan that\nthe Elves of Nargothrond shouldn't fight abroad, and instead to stay in\ntheir fortress.\n\nTúrin Turambar, who had by this time become an influential commander of\nNargothrond's armed forces, urged its king, Orodreth to venture out and\nfight the forces of Morgoth in the open. The Elves of Nargothrond,\nhowever, weren't used to battle in the open field for they had always\nwaged a secret war, ambushing but never assaulting the forces of\nMorgoth. Also, the evil hosts were larger than anticipated and led by\nthe Dragon, Glaurung.\n\nUltimately, the forces of Nargothrond couldn't withstand the assault of\nthe enemy host and were driven towards the plain of Tumhalad, where most\nof them, including King Orodreth and his kinsman Gwindor, were slain.\nOnly Túrin withstood the fiery attack of Glaurung for he wore the\nDragon-helm of Dor-lómin. The defeat suffered by the Elves paved the\nroad for the Sack of Nargothrond by Glaurung, and the death and\nenslavement of many captives, including Finduilas."
  },
  {
    "name": "Battle of the Plains",
    "lotr_page_id": "28294",
    "text": "The BATTLE OF THE PLAINS was a battle between Gondor, its Northmen\nallies, and the Wainrider invaders.\n\n\nHistory\n\nAfter five years of ravaging eastern Gondor and the Northmen of\nRhovanion, Gondor assembled a large army with many scattered remnants of\nloyal Northman allies under the leadership of Narmacil II. The King\nmarched his great host north from Ithilien to the open plains just south\nof Mirkwood where they met their foe. However, Narmacil's great host was\ndefeated and cost Narmacil his life.\n\nAftermath\n\nAfter the battle was lost, the Northman noble Marhari involved in\nleading a rearguard action against the enemy was slain. The survivors\nfled south over Dagorlad and back into Ithilien and Gondor was forced to\nabandon its eastern lands. The majority of the Northmen fell into\nslavery and those that did not withdrew further north over the River\nRunning and into Dale, where they joined with the Men of Dale. Others\ngathered around Marhari's son Marhwini, who settled the Vales of Anduin\nbetween Mirkwood and the river Anduin with fugitives slaves from\nRhovanion, who joined with them later. These survivors and refugees\nwould later become the Éothéod, an ally of Gondor.\n\nLegacy\n\nThe loss at the Plains led to the later creation of the Rohirrim out of\nthe Éothéod who were survivors of the battle. These warrior-folk would\nmaintain friendship with Gondor and centuries later would take the Oath\nof Eorl and settle the Gondor province of Calenardhon, later renamed\nRohan and remain an eternal ally of Gondor and the later Reunited\nKingdom, fortunately, there foes suffered from not light casualties as\nwell, providing enough time for them to strike back.",
    "conflict": "Wainrider War",
    "date": "TA 1856",
    "location": "Mirkwood",
    "outcome": "Pyrryhic but strategical Wainrider victory. Gondor loses its eastern, territories. Most of Rhovanion enslaved. Wainrider's advance was forced, to be checked due to too severe casualties."
  },
  {
    "name": "Second Battle of Dagorlad",
    "lotr_page_id": "28316",
    "text": "“The SECOND BATTLE OF DAGORLAD” refers to the battle fought between\nGondor and the Wainriders during the middle of the Third Age.\n\nThe event is not told of in the works that mention the greater Battle of\nthe Last Alliance, part of which took place at Dagorlad, during the\npreceding Age.\n\n\nHistory\n\nPrelude\n\nThe battle was precipitated by a warning from the Éothéod Lord Marhwini\nto King Calimehtar that the Wainriders were again about to attack Gondor\nonce again. Their plan was to attack the Gondor province of Calenardhon\nfrom the across the Undeeps and that a full scale rebellion in Rhovanion\nwas in preparation. Calimehtar assembled his army and Marhwini prepared\na éored.\n\nThe Battle\n\nCalimehtar led his army up through Ithilien openly ensuring the enemy\nwould know their intent. Seeing this, the Wainriders committed all they\nhad in a great force to meet them, then Calimehtar turned away which led\nthem west into Dagorlad further from their conquests in Rhovanion, and\nthere a great battle began. During the long struggle, Calimehtar sent\ncavalry over the Undeeps which were unguarded by the enemy due to them\nsending everything against Calimehtar's main host. Here, they joined up\nwith Marhwini's éored and attacked the enemy from the rear sealing their\ndoom. Gondor was victorious. The Wainriders scattered in disarray.\n\nAftermath\n\nThough Gondor won, Calimehtar did not pursue them to the death for the\nmost part but Marhwini's cavalry continued to harass the survivors near\nsouthern Mirkwood, humiliating and taunting them at all at the harm they\nhad done to the innocents of Rhovanion. Soon afterwards, the Northmen\nwould rebel against their cruel overlords and be free of them.",
    "conflict": "Wainrider War",
    "date": "TA 1899",
    "location": "Dagorlad",
    "outcome": "Gondor victory"
  },
  {
    "name": "Minalcar's Defeat of the Easterlings",
    "lotr_page_id": "29009",
    "location": "Rhovanion",
    "text": "MINALCAR'S DEFEAT OF THE EASTERLINGS was a battle between Gondor and the\nEasterlings in the mid-Third Age.\n\n\nHistory\n\nBackground\n\nFor an unknown number of years before and during the inactive King\nNarmacil I's rule, the Easterlings began attacking Gondor and the west\nagain apparently conducting raids on Gondor's Northman allies in\nRhovanion. However, Gondor never faced them in any major open battle\nsolely on their own preferring to rely on their allies to check the\ninvaders. This changed when word reached Minalcar, the Regent of Gondor\nthat some of their Northman allies were unreliable and at times fought\non the side of the Easterlings out of promises of a share in the spoils\nof war, greed, or out of the need of allies to aid in the settling of\nfeuds between their princes.\n\nThe Battle\n\nFinding this situation unacceptable, Minalcar assembled a great army and\nmarched it out of Gondor and met a large Easterling army somewhere\nbetween Rhovanion and the Sea of Rhûn. Minalcar utterly defeated them\nwith possibly only minimal losses. The losses however for the\nEasterlings were devastating as Minalcar's armies obliterated all their\nencampments east of the Sea of Rhûn, threatening both the realm of\nRhovanion and Gondor.\n\nAftermath\n\nMinalcar's victory marked the end of the Second Easterling War putting\nan end to any further attacks by the Easterlings on Gondor and the\nNorthman realm of Rhovanion, as well as their influence on its people.\nMinalcar declared himself 'Rómendacil' increasing his popularity at\nhome. Gondor's victory led to the west shore fortifications on the\nAnduin and the building of the Argonath. The Northman of Rhovanion were\nalso brought under full influence of Gondor.\n"
  },
  {
    "name": "Battle of the Peak",
    "lotr_page_id": "9418",
    "text": "BATTLE OF THE PEAK was the climax of the fight between Gandalf the Grey\nand the Balrog (Durin's Bane) atop Zirakzigil after they ascend the\nEndless Stair from Moria.\n\n\nHistory\n\nAfter their fight at the Bridge of Khazad-dûm, Gandalf and the Balrog\nboth fell into the deep chasm. Gandalf was burned by the Balrog's fire\non the way down, then almost froze in the water at the bottom, then\npursued his foe for days through dark tunnels, and then all the way up\nthe Endless Stair and to the top of Durin's Tower in the living rock of\nZirakzigil, where the two engaged in a two-day long battle at the\npinnacle of the Silvertine above the clouds. They fought in a narrow\nspace upon Celebdil, above the mists of the world. The sun shone\nfiercely, but all below was wrapped in cloud, so that anyone watching\nfrom below would think they saw flashes from lightning and heard\nthunder. A great smoke of vapor and steam rose about them, and ice fell\nlike rain.\n\nThere they fought until at last Gandalf threw down his enemy, and the\nBalrog broke the mountain-side as it fell. Then darkness took Gandalf,\nand he passed away. The battle had left Durin's Tower in ruins and\ncaused the destruction of the Endless Stair. The entire battle, from the\nconfrontation on the Bridge of Khazad-dûm to the mutual demise of the\nBalrog and Gandalf, had taken ten days.\n\nGandalf's body lay on the peak for nineteen days, until he was\nresurrected by Eru and sent back to Middle-earth alive to complete his\ntask. For three days he lay in a trance, until he was found by the\nWindlord Gwaihir and carried to Caras Galadhon in Lothlórien, where he\nwas healed and clothed in white, and thus became Gandalf the White, more\npowerful than ever before.",
    "conflict": "War of the Ring",
    "date": "January 25, 3019",
    "location": "Zirakzigil",
    "outcome": "Death of the Balrog (Durin's Bane); Death of Gandalf the Grey;, Destruction of Durin's Tower and the Endless Stair"
  },
  {
    "name": "Glaurung's attack on the Beleriand",
    "lotr_page_id": "32274",
    "location": "Beleriand",
    "text": "GLAURUNG'S ATTACK ON THE BELERIAND was a lone attack on the Beleriand by\nthe young “Father of Dragons” Glaurung.\n\nThe attack failed.\n\n\nHistory\n\nBackground\n\nDuring the Siege of Angband, the Ñoldor successfully laid siege to\nAngband building many castles and fortifications that ever watched the\nGates of Angband, and no doubt kept legions of mounted and unmounted\nsentinels on the plain of Ard-galen. Fenced in, Morgoth choose not to\nattack in force as before and took council with himself on how he might\ndefeat his enemy in other ways. During these long years, Morgoth began\nthe breeding of the Dragons and the most prominent and well-known in\nlater years was Glaurung, the first of the deadly Fire-drakes.\n\nThe Attack\n\nGlaurung, still young and only half-grown felt strong enough to strike.\nWithout orders from his master, he came forth suddenly from the Gates of\nAngband. At first the Ñoldor were terrified at this new menacing foe and\nfled before him southward, allowing him defile Ard-galen with his hot\nblasts of destroying flames, but the Ñoldor were not defeated and\nregrouped in around Dorthonion and Ered Wethrin under Fingon. They rode\nup to face him hitting him with volley after volley of arrows and soon\nhe was surrounded. At point-blank range, Fingon and his Ñoldor riders\ncontinued their barrage of arrows and Glaurung unable to endure these\nweapons due to his weak armor was defeated. Wounded, Glaurung was able\nto escape back to Angband safely.\n\nAftermath\n\nWhile the Ñoldor celebrated their victory, Glaurung was scolded by\nMorgoth for revealing himself too soon and without full strength.\nAfterwards, there was peace for two-hundred some years with the Ñoldor\ncreating great watchtowers behind which the fruits of peace\nflourished.\n"
  },
  {
    "name": "Second Easterling War",
    "lotr_page_id": "28997",
    "text": "The SECOND EASTERLING WAR was a war between Gondor and the Easterlings\nin the mid-Third Age.\n\n\nHistory\n\nBackground\n\nSometime in the early thirteenth century, Gondor began to sense that the\nEasterlings were once again becoming a threat as they were apparently\nconducting raids on the Northmen of Rhovanion. Needing allies, Gondor\ngranted them lands south of Greenwood the Great hoping they would stand\nagainst the Easterlings in support of Gondor, so there were no major\nopen battles between Gondor and the Easterlings at this time.\n\nAttacks Begin\n\nThe attacks began again during Narmacil's time and were at first not\nvery large and not enough for Gondor to respond directly in open battle.\nThe situation changes a short time afterwards when word reached\nMinalcar, the Regent of Gondor that some of their Northman allies were\nunreliable and agreed to fight on the side of the Easterlings out of\npromises of a share in the spoils of war, greed, or out of the need of\nallies to aid in the settling of feuds between their princes. This\nprompted Minalcar to take action directly against the Easterling\ninvaders.\n\nEasterlings Defeated\n\nIn TA 1248, Minalcar led a great army out of Gondor and met a large\nEasterling army somewhere between Rhovanion and the Sea of Rhûn. Here,\nMinalcar utterly defeated them on the field of battle and proceeded to\ndestroy all their encampments east of the Sea of Rhûn, threatening both\nthe realm of Rhovanion and Gondor.\n\nAftermath\n\nAfter the war, Minalcar renamed himself 'Rómendacil' increasing his\npopularity within the realm. He fortified the west shores of the Anduin\nand built the Argonath both as defenses and warnings to all possible\ninvaders of Gondor. The Northmen of Rhovanion was also brought under\nfull influence of Gondor.",
    "conflict": "Easterling Wars",
    "date": "Early thirteenth century ? - TA 1248",
    "location": "Rhovanion",
    "outcome": "Decisive Gondor victory"
  },
  {
    "name": "Kin-strife",
    "lotr_page_id": "626",
    "location": "Gondor",
    "text": "The Kin-strife was a disastrous civil war in Gondor in the Third Age.\n\n\nBackground\n\nThe unrest that created the Kin-strife began when Valacar, the son of\nthe Gondor king Rómendacil II, married a woman of the Northmen of\nRhovanion, Vidunavi. She bore him a son Eldacar, but many of the people\nof Gondor of Númenórean blood were angered by this mixing of blood of\nMiddle Men and Númenóreans, and the coastal provinces rebelled when\nValacar grew old.\n\n\nCivil War\n\nWhen in TA 1432 Eldacar succeeded his father the unrest grew into open\nrebellion, as many people saw Eldacar as a half-breed who had no right\nto rule. The chief of them was his distant relative Castamir the\nUsurper, Lord of Ships, who in TA 1437 usurped the throne, forcing\nEldacar into exile. Castamir was supported by the people of the realm of\nUmbar, who sought revenge against Gondor. During the rebellion Osgiliath\nwas burned, and the great Dome of Stars was lost, together with its\nPalantír. Castamir also murdered Eldacar's son and heir Ornendil.\nEldacar fled to Rhovanion, and Castamir ruled in his stead.\n\nA full decade later, in TA 1447, Eldacar returned with Rhovanion troops;\nat the same time a rebellion against Castamir's cruel rule took place.\nEldacar managed to kill Castamir at the Battle of Erui, but Castamir's\nsons and many of their supporters fled south to Umbar. Eldacar could not\nfollow them, as the fleet was under Castamir's control.\n\nNot only did Gondor lose the city of Umbar for four centuries and gain a\nnew enemy in the Corsairs of Umbar, descendants of Castamir's sons, but\nalso many of the Númenóreans of purest blood were killed during the\ncivil war, leaving Gondor weakened.\n\nThe Kin-strife was, along with the Great Plague and sheer laziness one\nof the chief reasons for the abandonment of the fortresses in and\nsurrounding Mordor."
  },
  {
    "name": "Battle of the Field of Celebrant",
    "lotr_page_id": "4371",
    "text": "The BATTLE OF THE FIELD OF CELEBRANT was a battle which was fought at\nthe Field of Celebrant in Middle-earth against the Balchoth, which soon\nled to the creation of the Kingdom of Rohan.\n\n\nPre-Battle\n\nThe ancestors of the Rohirrim were called to the aid of Gondor because\nthey were attacked by the Balchoth who frequently made raids on the\neastern side of Anduin until the people left. Cirion learned from his\nspies that the Balchoth were gathering a great army to attack the\nprovince of Calenardhon on the west side of the river and the defence\nthere was too weak for an attack. Cirion prepared to lead an army to\nCalenardhon and sent six riders to ask for help. These went through the\nBalchoth army and five were killed while one named Borondir made it to\nthe land of Éothéod and delivered his message. Eorl the Young realized\nthat if Gondor fell soon his people might too. So Eorl led 7000 riders\nand hundreds of mounted archers on the journey to the 500 mile trip to\nCalenardhon.\n\n\nThe Battle\n\nThe Balchoth had built many boats on the side of Anduin at the Undeeps\nof Calenardhon and came over and crossed the river and with their\nsuperior numbers overcame the forces on the west bank easily. Soon\nCirion came with an army of reinforcements, but the Balchoth cut them\noff and drove them to the north over the Limlight to the Field of\nCelebrant and then a host of Orcs came and attacked Cirion's forces\ndriving them to Anduin. When the situation looked bleak for Gondor the\nÉothéod arrived and crossed the Undeeps into Calenardhon and came over\nto the Limlight to attack the Wainriders and the Orcs from the rear.\nThis combined force of Gondor and the Éothéod drove the Balchoth across\nthe Limlight then slew the invaders until Calenardhon was free.\n\n\nPost-Battle\n\nSoon after the battle the land became Rohan and Eorl swore an oath to\nGondor to help them in their time of need.",
    "conflict": "Balchoth War",
    "date": "April 15, 2510",
    "location": "Field of Celebrant",
    "outcome": "Victory for the Éothéod, and Gondor"
  },
  {
    "name": "Battle of Azanulbizar",
    "lotr_page_id": "2521",
    "text": "The BATTLE OF AZANULBIZAR, known also as the BATTLE OF NANDUHIRION,_'\nthe Battle of Moria_', or the BATTLE OF DIMRILL DALE, was the last\nbattle in the War of the Dwarves and Orcs.\n\n\nHistory\n\nThe Battle of Azanulbizar was fought in the year TA 2799 at the eastern\ngate of Moria between the Dwarves of all houses and the Orcs of the\nMisty Mountains.\n\nIt was the greatest battle of the War of Dwarves and Orcs, and was a\ndecisive victory for the Dwarves. However, the battle claimed the lives\nof many, including Frerin, the second son of Thráin II, and the younger\nbrother of Thorin Oakenshield. Fundin, father of Balin and Dwalin, also\nfell. Náin, son of Grór was slain in a fight with Azog, right outside\nthe East Gate. Azog was then slain in turn by Náin's son Dáin Ironfoot.\n\nAfter the Orcs were routed, Thráin II, heir of Durin, wished to enter\nand reclaim Moria after the War. However, the Dwarves of Durin's folk\nwere too few, and the Dwarves of the other six houses believed that they\ndid not have the strength to confront Durin's Bane, though none knew\nwhat it was.\n\nThe aftermath of the battle and the overall war resulted in devastating\nlosses for all the dwarves involved, but virtually all of the Orcs\ninfesting the Misty Mountains were destroyed, leaving only a handful\nleft. This resulted in the Misty Mountains being relatively safer for\nthe next two centuries. The Battle of Azanulbizar was also where Thorin\nearned the name “Oakenshield”; after his shield was broken during the\nbattle, he cleaved a great branch from a nearby oak tree to use as both\na shield and a bludgeon.\n\nThe Dwarves' losses were so great that it was impossible to bury all\ntheir dead, and instead the corpses were burned on funeral pyres. In\nlater years, the relatives and descendants of these casualties would\ncommonly say of their ancestor, _“He was a burned Dwarf”_, a remark\ninstantly understandable as a reference to Azanulbizar and the Dwarves\nwho died there.\n",
    "conflict": "War of the Dwarves and Orcs",
    "date": "TA 2799",
    "location": "Azanulbizar",
    "outcome": "Costly victory for the Dwarves, War ends, Misty Mountains were, relatively safe for the next 2 centuries."
  },
  {
    "name": "Battle of Fornost",
    "lotr_page_id": "584",
    "location": "Fornost",
    "text": "The BATTLE OF FORNOST was the decisive battle between the forces of\nAngmar, under the Witch-king, and of Eärnur, the Crown Prince of Gondor,\nin the year TA 1975 that ended the evil northern Kingdom of Angmar.\n\n\nHistory\n\nA year prior to the battle, the armies of Angmar conquered Arthedain,\nthe last realm of Arnor. Angmar's armies had taken Fornost, the capital\nof the Dúnedain, and Arvedui, the last King of Arnor, had drowned in the\nIce-Bay of Forochel. A year later, a fleet of ships under Eärnur arrived\nin the Grey Havens and set off toward what was left of the once-great\nnorthern kingdom. With the armies of Gondor came men from Rhovanion,\nelves from Lindon, and the remainder of the Dúnedain (among them\nAranarth, the Prince of Arthedain). According to Shire historians, a\ncompany of archers was also sent to the battle.\n\nThe battle itself did not take place in the city of Fornost, but on the\nplains to the west of the city, near Lake Evendim. The armies of Angmar\nhurried west to meet the assault, and seeing this, the cavalry of Gondor\nrode north into the Hills of Evendim to wait in ambush. As the main part\nof the army of Gondor met the enemy in battle, the Gondor cavalry set\nout from the hills to strike the rear of the army of Angmar. This served\nas the turning point in the battle, and allowed the combined armies of\nthe west to gain the advantage. Realizing that his forces were all but\ncompletely destroyed, the Witch-king of Angmar fled eastward. As he\nfled, an army led by Glorfindel came up out of the south and blocked his\nescape, destroying what was left of his crumbling army; the Witch-king\nhimself was able to escape during the night and fled southward. Though\nthe battle itself had been lost and Angmar utterly destroyed, Sauron was\nextremely pleased with the Witch-King's work, for the destruction of the\nnorthern kingdoms of the Dúnedain was a victory for the Dark Powers\nwhich far exceeded the loss of the Witch-King's realm."
  },
  {
    "name": "Skirmish at Amon Hen",
    "lotr_page_id": "5874",
    "text": "The SKIRMISH AT AMON HEN was the battle fought between the Fellowship of\nthe Ring and a small force of Uruk-hai at Amon Hen. It resulted in the\ndeath of Boromir and the breaking of the Fellowship.\n\n\nPrelude\n\nFrodo was given an hour alone to decide how the Fellowship would proceed\nin their quest. However, after an hour had long past, Frodo had still\nnot returned. Boromir, who had earlier abandoned the remaining members\nof the Fellowship without their knowing, then returned. He recounted\nthat he had seen Frodo an hour before, that he had tried to convince\nFrodo to bring the Ring to Minas Tirith, and that they then had an\nargument, resulting in Frodo putting on the Ring and vanishing. This\nstory roused the suspicions of Aragorn, who guessed correctly that\nBoromir had not told the entire truth. At the conclusion of Boromir's\nstory, Merry and Pippin immediately ran off to locate Frodo while\nLegolas and Gimli searched for the Ring-bearer in a different direction.\n\nFearing that the Fellowship would be scattered and lost, Aragorn\ncommanded Boromir to follow Merry and Pippin. Aragorn then instructed\nSam to follow him to the Seat of Amon Hen, but Sam was unable to keep up\nwith him. Thinking on his feet, Sam returned to camp seeing a boat\nseemingly push itself into the river. Realizing that an invisible Frodo\nwas pushing the boat, Sam catches up to Frodo, convincing him to let him\naccompany him to Mordor.\n\n\nThe Battle\n\nMeanwhile, Aragorn, who had reached the Seat of Amon Hen, hears the\nsounds of Orcs and Boromir blowing his horn. He runs to Boromir's aid\nbut arrives too late along with the battle-worn Legolas and Gimli\nshortly thereafter. Boromir fought valiantly, redeeming himself for\ntrying to steal the Ring from Frodo, but fell to many arrows allowing\nMerry and Pippin to be captured. With Frodo and Sam heading off to\nMordor on their own, Aragorn decides that the fate of the Ring is no\nlonger in their hands, so he, Legolas, and Gimli set out to rescue Merry\nand Pippin.\n",
    "conflict": "War of the Ring",
    "date": "February 26, 3019",
    "location": "Amon Hen",
    "outcome": "Tactical victory for Isengard, strategic failure; Fellowship broken"
  },
  {
    "name": "Conquest of Minas Ithil",
    "lotr_page_id": "31038",
    "text": "The CONQUEST OF MINAS ITHIL was an engagement between the armies of\nMordor and Gondor, commanded by Isildur, son of King Elendil, who was\nlord of the city. The battle was fought for control of the major\nGondorian fortress-city of Minas Ithil, in the east of Gondor; and was\nthe first engagement of the War of the Last Alliance.\n\n\nCauses\n\nWhen Númenor was sunk in SA 3319, the Elendili escaped and founded\nthe Realms in Exile in SA 3320. In the southern kingdom of Gondor,\nAnárion founded the city of Minas Anor and Isildur Minas Ithil, where he\nplanted the White Tree. Minas Ithil was a fortress-city strategically\nbuilt in the Ephel Duath to threaten Mordor. After Númenor was sunk,\nSauron secretly returned to Mordor and mustered a huge army of Orcs,\nTrolls and Evil Men within Mordor, desiring to once more go to war with\nthe West now that Númenor was destroyed.\n\n\nThe Battle\n\nIn SA 3429, Sauron sent a huge army from Gorgoroth to besiege Minas\nIthil. An army of Gondorians under Isildur defended the city. In the\ncourse of the siege, Sauron's forces drove into the fortress and set\nfire to the White Tree. Isildur, his wife, his sons, and an unknown\nnumber of Gondorian soldiers escaped the citadel, and Isildur brought\nwith him a seedling of the White Tree. Isildur's family retreated to\nElendil, while Anárion, hearing of the fall of Minas Ithil, sent a\nstrong force to garrison Osgiliath in the advent of attack.\n\n\nAftermath\n\nFollowing the capture of Minas Ithil, the Army of Mordor terrorized the\nEastern side of the Anduin, then a territory of Gondor. The battle\nsparked the War of the Last Alliance, and led to the Western kingdoms\nforming an alliance to, so they hoped, stop Sauron once and for all.\nMinas Ithil was retaken a year later, but by the Third Age, the citadel\nwas nearly abandoned. The Witch-king and the Ringwraiths later retook\nthe fortress for Mordor in TA 2002, and the settlement was renamed to\n_Minas Morgul_.\n\nit:Caduta di Minas Ithil (3429 SE) ru:Захват Минас Итиля",
    "conflict": "War of the Last Alliance",
    "date": "SA 3429",
    "location": "Minas Morgul",
    "outcome": "Decisive Mordor Victory, , -   Minas Ithil sacked, -   Beginning of the War of the Last Alliance"
  },
  {
    "name": "Kinslaying at Alqualondë",
    "lotr_page_id": "2454",
    "location": "Alqualondë",
    "text": "The KINSLAYING AT ALQUALONDË was the first slaying of Elf by Elf, and\nwas the act that banned the Ñoldor from returning to Aman, the lands of\nthe West, for centuries.\n\n\nPrelude\n\nWhen Fëanor intended to leave Valinor, he needed ships to get to\nMiddle-earth without great loss, but the Ñoldor possessed no ships, and\nFëanor feared that any delay in their departure would cause the Ñoldor\nto reconsider. The Ñoldor, led by Fëanor and his sons, tried to persuade\ntheir friends, the Teleri of Alqualondë, to give him their ships.\nHowever, the Teleri would not help in any way against the will of the\nValar, and in fact attempted to persuade their friends to reconsider and\nstay in Aman. Unwilling to take “no” for an answer, the Ñoldor started\ntaking the ships and sailing them away. This angered the Teleri, and\nthey threatened the Ñoldor with rocks and arrows, and they threw many of\nFëanor's followers out of the ships and into the harbor. They also began\nto attempt to block the harbour; however, it is only slightly possible\nthat the Teleri drew first blood.\n\n\nThe Battle\n\nThen the Ñoldor drew swords, and the Teleri their bows, and there was a\nbitter fight that seemed evenly matched, if not even in favor of the\nTeleri, until the second Host of the Ñoldor, led by Fingon, arrived\ntogether with some of Fingolfin's people. Misunderstanding the\nsituation, they assumed the Teleri had attacked the Ñoldor under orders\nof the Valar, and they joined the fight.\n\nConsequences\n\nIn the end many Teleri were slain and the ships taken and many of the\nstolen ships were wrecked in the waves. All that continued towards\nMiddle-earth were therefore cursed by Mandos. The act also had\nrepercussions in Middle-earth, when the Sindar, especially those of\nDoriath, found out about it, costing the Ñoldor the support of the\nSindar in their war against Morgoth; the Sindar King Thingol barred\nthose of the House of Fëanor, or any others that took place in the\nKinslaying, from entering his kingdom. He also forbade the use of Quenya\nin his domain."
  },
  {
    "name": "Siege of Barad-dûr",
    "lotr_page_id": "4515",
    "location": "Barad-dûr",
    "text": "The SIEGE OF BARAD-DÛR was a key event during the Last Alliance of Elves\nand Men. Despite suffering severe losses, the Last Alliance leveled\nSauron's fortress and wiped out his armies after a brutal siege, during\nwhich Sauron's Ring was chopped from his finger.\n\n\nHistory\n\n\n\nAfter the bloody Battle of Dagorlad, the Last Alliance began their\ninvasion into Mordor. They captured the Black Gate but lost many as they\npassed through Udûn, a plateau north of Mordor, and they failed to break\ninto the Dark Tower. Thus, they laid siege on the Dark Tower.\n\nThe siege lasted for a total of seven years. Many elves and men were\nkilled in the siege as seemingly endless numbers of arrows, rocks,\nflaming missiles, and Orc sorties emerged from the tower. Fortunately,\nAnárion's army from Gondor managed to reinforce the Last Alliance. On\nthe sixth year of the siege, SA 3440, Anárion was hit in the head by a\nstone and died. A year later, Gil-galad and Elendil duelled Sauron on\nthe slopes of Mount Doom. Sauron, however, was much more powerful, and\nkilled first Gil-galad with the heat of his hand, and then Elendil, as\nElrond, Círdan, and Isildur helplessly watched. As Elendil fell, his\ngreat sword Narsil broke beneath him. But Sauron had been mortally\nwounded in the battle, and when Isildur cut the One Ring from Sauron's\nbody his spirit fled.\n\nAfter the battle, Sauron's body was broken, the tower of Barad-dûr\ncollapsed (without the Ring's destruction the foundations remained), and\nthe Orc hosts were in disarray. Elrond led Isildur into the heart of\nMount Doom, where the One Ring was forged, and the only place it could\nbe destroyed. However, he claimed it for his own, which led to his\ndeath.\n\nGondor later reoccupied Minas Ithil and Ithilien, and set watchtowers at\nthe Black Gate, and the pass of Cirith Ungol. However, years of neglect,\nand the Kin-strife led these areas to be captured by the Nazgûl, with\nMinas Ithil, later Minas Morgul, falling to the Witch-king.\n\nIsildur's father, brother, and Gil-galad were killed in the Siege of\nBarad-dûr."
  },
  {
    "name": "Dagor Aglareb",
    "lotr_page_id": "2749",
    "text": "The DAGOR AGLAREB was the third of the great battles of the War of the\nJewels in Beleriand.\n\n\nHistory\n\nAfter the Dagor-nuin-Giliath, the Ñoldor of Beleriand had been on the\nbrink of civil war. The host of Fingolfin, which had been betrayed by\nFëanor in Aman, had managed the near-impossible crossing of the\nHelcaraxë and had arrived in Middle-earth, its members bitter and\nfurious. However, after being rescued by Fingon from captivity, Feanor's\neldest son Maedhros had relinquished any claim to the Kingship of the\nÑoldor to Fingolfin, to whom it should have passed regardless. This act\nunited the Ñoldor and allowed them to establish mighty kingdoms in\nMiddle-earth while Morgoth's forces still reeled from the unveiling of\nthe light of the Sun and the Moon.\n\nEventually however, Morgoth's forces overcame their fear of these new\nlights, and the Iron Mountains spewed forth fire as Morgoth sent forth\nnumerous small bands of Orcs, which passed through the Pass of Sirion\nand Maglor's Gap. Fighting small battles along the way, they penetrated\ndeep in West and East Beleriand, where they were destroyed by southern\nforces of the Ñoldor and Elves under Círdan of the Falas.\n\nDoriath was shut and its people refused to fight, and the Laiquendi of\nOssiriand fought no more battles after their leader had been killed in\nthe First Battle of Beleriand.\n\nMeanwhile, the main force of the Orcs spewed forth from Angband to\nDorthonion, where the twins Angrod and Aegnor held them off until armies\nunder Fingolfin and Maedhros counter-attacked on the plains of Lothlann\nand Ard-galen, trapping the Orcs between them. There was an envelopment\nand the Orcs were caught in the vice of Fingolfin from the west and\nMaedhros from the east. Most Orcs were destroyed, and they retreated to\nAngband. The Ñoldor pursued, and utterly destroyed their enemies in\nsight of the gates of Angband.\n\nThis was the first complete victory over Morgoth, and after it the\nÑoldor maintained a guard on Angband, beginning the period of watchful\npeace known as the Siege of Angband.\n\n\nEtymology\n\n_DAGOR AGLAREB_ is Sindarin for 'Glorious Battle'.",
    "conflict": "The War of the Jewels",
    "date": "FA 60",
    "location": "Beleriand",
    "outcome": "Decisive Elven victory"
  },
  {
    "name": "Skirmish at Weathertop",
    "lotr_page_id": "16313",
    "location": "Amon Sûl",
    "text": "THE SKIRMISH AT WEATHERTOP was a battle that occurred on Weathertop\nduring the night of October 6, 3018 between the Nazgûl and the\nFellowship, only made out of Aragorn and the Hobbits at that time. It\nresulted in Frodo getting stabbed by a Morgul-blade and only minor\ninjuries to the Nazgûl.\n\n\nHistory\n\nBackground\n\nAfter Bilbo Baggins' 111th birthday party, the One Ring was passed onto\nhis nephew, Frodo Baggins. After Gandalf returned from Gollum's\ninterrogation, he ordered Frodo and Samwise Gamgee to flee from The\nShire and meet him at The Prancing Pony in Bree. Upon leaving, Frodo and\nSam met with Merry and Pippin, who decided to join them in their quest\nto Bree.\n\nStrider and Making Way to Weathertop\n\nThe Hobbits reached The Prancing Pony and Gandalf was nowhere to be\nseen. After Frodo accidentally placed on the One Ring, Aragorn,\ndisguised as a man named Strider, pulled Frodo to another section of The\nPrancing Pony to tell him that their journey is not over and they must\njourney to Rivendell where the ring will be in safer hands.\n\nThe group stopped at Weathertop as night was coming. As Aragorn left to\ngather more supplies and look out for intruders, the Nazgûl found the\nHobbits and chased them to the top of Weathertop where the battle was to\nbegin.\n\n\nThe Battle\n\n\n\nThe Hobbits attacked the Nazgûl as the battle began. Due to their\ninexperience with Swords and combat, the Hobbits were no match against\nthe Nazgûl and were defeated with minor wounds. The Witch-king of Angmar\nthen realized that Frodo had the One Ring and approached him during the\nbattle.\n\nAragorn arrived before more damage could be done onto the Hobbits. He\nfought against the Nazgûl and was able to drive most of them away.\nHowever, noticing the Witch-King approaching, Frodo put on the One Ring\nin attempt to hide from the Witch-King. That proved to have no effect\nwhen the Witch-king saw him in the wraith-world, and stabbed his\nshoulder with a Morgul-blade.\n\nFrodo fainted, but took off the Ring before losing consciousness\ncompletely. Aragorn was able to drive the rest of the Nazgûl off, but\nFrodo had sustained a wound that would haunt him in the years after.\n\nThe Nazgûl escaped but Frodo was left poisoned by the Witch-king's\ndagger and required healing from the Elves."
  },
  {
    "name": "The Battles of Beleriand",
    "lotr_page_id": "11222",
    "location": "Beleriand",
    "text": "The Great Battles of Beleriand\n\nDuring the First Age of the Sun, the forces of Morgoth fought Elves and\ntheir allies in six major battles for control of Middle-earth.\n\nThese battles are often referred to as the Battles of Beleriand, but\nalso as the WAR OF THE JEWELS, as the Silmarilli were behind them all.\n\n1.  The First Battle of Beleriand was fought before the Ñoldor arrived,\n    and was fought by the Sindar and Laiquendi.\n2.  The Second Battle was the Dagor-nuin-Giliath, or\n    _Battle-under-Stars_, fought by the Ñoldor following Fëanor and his\n    Seven Sons.\n3.  The Third Battle was the Dagor Aglareb, or _Glorious Battle_, which\n    led to the Siege of Angband.\n    -   Various minor battles were fought during the Siege which are not\n        counted.\n4.  The Fourth Battle was the disastrous Dagor Bragollach, or _Battle of\n    Sudden Flame_, in which many Ñoldor fell.\n5.  The Fifth Battle was the Nirnaeth Arnoediad or _Battle of Unnumbered\n    Tears_, in which the Ñoldor were utterly destroyed.\n6.  The Sixth and Last Battle of Beleriand was the War of Wrath, which\n    ended the First Age of Arda and destroyed Beleriand.\n\n\nOther Battles of Beleriand\n\nIn addition to the six Great Battles of Beleriand, there were other\nbattles in the Beleriand against the Dark Lord Morgoth, and even Elves\nagainst Elves and dwarves against elves. These conflicts were directly\nor indirectly part of the War of the Jewels.\n\n-   Battle of the Lammoth - Fingolfin against the Orcs of Morgoth in\n    Lammoth \n-   Battle of the Firth of Drengist* - Fingon against the Orcs of\n    Morgoth in the Firth of Drengist \n-   Battle of Tumhalad - The Elves of Nargothrond against Glaurung and\n    the Orcs of Morgoth \n-   First Sack of Doriath - Dwarves of Nogrod attack Doriath and sack\n    it.\n-   Battle of Sarn Athrad - Beren Erchamion, the Laiquendi of Ossiriand\n    and Ents against the Dwarves of Nogrod.\n-   Second Kinslaying - Dior against the forces of the Sons of Fëanor in\n    Menegroth \n-   The Fall of Gondolin - The forces of the Gondolindrim against the\n    forces of Morgoth \n-   The Third Kinslaying - The remaining forces of the sons of Fëanor\n    against the Elves living in the refugees at the Havens of Sirion, in\n    the land of Arvernien \n\n    *This battle was never given a proper name in the published works,\n    but did take place (see the References section)"
  },
  {
    "name": "Siege of the Hornburg",
    "lotr_page_id": "36263",
    "text": "The SIEGE OF THE HORNBURG occurred during the War between Rohan and\nDunland.\n\n\nHistory\n\nBackground\n\nThe siege began in TA 2758 after the Dunlendings defeated the armies of\nRohan, overran their country and conquered Edoras. The populace fled to\nthe dales in White Mountains to escape death or slavery. Their they took\nrefuge while King Helm and a modest group of loyal followers not willing\nsurrender or flee, fled to the Hornburg, a fortress in the White\nMountains. There began a deadly siege.\n\nUnder Siege\n\nWithin the fortification, Helm endured the enemy but the worst was yet\nto come. The Long Winter that began in November, 2758 brought heavy\nsnows and freezing colds. The terrible weather brought hardship to both\nsides and there was great hunger to near starvation during the Yule. The\nhardship and suffering led Háma, the son of Helm to attack the enemy and\nlook for food without the approval of the king. He and his company were\nlost in the snow. What followed afterward is unclear and possibly part\nlegend but apparently the resistance continued. For it was said that\nHelm himself grew terrible and fierce during the hardships of the siege.\nIt was said that he continued defending the Hornburg, apparently on just\nhis own dreadful personality with great losses. It was also said or\nimplied that he alone was left to defend the Hornburg, and that he would\noften go out alone in a mad frenzy apparently without any weapons\nslaying his enemies with only his bare hands, and seemed nearly\nunstoppable. Because of this apparent dread, all enemies retreated from\nthe Deeping Coomb. Despite all this, the defenders still perished\nincluding Helm.\n\nAfterwards\n\nOne day near the end of the winter, the Dunlendings heard his horn but\nneither he or any of his men appeared. When the sun broke the sky, Helm\nwas found on the dike frozen to death. It is not known if the\nDunlendings entered the Hornburg as victors but they probably did not\ndue to the fear of the ghostly terror of Helm's spirit, that had spread\namongst them.\n\nLegacy\n\nHelm's finial stand in the Hornburg led Rohan's enemies to fear ever\nafter the sound of his name and his horn. This fear was used again\nagainst Rohan's enemies during the War of the Ring when Saruman's Army\nbesieged the Hornburg during the Battle of the Hornburg, when the horn\nwas sounded as a sign of Théoden desire to continue resisting the\ninvaders despite the odds.",
    "conflict": "War between Rohan and Dunland",
    "date": "Late TA 2758 - Winter of TA 2759",
    "location": "Glittering Caves",
    "outcome": "Inconclusive, The Dunlendings apparently did not break the siege but, King Helm and all his men perished, preventing Helm from retaking his, lost kingdom on his own."
  },
  {
    "name": "Sack of Erebor",
    "lotr_page_id": "33905",
    "text": "The SACK OF EREBOR occurred when the dragon Smaug attacked the Lonely\nMountain and drove the Dwarves of Erebor from their capital.\n\n\nHistory\n\nPrelude\n\nAfter the death of King Dáin I outside his halls at the conclusion of\nthe War of the Dwarves and Dragons, the new King, Thrór, and his brother\nGrór abandoned the Grey Mountains for safer dwellings with most of their\nsubjects. The king went to the Lonely Mountain (former seat of the\nDurin's throne), and Grór to the primary source of the Longbeards' iron\nsupply, the Iron Hills. Over the years, the Dwarves of Erebor gained\ngreat renown throughout Middle-earth for the splendor of their halls,\ncraftsmanship, and great stores of wealth. Word eventually reached Smaug\nthe dragon, one of the great fire drakes who now dwelled in the Grey\nMountains, who in his lust for treasure desired to take the mountain.\n\nThe Great Firestorm\n\nOne night in TA 2770, Smaug descended upon the mountain in flames,\ncatching the Dwarves and Men of Dale off guard. The warriors of the\nmountain came out of the great gate to engage the dragon, but all were\nkilled. Then Smaug attacked Dale whose warriors were all called to arms,\nand destroyed most of them. He then returned to the mountain and routed\nthe remaining Dwarves. Afterwards he piled up all the gold within the\nmountain and made it his dwelling, emerging only ever so often to eat\nmaidens from Dale which eventually caused its abandonment.\n\nAftermath\n\nIn the end, Erebor was taken by Smaug and likely thousands of Dwarves\nand hundreds of Men in the great city of Dale (including Lord Girion)\nwere killed during the terrible firestorm that Smaug committed. King\nThrór himself along with his son Thráin II barely escaped out of the\nsecret entrance. Most of the Dwarves who escaped fled to the Iron Hills.\nWith his family and a small company of followers, the King went into a\nhomeless wandering southward but not before cursing Smaug. It would be\nover two hundred years before Thrór's grandson Thorin II Oakenshield\nwould return to the mountain to reclaim his home and treasure. Bard the\nBowman, a descendant of Girion, would avenge Girion in slaying Smaug\nwhen the dragon attacked Lake-town in TA 2941.\n\n\nFilm adaptation\n\nIn the _The Hobbit: An Unexpected Journey_, the Sack of Erebor appeared\nin the prologue of the film, with the events narrated by Bilbo Baggins\nas he wrote his book, _There and Back Again_.\n\nit:Saccheggio di Erebor",
    "conflict": "Isolated event",
    "date": "TA 2770",
    "location": "Lonely Mountain",
    "outcome": "Smaug takes over the Lonely Mountain."
  },
  {
    "name": "First Easterling War",
    "lotr_page_id": "28486",
    "text": "The FIRST EASTERLING WAR was a series invasions, battles, and events\nthat marked the beginning of Gondor's troubles with the Easterlings\nalone.\n\n\nHistory\n\nBackground\n\nThe reason for the sudden attacks by the Easterlings at this time is not\nknown. It was possibly due to the ancient hatred of the Men of the West\ngoing all the way back to the Edain, or toward the Númenóreans and the\nDúnedain in general for many defeats they handed them over the\ncenturies, most recently in the Last Alliance. The most likely\nanswer was probably revenge or more likely greed and a desire to covet\nthe lands of the Dúnedain. Gondor was in the midst of peace so they had\nthe element of surprise.\n\nEarly stages\n\nThe war began in TA 490 when the Easterlings suddenly invaded Gondor.\nNot fully prepared for war, the Easterlings were successful and no doubt\nravaged, pillaged, plundered, and caused much death in north-eastern\nGondor particularly North Ithilien. As King Ostoher was growing old, he\ncharged his son Tarostar with driving out the invaders. Gondor endured\nten long years of their attacks until TA 500 when Tarostar, afterwards\ncalled Rómendacil I, the East-victor defeated them ending the long\nperiod violence.\n\nTemporary Cessation of Hostilities\n\nTarostar's victory defeated the invaders but not utterly. The\nEasterlings continued to survive and recoup themselves in Rhûn while\nRómendacil was busy with affairs of the realm. Forty-one years after\ntheir defeat, the Easterlings renewed their attacks on Gondor.\nRómendacil once again led a host against them but was slain in battle\nthat was probably lost by Gondor.\n\nFinal Defeat of the Easterlings\n\nThe Easterling's new threat didn't last long. Rómendacil's son Turambar\nimmediately became King of Gondor. Eager to avenge his father's death,\nTurambar assembled fresh armies and decisively defeated the Easterlings\nin a battle somewhere in the north-east of Gondor in TA 541.\n\nEnd of War and Conquest of Rhûn\n\nAfter his victory over the enemy, Turambar did not disband his armies\nand instead led them into Rhûn. After nine years of campaigning against\nthe Easterlings, his armies finally conquered a large portion of Rhûn in\nTA 550. The conquered territory became the East-lands province of\nGondor.\n\nLegacy\n\nThe aftermath of the First Easterling War left the Easterlings defeated,\nnon-threatening, and not able to make war on Gondor for over 1,300\nyears. It also laid the groundwork for the expansion of the\nrealm of Gondor. The Northmen people of Rhovanion also became later\nallies of Gondor.",
    "conflict": "Easterling Wars",
    "date": "TA 490 - TA 550",
    "location": "Ithilien",
    "outcome": "Costly but decisive Gondor victory"
  },
  {
    "name": "Battle of Pelargir",
    "lotr_page_id": "13457",
    "text": "The BATTLE OF PELARGIR was the battle in which Aragorn and company with\nthe aid of the Army of the Dead drove away the Corsairs from the Gondor\ncoastal city of Pelargir.\n\n\nHistory\n\nPrelude\n\nAfter Aragorn with Gimli, Legolas, the sons of Elrond Elladan and\nElrohir and the Grey Company had summoned the Army of the Dead at the\nStone of Erech, they planned their next move. It had been known that a\nfleet of Haradrim Corsairs of Umbar was making its way up the Anduin to\nreinforce the Enemy who had overrun the Pelennor and besieged Minas\nTirith. Thus, Aragorn and company decided to intercept the fleet before\nthey reached Minas Tirith, and then hopefully use the enemy vessels to\nswiftly move up the Anduin and break the siege. As they made their way\nthrough Gondor's western provinces, they gradually gathered more and\nmore reinforcements.\n\nThe Battle\n\nOn March 13, 3019, Aragorn along with the Grey Company, and their new\nreinforcements which included mercenary archers from the Blackroot Vale\nnear Erech, infantry from Lebennin and Lamedon and many other cavalry\nand mercenary infantry finally intercepted the enemy fleet at Pelargir,\na famous port city on the lower Anduin known for its skilled mariners.\nThe corsairs had foolishly delayed their arrival at the Pelennor by\nstopping at port towns along their way to loot and pillage them. While\nthey were just about to do the same at Pelargir, Aragorn's forces showed\njust in time to give them battle in the streets and harbour of the city.\nThe moderately sized force of Aragorn was able to triumph over the much\ngreater corsair force by systematically defeating small units of men who\nwere spread throughout the city. The Army of the Dead's actual chief\nweapon was fear, which drove the corsairs manning the ships to flee\ntheir vessels and jump overboard, without giving battle. In just a short\ntime, Aragorn's forces had freed Pelargir from the corsair threat and\nhad wrested control of their vessels, opening the way to a speedy relief\nof the siege of Minas Tirith.\n\nAfter the Battle\n\nAragorn's army, now reinforced with mariners from Pelargir, could now\nsail up the Anduin unopposed, but first Aragorn had to disband the much\nhelpful Army of the Dead. Instead of taking them to fight at the\nPelennor Fields, Aragorn decided to hold their oath fulfilled and thus\nfreed them of their living dead, much to their King's satisfaction. With\nthe Corsairs force defeated, Aragorn's army quickly loaded the vessels\nat Pelargir and set off up the Anduin to relieve the siege of Minas\nTirith.",
    "conflict": "War of the Ring",
    "date": "March 13, 3019",
    "location": "Pelargir",
    "outcome": "Gondor victory"
  },
  {
    "name": "Battles of Lórien and invasion of eastern Rohan",
    "lotr_page_id": "8416",
    "text": "The BATTLES OF LÓRIEN (never given a proper name in the text) is a\n battle of the north during the War of the Ring in J. R. R. Tolkien's\n_The Lord of the Rings_. Battles of Lórien were a series of encounters\nbetween the Uruks (Orc-folk) of Dol Guldur and Mordor against the\nGaladhrim of Lothlórien under the Lord Celeborn and Lady Galadriel,\nwhich took place March 11, 15, and 22 of 3019. The battles resulted in\nvictory for the Elves and allowed Celeborn to lead an assault on Dol\nGuldur, where Galadriel ended the evil influence of Sauron.\n\n\nThe Battles\n\nIt is unknown how the Orc army crossed the River Anduin, though the\nNorth Undeep seems the most likely place to ford. Forces from Dol\nGuldur, reinforced with Orcs from Mordor assaulted Lothlórien three\ntimes, assisted at least once in a joint attack from the west by the\nOrcs of Moria. Though the battles are not described in detail by\nTolkien, the fair woods of the borders of Lothlórien suffered grievous\nharm by fire, though the valour of the Elves prevented the enemy from\npenetrating too deeply into their forest realm. Thrice the enemy\nattacked, and the three times the assaults were driven back.\n\nThe valour of the Elven people that lived in Lórien was great, but\nTolkien states that the main reason why Lórien was not conquered was\n“the power that dwelt there was far too great for any to overcome, save\nif Sauron had come there himself”. Such power was the Lady Galadriel,\nwearing Nenya, who was able to defeat the Orcs; who then fled south\ntowards into Fangorn Forest. Treebeard and a host of Ents, having\nalready laid ruin to Isengard some days before set out to prevent them\nentering Rohan. The despairing Orcs fled eastward but were either killed\nby the tree-shepherds, drowned in the River Anduin or fled to Dol\nGuldur.\n\n\nAftermath\n\nFollowing the battle, Celeborn and Galadriel led the Galadhrim across\nthe Anduin in a fleet of many small elf boats. They entered Mirkwood and\nattacked Dol Guldur. Then, Galadriel came forth and threw down the walls\nand cleansed its pits with her power, and ended the grasp of evil in the\nforest. Dol Guldur was no more. As news of the victory of King Elessar\ndown south reached the Wood-elves, Thranduil (who had recently defeated\nan army in the Battle of Mirkwood) met with Celeborn on April 6.\n\nMirkwood was divided between Thranduil (who claimed the North), the\nBeornings (who settled in the middle, the 'Narrows') and Celeborn who\nadded the southern half to his realm, renaming it 'East Lórien'. Despite\nthese victories, the Elves began to dwindle and Celeborn himself\ndeparted over the Sea during the early Fourth Age.",
    "conflict": "War of the Ring",
    "date": "March 11, 15 & 22, 3019",
    "location": "Lothlórien",
    "outcome": "Victory for the Free Peoples"
  },
  {
    "name": "Re-colonization of Moria",
    "lotr_page_id": "20925",
    "location": "Khazad-dûm",
    "text": "The RE-COLONIZATION OF MORIA was an attempt by Balin to rebuild the\nancient Dwarven Kingdom of Moria in TA 2989 to TA 2994. Under the\nleadership of Balin, the initial effort was successful, and for a while,\nthe Dwarves reclaimed some of Moria. However, the tide turned in favor\nof the goblins when the Balrog known as Durin's Bane emerged and led a\nmassive army of goblins in a counter-attack. No dwarf of the colony\nsurvived.\n\n\nHistory\n\n48 years after the Battle of the Five Armies, Balin along with Flói,\nÓin, Ori, Frár, Lóni, Náli, and a large colony of Dwarves marched from\nthe Lonely Mountain to Moria to reclaim the dwarven city with the\nunwilling leave of Dain II Ironfoot as he feared what was there. He\nhoped to reclaim some of the lost treasures of the lost realm like the\nRing of Thrór. The initial battles took place from the Dimrill Dale to\nthe Chamber of Mazarbul in which Flói was killed before they reached the\nFirst Hall. Nevertheless everything went well as the Dwarves proved to\nbe fiercely determined to take back their home, slaying every goblin in\ntheir path, eventually some of Moria was reclaimed and they dwelt in the\nTwenty-first Hall until Balin moved to the Chamber of Mazarbul which\nthen become his seat of government from then on. For the next few years,\nBalin ruled as Lord of Moria. The goblins became a mere nuisance during\nthose years and were not serious threats. Here, Balin and company found\nDurin's Axe and some sort of 'helm'.\n\nLittle did the Dwarves know, that Moria was ruled by a Balrog, a demon\nof the Eldar Days that survived in the deeps for many thousands of years\nthat the Dwarves were no match for. By the year TA 2994, Durin's Bane\nand a horde of goblins launched a massive counterattack from the east.\nBalin was shot by an archer and died in Dimrill Dale and many other\nDwarves perished as well and retreated into the mines. Bloody fighting\ntook place all over Moria, but the strength of the Dwarves were\nultimately no match for the sheer number of goblins and the power of the\nBalrog. Soon the Bridge of Khazad-dum and the Second Hall were taken by\nthe goblins. Frár and Lóni and Náli were among the casualties the\nDwarves lost in the second hall. Oin and a group of Dwarves tried to\nescape through the Doors of Durin but were killed by the Watcher in the\nWater. The last Dwarves barred the doors of the Chamber of Mazarbul and\nwere able to built a tomb for Balin. Eventually, the goblins broke\nthrough and slew the remaining Dwarves ending the peaceful\nre-colonization of Moria.\n\n\nAftermath\n\nWith the Dwarven colony destroyed, Moria continued to be a place of evil\nthat none dared enter until the Fellowship of the Ring learned of it\nwhen they passed through it, slaying Durin's Bane in the process.\n"
  },
  {
    "name": "Destruction of Lake-town",
    "lotr_page_id": "34782",
    "text": "The DESTRUCTION OF LAKE-TOWN took place when Smaug burst out from Lonely\nMountain and flew over to Esgaroth to destroy the city and its people,\nin retaliation for the aid they gave to Thorin and Company on their\nQuest to take back the treasure-hoard of Thror.\n\n\nHistory\n\nBackground\n\nLater in TA 2941, Bilbo Baggins of the Shire accompanied a company of\nDwarves led by Thorin II Oakenshield to recapture the whole Kingdom of\nErebor from the Dragon Smaug. The party reached the mountain later that\nyear on Durin's Day and sent Bilbo in through the secret door to carry\nout his duty as their burglar. Bilbo had already done some exploration\nof the old hallways using the Back Door and had stolen a golden cup from\nthe treasure. By this deed and by Bilbo's bold speech Smaug's anger was\nkindled. Erroneously believing, due to some remarks Bilbo had made\nduring his conversation with Smaug, that some scheme of the people of\nEsgaroth was the reason for the Dwarves' (and Bilbo's) presence, Smaug\nflew to Esgaroth to show them who is “the true King under the Mountain”.\n\nFire and Water\n\nSmaug appeared first in the north, his light turning the Lake golden. At\nfirst, the Lake-men thought it was gold flowing down the river, but a\ngrim-voiced man named Bard realized that it was the Dragon, awake and\nroused to wrath. At his warning, the bells were rung, and the town\nprepared for battle, by cutting off the bridge, covering the roofs with\nwater, and filling every vessel with water. When Smaug arrived, he tried\nto land on the bridge only to find it destroyed, and instead flew over\nthe town, spouting flames and smashing buildings with his tail. The\nArchers of Lake-town fired at him, but only managed to enrage him\nfurther. As he set the town aflame, the Lake-men tried to douse the\nflames, but to no avail, as he methodically destroyed the town. The\ntownspeople abandoned and escaped into the water, and the Master fled in\nhis Golden boat. Only the company of archers led by Bard (a descendant\nof Girion, Lord of Dale) stood their ground, and in the end, even they\nfled. As Bard bent his bow with his last arrow, a thrush arrived, and to\nhis amazement, found he could understand it, as he was of the race of\nDale. It told him about the dragon's weak spot. Bard fired the Black\nArrow, an heirloom of Dale, and with his last shot killed the dragon.\nWith a final scream, Smaug flew up into the air, turned over and fell\nonto the town, destroying it.\n\n\nAftermath\n\nAfter the Dragon's death, the people turned on the cowardly master of\nLake-town, and Bard became their leader, while still acknowledging the\nmaster as the elected Ruler. The death of Smaug had massive\nconsequences, creating struggle for the treasure of Erebor, and leading\nto the Battle of the Five Armies.",
    "conflict": "Quest of Erebor",
    "date": "October 1, 2941",
    "location": "Lake-town",
    "outcome": "Death of Smaug"
  },
  {
    "name": "Dagor-nuin-Giliath",
    "lotr_page_id": "2747",
    "text": "The DAGOR-NUIN-GILIATH or the BATTLE UNDER THE STARS was the second\nmajor battle of the War of the Jewels in Beleriand but the first to be\nfought by the exiled Ñoldor of the Beleriand.\n\n\nHistory\n\nThe battle began when the Ñoldor of Fëanor arrived unexpectedly at the\nFirth of Drengist, and passed through the Gate of the Noldor into\nHithlum. They encamped on the northern shore of Lake Mithrim.\n\nMorgoth hoped to destroy the returning Ñoldor before they could\nestablish themselves, and sent his forces through the passes of the Ered\nWethrin. Although the Orcs of Morgoth by far outnumbered the Ñoldor, the\nÑoldor were still empowered with the Light of Valinor, and quickly\ndefeated them. The Orcs retreated north through Ard-galen, with the\nÑoldor in hot pursuit.\n\nThe forces of Morgoth that had been besieging the Havens of the Falas\nsince the First Battle of Beleriand marched north to attack the Ñoldor\nin the rear, but a force led by Celegorm ambushed them at Eithel Sirion.\nTrapped between the two Ñoldorin forces, the Orcs fought for ten days,\nencircled at the Fens of Serech. All but a few Orcs perished in the\nbattle, and Fëanor in his wrath pursued even this small group. But he\ndrew too far ahead of the main host of his people, and seeing this, the\nOrcs turned and gave battle at the edge of Dor Daedeloth. Being\nvirtually at Angband's gates, the Orcs were joined by a number of\nBalrogs, and the Elves were quickly slain. Fëanor stood his ground and\nlong fought alone, until he was fatally wounded by Gothmog. However,\nbefore the Balrogs could kill him, Fëanor was rescued by his sons.\nFëanor would die soon afterwards due to his wounds.\n\nImmediately following this skirmish, the Moon rose, and with its rising\nFingolfin and the second, greater host of the Ñoldor arrived in\nLhammoth. There they were attacked by a force of Orcs which had earlier\nbeen sent there by Morgoth to attack Fëanor in the rear, and they fought\ntheir first battle, the Battle of Lhammoth. The Ñoldor were caught\noff-guard, and Fingolfin's son Argon was slain. Fingolfin and his host\npursued the Orcs until they were completely destroyed, and then passed\ninto Mithrim as the Moon first rose.\n\nThe victory was decisive for the Ñoldor, who had destroyed most of\nMorgoth's forces in one mortal strike, but they had lost their greatest\nwar-leader and one of their greatest princes.\n\n\nEtymology\n\n_DAGOR-NUIN-GILIATH_ was Sindarin for 'battle-beneath-stars'.\n\n\nNotes\n\nThe Battle of Lhammoth and Argon do not appear in the published _The\nSilmarillion_ at all, because they only came to light in very late\nwritings by Tolkien. In the published The Silmarillion, Fingolfin's host\nonly arrives after the battle is long over.\n\nIn the second edition of _The Silmarillion_ edited by Christopher\nTolkien, Fingolfin appears during the battle but his son's death is not\nmentioned.",
    "conflict": "The War of the Jewels",
    "date": "YT 1497",
    "location": "Beleriand",
    "outcome": "Decisive Ñoldor victory"
  },
  {
    "name": "Battle of the Camp",
    "lotr_page_id": "3777",
    "text": "The BATTLE OF THE CAMP was a battle between Gondor and the Wainriders.\n\n\nHistory\n\nBackground\n\nThe Wainriders were beginning to recover from their defeat at Dagorlad\nand were apparently not completely driven out by the rebellion in\nRhovanion, and now in TA 1944 made an alliance with Khand and Harad. The\nnew Éothéod lord, Forthwini found out about this and warned King Ondoher\nof it. Meanwhile, Eärnil, based at Pelargir received this news on the\nninth day of Cermië and prepared a force that crossed the river Anduin\nin part, leaving the Fords of the Poros purposely undefended.\n\nPrelude\n\nThe northern assault of the Wainriders was met by the King of Gondor\nhimself, Ondoher, with his two sons Artamir and Faramir. The Easterlings\nswept through Gondor's defence, cutting down the King and his heirs and\nrouting his army. While the Wainriders attacked Ithilien from the north,\nthe armies of the Haradrim crossed the Poros and invaded Southern\nIthilien. The Gondor Captain Eärnil had led Gondor's inferior Southern\nArmy to victory over the Haradrim, destroying their army in South\nIthilien, to the north of the Poros. After his victory, Eärnil turned\nnorth.\n\nThe Battle\n\nBelieving their victory complete, and Gondor defenceless before them and\napparently unaware of the defeat of their allies in the south, the\nWainriders paused in North Ithilien to celebrate their conquest. The\nfeasting Wainriders suddenly found their success reversed, as Eärnil\nappeared with his Southern Army, reinforced by fleeing members of\nOndoher's defeated northern troops. Eärnil's army descended on the\nunprepared Wainriders, driving many of them into the swamplands of the\nDead Marshes. That eastern people, for so long a dreaded enemy of\nGondor, never marched against Gondor again. The battle was named after\nwhere it had taken place: the Battle of the Camp.\n\nAftermath\n\nBecause there was no heir apparent to the throne, Ondoher and his sons\nhaving been killed in the battle, Eärnil was made King. He was a distant\nrelative of Ondoher, and could trace his lineage back to Elendil and\nAnárion of old.\n\nEärnil's victory is counted as one of the biggest military successes in\nthe history of middle earth. With a numerically inferior army than the\none that went north, Eärnil was able to totally rout the entire allied\narmies of Harad and Khand a feat that would not be duplicated until the\nend of the Third Age at the Battle of the Pelennor Fields. The\nsubsequent promotion of Eärnil to the throne of Gondor gave the southern\nDúnedain a boost to moral that had been needed since their many losses\nduring the plague and the invasions that followed. It also helped\nimprove relations with the northern kingdom of Arnor. Eärnil's promise\nof support to Arnor reforged ties that had been hanging by a thread for\nseveral centuries. The stunning success north of the Poros had positive\nrepercussions throughout the Free Peoples of Middle-earth.",
    "conflict": "Wainrider War",
    "date": "Cermië ?, 1944",
    "location": "Ithilien",
    "outcome": "Decisive Gondor victory"
  },
  {
    "name": "First Battle of the Fords of Isen",
    "lotr_page_id": "2304",
    "text": "The FIRST BATTLE OF THE FORDS OF ISEN was the first battle between\nSaruman's armies and the Rohirrim. There were two battles at the Fords\nof Isen. The first battle took place on February 25, 3019. The second\nwas on March 2, 3019.\n\n\nHistory\n\nThéodred, son of King Théoden of Rohan, was alerted by his scouts to the\nmustering taking place in Isengard. He manned both sides of the ford and\nwent forward leaving three companies of riders to guard the eastern\nside. Early in the morning, he crossed over to the western side with a\nforce mainly consisting of archers and cavalry. He planned to take the\nforces of Uruk-hai by surprise.\n\nHowever, Saruman had tricked the scouts; his army was already marching\nout to attack the ford. Twenty miles to the north of the ford, Théodred\nencountered the vanguard of the Uruk-hai and quickly cut through their\nlines. He then charged at the main force,\nwhich were prepared for the attack and were stationed behind trenches\nplanted with pikes. Reinforcements came out of Isengard and outflanked\nthe cavalry, nearly surrounding them. Hastily Théodred ordered a\nretreat, but the Uruk-hai could not be shaken off that easily. Grimbold,\nwho was in command of the Rohirrim rearguard, had to cut down their\npursuers many times.\n\nSaruman's eastern force was much smaller but more dangerous. It\ncontained Dunlendings, Warg riders and Uruk-hai. The Rohirrim guard on\nthe eastern side of the ford had been driven into retreat, and their\nattackers recrossed the ford to attack Théodred on both sides. Théodred\nand his men had dismounted on a small islet to cover Grimbold's retreat.\nAt the same time Grimbold's force was being attacked from the western\nside, and as Grimbold looked east, he saw Théodred's force being driven\nfrom the islet to a hill. Grimbold and a few men raced toward Théodred's\nposition. Théodred was cutting his way through the Uruk-hai lines. But\nby the time Grimbold reached him, Théodred had fallen, cut down by a\ngiant Orc. Grimbold slew the Orc and then found himself defending\nThéodred's body from enemies. He himself would have been cut down had it\nnot been for Elfhelm.\n\nElfhelm had been leading four companies towards Helm's Deep, when it was\nreported to him that two Warg riders had been spotted. He rode at full\nspeed to the ford and, seeing the situation, ordered his men to charge.\nBefore long his men held the western side of the ford. They then charged\non the islet. From this surprise attack most of the Uruk-hai retreated\ntoward Isengard. When they reached the islet they found Grimbold\ndefending Théodred's body against two huge Orcs. Elfhelm rushed to his\naid and felled one enemy while Grimbold slew the other.\n\nWhen they lifted Théodred's body, they found he was still alive. He\nlived long enough to say, “Let me lie here -to keep the ford until Éomer\ncomes.” The enemy attack ended by nightfall. The Rohirrim had held the\nford but suffered heavy losses.\n",
    "conflict": "War of the Ring",
    "date": "February 25, 3019",
    "location": "Fords of Isen",
    "outcome": "Saruman's forces retreat, The Death of Théodred"
  },
  {
    "name": "First Battle of Beleriand",
    "lotr_page_id": "2746",
    "text": "The FIRST BATTLE OF BELERIAND was the first major battle of the War of\nthe Great Jewels, fought mainly by the Sindar against the forces of the\nDark Lord Morgoth.\n\n\nHistory\n\nWhile the Ñoldor were still struggling in Aman, Morgoth had already\narrived in Middle-earth well ahead of them, and quickly reoccupied his\nold fortress of Angband where his servants Sauron and Gothmog had long\nbeen breeding Orcs in the darkness. Morgoth moved quickly to resume his\ndesire to conquer and dominate the peoples of Middle-earth and sent\nforth his armies hoping to master all the areas south of his domain\nquickly. Morgoth's forces issued forth in two main hosts, passing west\nthrough the vale of Sirion and east between Aros and Gelion, some of\nthem even scaling the passes of Anach and Aglon. Well-armed having\ndefended the Beleriand from the evil and savage things of the north,\nKing Thingol were prepared for war but faced setbacks. The western Orc\nhost ravaged and plundered much in the West Beleriand. Lord Círdan of\nthe Havens of the Falas came out to meet them but was defeated and\nforced to retreat into the walled cities of Eglarest and Brithombar,\nwere they were besieged. Thus, the forces of Thingol were cut-off from\ntheir Elven allies in the west.\n\nDetachments of both Orc hosts entered the domain of Thingol and\nMenegroth, Thingol's forces fought and held them at bay but his main\nfocus was on the bulk of the eastern Orc host fighting his hard-pressed\nally, King Denethor of the Laiquendi. Denethor, who answered Thingol's\ncall for aid attacked the Orcs but he and his people were lightly armed\nand were no match for the arms of their foes. Eventually, he and his\nforces were pushed back onto Amon Ereb where they were cut-off and\nsurrounded. Here, Denethor and his lightly armed company made their last\nstand against a sea of foes and he was slain before Thingol could rescue\nhim. When Thingol's forces arrived, the Orcs stood no chance and were\nutterly defeated. Those Orcs that did escape death scattered east but\nwere slain by the Dwarves of Mount Dolmed. The battle was over and the\narmies of Thingol stood victorious over Morgoth's forces in the East\nBeleriand.\n\nThis was the only battle against the Dark Lord in which the Sindar took\nan active role.\n\nAftermath\n\nThought battle was held to be over, the cities of the Havens remained\nunder siege by the forces of the Western Orc host. After learning of\nthis, Thingol summoned all the Sindar that wished to live in peace to\nthe lands within the forests of Region and Neldoreth. Melian then set\nforth her powers and afterwards the lands of Thingol became a closed\nrealm and was put under protection by the magical barrier _Girdle of\nMelian_, which were ever after known as Doriath. As no aid came from\nThingol, Lord Círdan and his people had to hold out against his\nattackers alone. The Havens were only freed when the Orcs withdrew\nnortheast to fight the Ñoldor under Fëanor.\n\nAfter the death of their king and the heavy losses they took during\nbattle, the Laiquendi returned to the forests of the Ossiriand. There\nthey pledged to live in secrecy forsaking war and distrusting outsiders.\nThey never again named a king. Many Laiquendi went north entering the\nland of Doriath and were forever merged with his people.",
    "conflict": "The War of the Jewels",
    "date": "Shortly before the beginning of the First Age",
    "location": "Beleriand",
    "outcome": "Pyrrhic Sindarin victory in the East., The Havens of the Falas remain under siege., Eglador renamed Doriath."
  },
  {
    "name": "Battle of the Thousand Caves",
    "location": "Menegroth",
    "lotr_page_id": "28504",
    "text": "The BATTLE OF THE THOUSAND CAVES was a great battle between the Dwarves\nof Nogrod and the Elves of Doriath in the Caves of Menegroth.\n\n\nHistory\n\nBackground\n\nAfter the Quest for the Silmaril and the Hunting of the Wolf, Thingol\ncame to possess the Silmaril that Beren cut from Morgoth's Iron Crown.\nThen around FA 500, Hurin, freshly released from his long imprisonment\nby the Dark Lord appeared and presented to the King the Nauglamír that\nhe took from Mîm at Nargothrond. Seeing that he now possessed the two\nmost beautiful things ever created by the Children of Ilúvatar, Thingol\ndesired to combine them into one great creation. From this, he\ncontracted the Dwarven craftsmen working in his smithies who were\nstrongly motivated because the Nauglamir was a creation of their own\nrace, and they too desired the Silmaril but hid it well.\n\nLong did they labor in the deep smithies of Menegroth and when the\nmarvelous creation was complete, King Thingol came to claim it but the\nDwarves coveted it and withheld it from him saying he had no right to\nit. Seeing their true minds, Thingol scorned the Dwarves with hurtful\nwords in praise of himself. Then, the Dwarves unable to bear anymore\nrose before him and slew him then and there took the Nauglamír and the\nSilmaril within it and fled. The killers managed to get out of Menegroth\nbut not out of the realm for word quickly spread on who was responsible\nand the Dwarves were pursued to the death. Most of them were killed and\nthe Nauglamír and Silmaril returned to Doriath. Only two Dwarves\nescaped. Melian, unable to bear the loss of her husband and seeing that\nthat the doom she had so feared had finally come upon Doriath withdrew\nher protection, and entrusted Mablung to send word to Beren at Tol Galen\nand gave him the Silmaril for safe-keeping. She then left Middle-earth\nand returned to Valinor.\n\nPrelude\n\nThe two surviving Dwarves that made it back to Nogrod and when asked\nwhat had happened they lied to their Lord saying that their brethren\nwere slain on the command of Thingol, who intended not to pay them for\ntheir works. Then, great anger came to the Dwarves and the halls of\nNogrod filled with their wrath, and the Dwarves prepared for war\nintending to avenge this wrong. They tried to get the Dwarves of\nBelegost to help but they refused and also tried to dissuade them from\ntheir intent, but they did not succeed. The Dwarves marched westward\nthrough the Beleriand with a great host, and all trembled at the sight\nof host of the Dwarves. They passed through the now open and unguarded\nborders of Doriath, and no one opposed them and retreated before them.\nThen, the host came to Menegroth, crossed the Bridge of Menegroth and\nentered the caves and so the battle begun.\n\nThe Battle\n\nThe battle took place entirely underground in the many thousands of the\nCaves of Menegroth. It is not known how long the two foes fought one\nanother only that many died on both sides but the Dwarves emerged\nvictorious.\n\nAftermath\n\nAfter the Dwarves won the battle, they pillaged and plundered all they\ncould and then eager to get their hands on the Nauglamir and the\nSilmaril, they came to the treasury of the realm and slew Mablung before\nits doors taking both the treasures. Doriath was sacked but the Dwarves\ndid not claim the realm and instead left for home. Doriath ceased to be\nwithout the King or his Queen. Even Beren's avenging of the defeat at\nSarn Athrad did not resurrect the kingdom, not until the coming of age\nof Beren's son Dior. The battle also remained in the racial memories of\nboth the Elves and Dwarves for many ages to come."
  },
  {
    "name": "War between Rohan and Dunland",
    "lotr_page_id": "35831",
    "text": "The WAR BETWEEN ROHAN AND DUNLAND was a war fought between Rohan and the\nDunlendings in the late Third Age.\n\n\nHistory\n\nBackground\n\nEver since the former Gondor province of Calenardhon was awarded to the\nRohirrim by Cirion for the faithful loyalties of their founder Eorl the\nYoung instead of them, the Dunlendings remained forever hostile. For in\nthe building of their kingdom, the Rohirrim forced these uncivil and\nbarbaric Men out of their settlements in the northern valleys at the\nfoot of the White Mountains and the plains of what would become western\nRohan. They frequently raided Rohan and were always a source of trouble\nto it. However, the Rohirrim and Dunlendings still had to live side by\nside with one another and apparently intermingled and intermarried and\nhad peace for a time.\n\nIn the twenty-eighth century of the Third Age, a man known as Freca,\nsaid to have both Rohirrim and Dunlendish blood rose in power and wealth\nand lorded over the Dunlendings on both sides of the disputed Adorn\nriver. He peacefully cooperated with the Kings of Rohan and was supposed\nto obey the king's summons and attend his councils; however, in later\nyears when he sought the throne of Rohan, he grew arrogant and only came\nwhen he felt like it.\n\nPrelude\n\nIn TA 2754, Freca, drunken with pride and ambition he boldly rode into\nthe King's house with a force of men for a meeting. Freca began making\ndemands to King Helm that his son Wulf should be wedded to Helm's\ndaughter which would no doubt give he and his family power. Helm refused\nand insulted him before his men. Humiliated, Freca flew into an angry\nrage nearly starting a fight in the hall. Helm finally met him face to\nface outside of Edoras in a field and after insulting him further struck\nhim down with one blow from his fist, and he died soon afterwards. Still\nfurious, Helm proclaimed all of Freca's successors the enemy of\nRohan.\n\nWar and Siege\n\nFour years later in TA 2758, the Dunlending led by Wulf came for their\nrevenge at a time when Gondor could not help them. Rohan was invaded\nfrom the east and from Isengard assembling in great force at mouths of\nthe rivers Lefnui and Isen. The armies of Rohan were defeated. Edoras\nwas conquered and Wulf sat in the Meduseld calling himself King of\nRohan. The Dunlendings were cruel, taking slaves and forcing the\nsurviving Rohirrim to flee to the dales in White Mountains and Helm fled\nto the Hornburg taking great losses but the worse was yet to come. A\nlong and terrible winter fell upon all of Middle-earth affecting both\nsides. Helm and his loyal remnant of Rohirrim endured a long siege\nthroughout the long winter bringing terror to the enemy, but in time he,\nhis sons, and followers perished in the cold or in battle.\n\nWhen the Long Winter was over Fréaláf Hildeson, Helm's nephew came down\nfrom Dunharrow with a small force and regained the Meduseld and retook\nEdoras. Wulf was slain and soon all the remaining enemy forces were\ndriven out with the help of Gondor whose forces were now able to help\ntheir ally.\n\nAfterwards\n\nFréaláf Hildeson now became King of a second line of Kings in Rohan.\nSaruman also came to Rohan proclaiming friendship, wooing the new king\nwith gifts, and praising their victory over their enemies and for many\nyears appeared on the outside to be Rohan's friend, living peacefully in\nIsengard. Helm's body was brought down from the Hornburg and buried in\nthe ninth mound of the Kings of Rohan. Rohan was weakened for many years\nto come but so were its enemies and so no further threat of invasion\ncame again. Years after, King Folcwine restored the realm to its former\nstrength.\n\nLegacy\n\nThe defeat of Dunlendings in the war left behind bitter memories in the\nDunlendings who continued to hate Rohan and its rulers. They still\ncoveted the land of Rohan that they failed to capture for themselves. So\nhundreds of years later when the fallen Wizard Saruman became powerful\nand hostile to Rohan, they joined with him and his allies to harass\nRohan during the War of the Ring.\n",
    "conflict": "War between Rohan and Dunland",
    "date": "TA 2758 - Spring TA 2759",
    "location": "Rohan",
    "outcome": "Dunlendings defeated, Second line of the Kings of Rohan begins."
  },
  {
    "name": "Attack of the Rohirrim",
    "lotr_page_id": "45921",
    "text": "The ATTACK OF THE ROHIRRIM was the short night-time battle between\nÉomer’s banished cavalry and the band of Isengard Uruk-hai and Orcs of\nMordor which had captured Merry Brandybuck and Pippin Took border of\nFangorn Forest.\n\nThe Rohirrim were victorious, and left no Orcs alive. Unbeknownst to\nthem, Merry and Pippin were able to escape into the woods.\n\n\nBackground\n\nThe Orc-host had recently attacked the Fellowship of the Ring, killing\nBoromir of Gondor and capturing the hobbits Merry Brandybuck and Pippin\nTook. Among the Orc-host, there was some disagreement on what to do with\nthe hobbits: Uglúk and Grishnákh wanted to search them, while the Moria\nOrcs, called “Northerners,” wanted to just kill them. This disagreement\nslowed down their pace and allowed Aragorn, Legolas, and Gimli, who were\npursuing them, to gain on them.\n\nAt the same time, scouts sent ahead by the Orcs were seen by a Rohirrim\nscout, who alerted the Éored of Éomer that a large band of Orcs was\ncrossing the Eastemnet, headed for Isengard. Éomer, without official\nsanction from King Théoden, immediately headed for the Orcs.\n\nAt this point, Uglúk and Grishnákh were disagreeing over who would take\nthe prisoners. The Isengarders overtook the Northerners and were joined\nby around 40 Mordor Orcs led by Grishnákh.\n\n\nThe Battle\n\nAs the combined Isengard-Mordor force overtook the Northerners,\nGrishnákh saw Éomer's force riding quickly towards them. The orcs put on\na new spurt of speed, however the riders had already hemmed them in,\npreventing them from scattering, and driving them along the banks of the\nriver. The Rohirrim then used a tactic of shooting stragglers and moving\nout of range of answering bows, which they did many times before\nnightfall. This tactic killed many orcs, and forced the others to run\nfaster, thus tiring them out.\n\nDuring the night, the Orcs stopped on a hillock, but the horsemen had\nsurrounded them near Fangorn. Several orcs went off towards the forest,\nbut only three returned. Uglúk put three Isengarders to guard the\nhobbits, who were told to kill the captives only if the Rohirrim were to\nbreak the circle. During their talk, several Rohirrim crawled over to\nthe camp, killed several orcs, and vanished quickly. As Grishnákh tried\nto escape with Merry and Pippin, he was killed by a spear, which allowed\nMerry and Pippin to free themselves. As the Orcs realized that they had\nlost the hobbits, a group of Isengarders led by Mauhúr, which had come\nout of Fangorn, tried to break the Rohirrim's encirclement. The Rohirrim\ndrew their circle close around the hillock to prevent a sortie, while a\ngroup rode off to attack the reinforcements. The Orcs' reinforcements\nwere soundly defeated, and so the riders returned to their siege.\n\nAt dawn, the riders charged from the East at the Orcs, who shot all the\narrows they had remaining. Although several horsemen fell, the line held\nas they passed over the hill. They wheeled around and charged again.\nMost Orcs now fled helter-skelter and were killed one by one. One band\nhowever, led by Uglúk, charged towards the forest, heading straight for\nthe riders trying to contain them. They charged up the slope, and killed\nthree riders in their way. After watching the battle unfold, Merry and\nPippin escaped into Fangorn. Uglúk, on the other hand, was overtaken by\nÉomer, who dismounted and fought him sword to sword. All the orcs who\ncould still escape were run down and slaughtered by the riders.\n\n\nAftermath\n\nThe Riders built a mound for their 15 fallen comrades, sung their\npraises, and set an equal number of spears around it. They then burned\nthe piled carcasses of the Orcs and scattered their ashes. Pippin and\nMerry were met by Treebeard in Fangorn. Two days later, Éomer's Éored\nencountered Aragorn, Legolas, and Gimli, who he told of the battle. He\ngave to them two horses whose masters had fallen in the battle, Hasufel\nto Aragorn and Arod to Legolas. Aragorn, Legolas, and Gimli later traced\nthe Hobbits' steps into Fangorn, and there met Gandalf.",
    "conflict": "isengard wars",
    "date": "28-29 February, TA 3017",
    "location": "Fangorn Forest",
    "outcome": "Victory of the Rohirrim"
  },
  {
    "name": "Battle of Isengard",
    "lotr_page_id": "745",
    "text": "The BATTLE OF ISENGARD was described as an assault launched by a large\ngroup of Ents and Huorns. Persuaded by Treebeard to take action, they\nattacked Isengard and liberated the fortress, although they could not\nbring down Orthanc. It wasn't very well protected, as all the Uruk-hai\nhad been sent to Rohan, leaving only weak Orcs behind.\n\nTreebeard tore down the gates of Isengard as many Orcs fled and were\nkilled by the many Huorns now surrounding Isengard. Saruman was on the\ngrounds when the attack began and retreated to Orthanc, almost caught by\nthe Ent, Quickbeam. Once Saruman was inside he started up the machinery\nhoused underground, with several Ents scorched by the fumes and fires\nthat erupted. Treebeard then calmed the enraged Ents and put them to\nwork on tearing down the dam, releasing the river and cleansing Isengard\nof Saruman's treachery.\n\n\nHistory\n\nBackground\n\nAfter a three day long Entmoot, an army of Ents and Huorn set off for\nthe tower-fortress of Isengard, making a terrifying racket. They arrived\nand began their attack on March 2. The time of their assault was\nfortunate, because they arrived just when the wizard Saruman was\nemptying Isengard for a final assault on Rohan. As a result, there were\nfew left to defend Isengard besides Saruman himself.\n\nOnce the army of Isengard had left for Rohan, the Ents launched their\nattack on the walls. Attempts were made to hinder them with arrows, but\nthese only served to irritate the attackers further, and, in a matter of\nminutes the Gate and much of the Southern wall was reduced to ruin.\n\n\nThe Battle\n\nAs the Hobbits Merry and Pippin, who were present during the battle,\nlater recounted to their friends, Ents are so strong that their _punches\ncan crumple iron like tinfoil_, and they can _tear apart solid rock like\nbreadcrusts._ A ring of Huorns surrounded Isengard and killed all\nescaping Orcs.\n\nOnce the Gate and walls had been reduced to rubble, a young Ent named\nQuickbeam in the Westron tongue, spotted Saruman, and made for him,\nshouting 'The Tree Killer!', for his people and all Fangorn forest in\ngeneral had suffered from heavy deforestation to fuel the furnaces of\nSaruman. Other Ents followed him, but Saruman succeeded in escaping into\nthe tower of Orthanc. Once in the tower, he activated spouts and vents\nall over the plain, scorching many Ents who had entered the fortress.\nOne Ent, Beechbone, was unlucky enough to be caught fully in one of the\nfiery blasts, and the death of this Ent by Saruman's fire caused the Ent\nhost to go berserk. Merry and Pippin recounted the incident, saying that\nthe enraged roars of the Ents were enough to crack the stones. They\ndestroyed the buildings and machinery on the plain, but could do nothing\nto hurt the tower itself.\n\nAt this point, the Ents took counsel and came up with a new plan of\nattack. By digging trenches and destroying Saruman's dam, the Ents and\nHuorns were to divert the course of the river Isen itself. As the Ents\ndid work destroying the dam, Gandalf appeared to Treebeard and the\nhobbits during the night. Gandalf took counsel with Treebeard, resulting\nin the Huorns' involvement at the Battle of the Hornburg. At midnight,\nthe Ents succeeded in destroying the dam, and the river flooded the\n'bowl' of Isengard, submerging everything but the tower and filling in\nall the tunnels and holes where the machinery of war had been. The\ndestruction of Isengard was complete, although Saruman was still\nuntouched in the tower. Some men from Dunland surrendered and were\nallowed to leave.\n\nThe sound defeat of Saruman's hosts at the Battle of the Hornburg and\nthe destruction of his fortress rendered him incapable of causing the\nWest any further military harm, although he still had the power of his\npersuasive and commanding voice, with which he could still do (and did\ndo) harm. Had the Ents not destroyed Isengard, despite the destruction\nof Saruman's main army, he still could have withstood a siege with his\nfew remaining forces behind Isengard's normally impregnable walls,\nbiding his time until he could renew his strength.\n",
    "conflict": "War of the Ring",
    "date": "March 3, 3019",
    "location": "Isengard",
    "outcome": "Decisive Fangorn victory; Saruman defeated; much of Isengard destroyed"
  },
  {
    "name": "Corsair Wars",
    "lotr_page_id": "32825",
    "location": "Umbar",
    "text": "The CORSAIR WARS were a long, predominately naval struggle between Kings\nand Stewards of Gondor and a series of renegade rebel forces based at\nUmbar and Pelargir.\n\n\nHistorical Background\n\nThe fortress haven of Umbar was founded by Númenórean colonists during\nthe Second Age, during the peak of Númenorean power. When Ar-Pharazôn\nthe Golden landed in Middle Earth to challenge the power of Sauron, he\nlanded at this heavily fortified port city. After the Downfall of\nNúmenor, these colonists continued to be influenced by Sauron, and\nshowed great antipathy to the exile Kingdoms founded by the Faithful of\nNúmenor, Arnor and Gondor. They became known forever afterward as the\nBlack Númenoreans, battling Gondor by land and sea. It is likely that\nUmbar was conquered for Gondor under one of the Ship-Kings, possibly by\nTarannon Falastur. During the reign of Earnil I and his son, Ciryandil,\nthe Haradrim constantly laid siege to Umbar and in T.A. 1015, Ciryandil\nhimself was slain defending it. This caused his son to conquer Harad and\neventually take the name, Hyarmendacil I.\n\n\nEarly Years\n\nIn the aftermath of the Kin-strife, the great civil conflict between\nEldacar and the usurper Castamir, Castamir's sons fled to to Umbar.\nThere they established a breakaway government in opposition to Gondor,\nand continued to clash with Gondor for centuries to come.\n\n\nPelargir Battles\n\nIn T.A. 1551, Hyarmendacil II conquered Harad when his father, Aldamir,\nwas slain in a skirmish with the Corsairs. However, Umbar held out\nagainst Hyarmendacil's attacks, but suffered grievously.\n\nIn T.A. 1634 the Corsairs learnt that King Minardil, son of\nHyarmendacil, was holidaying in the port city of Pelargir.\n\nLater the Corsairs staged a surprise attack, and Minardil was slain\nbefore he could organise a proper defence of the port. The Corsairs then\nmade a sudden withdrawal.\n\nUnfortunately for Gondor, Pelagir remained a prime target for the\nCorsairs throughout the rest of the Third Age, and by the time of the\nWar of the Ring, the city was a shadow of its former glory.\n\n\nThe Siege of Umbar\n\nThis may refer to several different events in history, when Umbar\nconstantly changed hands between Gondor, and the Corsairs with their\nHaradrim allies.\n\nThe first time Umbar was involved with the wars between Gondor and Harad\nwas when one of the Ship-Kings conquered it from the Haradrim and Black\nNumenoreans who resided there. At this point, Harondor was still under\nGondorian control so it can be assumed that perhaps Umbar was connected\nby land to Gondor, and not just a port outpost surrounded by enemies.\n\nThe wars with Harad never ceased and in T.A. 1015 the Haradrim staged an\nassault on Umbar and King Ciryandil was slain defendings its walls.\nAlthough the port was not taken, it effected the Gondorian populace and\nabove all else, Ciryaher, Ciryandil's son. 35 years later, King Ciryaher\nnot only lifted the Siege of Umbar, but conquered a huge portion of Near\nHarad, crushing the power of the Haradrim.\n\nFor the next four hundred years, Umbar was to remain in Gondorian\ncontrol until after the Kin Strife, when the Sons of Castimir fled\nPelagir and seized Umbar for their own. This proved to be the start of\nGondor's rapid decline.\n\nAldamir, son of Eldacar, still holding a grudge against Castimir and his\nsons for the murder of his brother in the burning of Osgiliath,\nassaulted Umbar and was slain in the process, but the Corsairs victory\nwas soon avenged when Vinyarion, Aldamir's son, conquered Harad and laid\nsiege to Umbar.\n\nBut Gondor's temporary territorial claims in the south were soon\nreversed when the Gondorian siege of Umbar was lifted and the Corsairs\nraided Pelagir, killing King Minardil in the process.\n\nFollowing the destruction of the Plague, both sides were temporarily\nweakened, but Telumehtar of Gondor struck first and conquered Umbar for\nGondor, the last descendants of Castimir perished in the process.\n\nIt is never stated when the Corsairs reconquered Umbar, but it is likely\nthat it fell back to the Corsairs sometime during the reigns of the next\nfew Kings, when Gondor itself was nearly toppled by Wainriders."
  },
  {
    "name": "Fall of Gondolin",
    "lotr_page_id": "3241",
    "text": "The FALL OF GONDOLIN was the battle between the forces of Gondolin under\nKing Turgon and Morgoth, after Maeglin had betrayed the city's hidden\nlocation to the enemy. This battle took the lives of most of the\nGondolindrim, and of Turgon and his captains. However, some few managed\nto escape the through a secret passage, notably Tuor, Idril, and their\nson Eärendil.\n\n\nHistory\n\nWhen the Ñoldor cities of Beleriand fell to the wrath of Morgoth one by\none, Gondolin, hidden within the Crissaegrim, remained as the last\nbastion of hope for those who opposed him. But in FA 551, Turgon's\nnephew, Maeglin, secretly lusting after his cousin Idril and afterwards,\nfailing to receive her love, divulged the secrets of Gondolin and its\npasses to Morgoth, who then orchestrated the assault for many years\nbefore finally unleashing his armies upon the unprepared Elves. Due to\ninformation passed by Maeglin, Morgoth's forces managed to surround the\ncity without being detected, coming over the Encircling Mountains at the\npoint where the watch was least vigilant and during a time of festival.\nBy the time the Elves became aware of them, the city was under siege,\nand there was no hope of victory or escape on the part of the defenders.\n\nFor many days the Elves of Gondolin held their ranks and the city. The\nbattles that raged beneath its walls were bloody and terrible -\ncourageous leaders and warriors, most predominantly Ecthelion and Tuor,\nbecame legends, and later songs and epic poems would be written about\nthem. Swords such as Orcrist and Glamdring earned their reputations\nhere, and became feared among orcs.\n\nHowever, Morgoth's armies were too numerous and powerful for the Elves\nto overcome, as they were comprised not only of Orcs and other mundane\nDark creatures, but of Balrogs and an entire brood of Dragons fathered\nby Glaurung. The defenders of the city managed to leave their mark on\nthe attackers, slaying at least two Balrogs, one of whom was Gothmog\nhimself, but ultimately, the battle was a complete and decisive victory\nfor Morgoth. With Gondolin's fall, the last of the great Elven kingdoms\nin Middle-earth was destroyed, and with it was destroyed any terrestrial\nhope of resisting Morgoth's power.\n\n\nCanon\n\nThe Fall of Gondolin is the third of the Great Tales, but was the first\nwritten by Tolkien, and is the second most complete of the tales (after\nThe Children of Húrin, and is less fractured than the materials used to\nmake up Beren and Lúthien (2017) as stand alone and 'continuous' as\npossible).\n\nThe sources for this major First Age event are the chapters “THE FALL OF\nGONDOLIN” of ''The Book of Lost Tales Part Two __ ''and “OF TUOR AND\nTHE FALL OF GONDOLIN” in _The Silmarillion_, which both tell of the\nfounding of the Elven city of Gondolin (built in secret by Turgon and\nhis people), of the arrival Tuor, a prince of the Edain, of the betrayal\nof the city to Morgoth by Turgon's nephew Maeglin, and of its subsequent\ndestruction by Morgoth's armies. There is also an unpublished poem:\n_The Lay of the Fall of Gondolin_\n\nThe _Lost Tales_ chapter goes more in depth than the account in _The\nSilmarillion_, telling notably in detail of Tuor's and Ecthelion's feats\nin battle, and mentioning every captain of the Houses of the\nGondolindrim.\n\nBackground\n\nJ.R.R. Tolkien actually began writing the story that would become “The\nFall of Gondolin” in 1917, in an army barracks on the back of a sheet of\nmilitary marching music. It is more or less the first traceable story he\never wrote down on paper about the Middle-earth legendarium.\n\nBecause Tolkien was constantly revising his First Age stories, the\nnarrative he wrote in 1917 (published posthumously in _The Book of Lost\nTales Part Two_) remains the only full account of the fall of the city.\nThe narrative in _The Silmarillion_ was the result of the editing by his\nson Christopher of various different sources.\n\nA partial new version of “The Fall of Gondolin” was published in the\n_Unfinished Tales_ under the title “Of Tuor and his Coming to Gondolin”.\nActually titled “Of Tuor and the Fall of Gondolin”, this narrative shows\na great expansion of the earlier tale. It can be surmised from this text\nthat Tolkien would have rewritten the entire story, but for reasons that\nare not known he abandoned the text before Tuor actually arrives in the\ncity. For this reason Christopher Tolkien retitled the story before\nincluding it in _Unfinished Tales_.",
    "conflict": "War of the Jewels",
    "date": "FA 510",
    "location": "Gondolin",
    "outcome": "The demise of the great city of Gondolin and the death of Turgon"
  },
  {
    "name": "Battle of Osgiliath",
    "lotr_page_id": "746",
    "text": "The BATTLE OF OSGILIATH was a battle during the War of the Ring at the\nruined city of Osgiliath - and a prelude to the Battle of the Pelennor\nFields.\n\n\nHistory\n\nPrelude\n\nPrior to this, Sauron had regained all his military strength and was\nprepared to attack Middle-earth. He first planned to attack his most\npowerful enemy, the land of Gondor, where “the hammer stroke will fall\nhardest”, but in order to destroy Gondor's capital, Minas Tirith, he\nfirst needed to capture Osgiliath, a ruined fortress-city strategically\npositioned on the river. Fords across the river were located in\nOsgiliath (half of the city was located on each side of the river) that\nwere the only path a large army could cross the Anduin for hundreds of\nmiles up or downstream (from Cair Andros to Pelargir). If captured,\nSauron could freely move his main army across the river and to the\nprimary target of his strategy in the war, Minas Tirith.\n\nThe Battle\n\nThe battle to control the ruins of Osgiliath had actually been fought,\non and off, for over a century since the fall of Ithilien to Mordor. A\nrenewed offensive by Mordor to take the city had begun several years\nprior to the Quest of Mount Doom (several years before TA 3018), and was\nfought continuously after that point with occasional lulls. The forces\nof Gondor, led by their captain-general Boromir, engaged in fierce urban\nwarfare during this long siege. Under Boromir's command the enemy was\npushed out of the half of the city on the west bank of the river, and on\na strike force including Boromir and his younger brother Faramir was\nable to destroy the last bridge in the city that connected the two banks\nof the river. This prevented Mordor's army from making an easy crossing,\nalthough the fords remained. Sauron not sending more troops to\nOsgiliath, but instead massing them within Mordor for a killing-blow\nmonths later probably caused this lull in the Mordor-offensive. During\nthis break in heavy fighting, Boromir left Gondor to seek counsel at\nRivendell; he would never return.\n\nDuring this time, Faramir led several Ranger attacks deep into\nMordor-occupied Ithilien, ambushing enemy armies moving to the Black\nGate; Frodo and Sam stumbled into one such attack, as told in _The Two\nTowers._\n\nWhen the Great Signal from Mordor went up and another answered from\nMinas Morgul, the War of the Ring properly began, even though Isengard\nhad been fighting before this and Sauron had been pursuing his other\nfronts. Thus, the Battle of Osgiliath was the first battle of the war in\na strict sense.\n\nWhile there were men defending the west side of Osgiliath, the Steward\nDenethor ordered Faramir to lead a force to reinforce them. Faramir\nregarded the order ill advised and certain to result in death, but\ncomplied.\n\nHowever, Mordor was prepared. Months beforehand, the Orcs in East\nOsgiliath had been secretly constructing massive numbers of boats and\nrafts, and swelled with reinforcements from Harad they swarmed across\nthe River Anduin to the Gondor positions on the other bank. After long\nand heavy fighting, the garrison under Faramir and his troops were\nforced to flee back to Minas Tirith, behind the Rammas Echor. Faramir\nhimself was badly wounded in the retreat, when a poisoned Southron arrow\npierced him; more severe damage was done by the Black breath of the\nNazgûl. When the retreat was sure to be a disaster, the knights of the\nDol Amroth sortie led by Imrahil arrived; the pursuing hordes were\ndriven back and the garrison reached the city safely.\n\nIn the meantime, the Orcs made makeshift repairs to several destroyed\nbridges. The main combined army of Mordor then arrived, formed from\nthose that Frodo saw leaving Minas Morgul, but this was “but one and not\nthe greatest of the hosts that Mordor now sent forth”: for on their way\nfrom The Morgul Vale, the orcs the Minas Morgul cavalry led by the\nWitch-king of Angmar had been joined with the Haradrim from the south,\nand a far greater host that had massed at the Black Gate joined them at\nOsgiliath, and the combined forces now entered the western bank of\nOsgiliath. More also came from the fords at Cair Andros, which was\nrecently captured, but they would not reach Minas Tirith until later.\n\nAftermath\n\nOsigiliath now completely in the hands of Mordor, the vast army of\nSauron marched from the city and surrounded Minas Tirith, beginning the\nsiege of Gondor and leading directly into the Battle of the Pelennor\nFields.\n",
    "conflict": "War of the Ring",
    "date": "June 20, TA 3018 - March 12, TA 3019",
    "location": "Osgiliath",
    "outcome": "Victory for Sauron, Mordor successfully gained the crossing of the Anduin River."
  },
  {
    "name": "Destruction of Amon Sûl",
    "location": "Amon Sûl",
    "lotr_page_id": "32821",
    "text": "The son of Malvegil, King Argeleb I, reclaimed the kingship of all Arnor\nand took the prefix ar(a) (Sindarin for royal, or kingly) in token of\nthis. Cardolan did not oppose this as there the Dúnedain had grown few,\nbut the kingdom of Rhudaur resisted the claim by Argeleb, led by an evil\nhill-chief who was in secret league with Angmar. At this, Argeleb\ndecided to fortify the Weather Hills to resist an invasion from the east\nby the forces of Angmar and Rhudaur, but he was slain in battle in the\nyear TA 1356 along the frontier.\n\n\nPrelude\n\nIn 1409 the Witch-King of Angmar led a great host across the river\nHoarwell against land of Cardolan, after being beaten back out of the\nlands of the Dúnedain many years before.\n\nThe son of Argeleb, King Arveleg I continued his fathers defence against\nAngmar along the fortified Weather Hills, the Great East Road, and the\nlower Hoarwell, and for many years he held back the assaults of Angmar\nand Rhudaur. It was also at this time that the Elven haven of Rivendell\nwas besieged by the forces of Angmar. Arnor's capital of Fornost lay\nupon the North Downs only a few dozen miles away from the Weather Hills,\nand Angmar sought a way to break through the frontier and lay siege to\nthe city. It was to this end that in the year TA 1409 a great host came\nout of Angmar, and crossing the river it entered Cardolan and surrounded\nAmon Sûl. After a fierce siege the Dúnedain of Arnor were defeated, the\ntower of Amon Sûl destroyed, and King Arveleg slain. However, the\nWitch-king's victory was not complete, as the palantír of Amon Sûl, the\ngreatest of the three in the north, was carried back in retreat to\nFornost.\n\nAfter the destruction of Amon Sûl, the power of Arnor to resist the army\nof Angmar was severely weakened. The tower's destruction meant that the\narmy of Angmar had now made the fortified line along the Weather Hills\nuntenable, and its forces gained easy access to the heart of Arnor.\nRhudaur was now absorbed by Angmar and populated by evil men subject to\nthe Witch-King. The few Dúnedain who remained were either slain or fled\nfar westwards, never returning to the lands now claimed by Angmar. The\nkingdom of Cardolan was ravaged by the forces of Angmar who entered its\nnorthern borders uncontested by the crippled army of Arthedain, and its\npeople fled into hiding on the ancient Barrow Downs, or Tyrn Gorthad in\nSindarin. It was in this desperate defence against Angmar that the last\nprince of Cardolan fell in battle, and he was entombed by the survivors\namong his people in what some say was the very same barrow that Frodo\nand his companions had been imprisoned during the War of the Ring.\n\nAlthough the situation was dire, the young King Araphor, son of Arveleg,\ndefended the city of Fornost against the host of Angmar. Although he was\nstill a youth by the reckoning of his people, Araphor proved valiant,\nand with the help of Círdan of Lindon he repulsed Angmar's army from the\nNorth Downs and won a great victory. It was at this time that Angmar was\nsubdued by Elven-folk from Lindon, Rivendell, and even Lothlórien for\nElrond had brought help over the passes of the Misty Mountains. At the\nsame time, the Stoors (one of the three peoples who were named Hobbits)\nwho had previously dwelt in the angle between the Hoarwell and the\nLoudwater fled south-westwards because of the wars and the dread of\nAngmar, and because the land and clime of eastern Eriador worsened and\nbecame unfriendly. Some of these returned to Wilderland in Rhovanion and\ndwelt alongside the banks of the Gladden, becoming a riverside people of\nfishers, but others migrated westwards to a land known by the Dúnedain\nas Sûza, which the Stoors named the Shire. These peoples were granted by\nthe eleventh king of Arthedain, Argeleb II, land that had become\nsparsely populated by war, and dwelling there as a people became the\nHobbits known by the end of the Third Age for their love of peace and\ndomesticity.\n\n\nAftermath\n\nAmon Sûl was the main defensive outpost in the Weather Hills and\nnorthern Cardolan. With it gone the Witch-King was able to take and\nravage Cardolan, as well as consolidate his new conquests in Rhudaur,\nwhich his Hill-Men allies and subjects had taken, as well as launch\nattacks against the whole of Arthedain.\n\nHowever despite permanently ending the threat that was Cardolan, Angmar\nwas unable to ride its momentum, and was driven away from the city of\nFornost and the North Downs by the forces of the new King Araphor and\nLord Círdan of Lindon.\n"
  },
  {
    "name": "War for Sake of the Elves",
    "lotr_page_id": "19941",
    "location": "Middle-earth",
    "text": "History\n\nBackground\n\nIn the ages prior to the sun, Arda was reformed by the massive energy\nreleased when Melkor destroyed the original light sources, the two\nLamps. The Valar fled the razing to the newly formed continent of Aman\nand built Valinor, while Melkor reigned unchecked in the new continent\nof Middle-earth, where he corrupted the surviving beasts. Unaware of\nthese designs, the Valar did not approach him for fear that the\nconfrontation would be just as world-devastating as the extinguishment\nof the light. Their priority was to protect the original plan of\ncreation, though they were unsure of what was salvageable. They did not\nknow if Eru's personal creations, elves and men, would now ever come\ninto being after the catastrophe.\n\nFortunately, the elves did come to being; however, they appeared in\nMiddle-earth near Cuiviénen. Withdrawn, the Valar were unaware of this.\nOn the other hand, Melkor was quickly learned of this through his spies.\nSoon, elves who wandered too far from their lands were captured and\ntaken to the fortresses of Angband and Utumno. There, in Melkor's utmost\ncontempt for Eru and his sole ability to create life, they were\ncorrupted through torture into servants bred solely for war - orcs.\n\nSometime later, while on a hunting trip in Middle-earth, the Valar Oromë\nstumbled upon the elves that were unharmed. After realizing what they\nwere, he asked them to return with him to Valinor for their protection.\nWhile the majority of them agreed, a some refused, believing him to be\ntheir kidnapper. When Oromë returned with the elves willing to leave\nwith him, the Valar were made aware of orcs. Their creation was\nmost-likely seen as the worst imaginable offense. Manwë and the rest of\nthe Valar could stand this no longer, and so the Valar took counsel with\neach other and decided to rid Middle-earth of Melkor's tyranny.\n\nThe War\n\nSoon, the Valar declared war on Melkor, presumably a massive army of\nlight and battled him for many decades. The Host of the Valar easily\ndefeated Melkor's host at the Battle of the Powers in northwestern\nMiddle-earth. The remnant of his forces fled back to Utumno and\nfortified themselves there. The Valar passed over Middle-earth and\nplaced a guard over Cuiviénen to protect the elves from any further\neffects of the war or perhaps from an attack from Melkor's servants.\nThen, the Host of the Valar went north to Utumno and besieged it. After\ndecades of siege, the Host of the Valar finally broke through and after\nTulkas himself personally defeated Melkor in combat, they captured him\nand took him to Valinor for judgment, and sentenced him to prison in the\nHalls of Mandos for thousands of years.\n\nAftermath\n\nThe war between the two powers devastated the lands of Middle-earth and\nthe face of the continent was changed. The distance between Middle-earth\nand Aman separated by the Great Sea became wider. A Gulf in south was\ncreated and small bays appeared between the Great Gulf and Helcaraxë.\nThe Mountains of Hithlum and the highlands of the Dorthonion were\ncreated. The Sirion river that flowed into the newly formed Bay of Balar\nappeared. Free of evil, the elves were invited to Valinor and undertook\na Great Journey across Middle-earth in which new Elven cultures were\ndeveloped. The result was the peopling and colonisation of the western\nparts of Middle-earth with the Children of Ilúvatar.\n\nLegacy\n\nThe main legacy of war was that it allowed the Elves to go to Aman and\nValinor where they became High Elves, enlightened, cultured, and\nskilled. Elves in Middle-earth established themselves learning much of\nnature, woodlore, and shipbuilding. However, the fear brought about by\nMelkor caused some elves to relent and stay in the east longer. These\nelves, the Avari and the rest of the Dark Elves developed separate and\nmore secretive cultures and stayed away from the affairs of their long\nloss brethren for the most part. They would then thousands and thousands\nof years later in the Third and Fourth Ages become the Wood-elves that\nwould be the last of the kindreds of left in Middle-earth ever after.\nThe languages of the elves spread throughout Middle-earth and blended\nand influenced other tongues and became known of ever after.\n\nThe other legacy was that Melkor, then released from prison who would\never after remember that his downfall was because of the Elves sought\nrevenge thus causing the Revolt of the Ñoldor and the War of the Jewels\nand the battles and dramas that followed. It would also serve to\nshape the course of the history of the Children of Ilúvatar for ages to\ncome."
  },
  {
    "name": "Wainrider War",
    "lotr_page_id": "29140",
    "text": "The WAINRIDER WAR was a war between the Easterling Wainriders with their\nallies and Gondor with its Northmen allies.\n\n\nHistory\n\nBackground\n\nIn the more than 600 years following Minalcar's defeat of the\nEasterlings in TA 1248, the Easterling tribes of Rhûn were no longer a\nthreat as Gondor ruled the lands of the east all the way to the shores\nof the Sea of Rhûn, and Gondor now had the loyalty of the Northmen of\nRhovanion. While during this long period, Gondor switched its\nterritorial ambitions to the south and built a great naval fleet that\nruled the seas. However, the hatred of the Dúnedain and the Men of\nGondor survived in the remaining tribes apparently living further east\nbut the reasons for the unification and attack of these hostile\nEasterling tribes is not known. The only thing that is known is that it\nmust have happened before TA 1851 with no doubt great preparation and\nplanning.\n\nInvasion Begins and Gondor Defeated\n\nIn TA 1851, the Wainriders fell upon Gondor and the realm of\nRhovanion causing much destruction and leaving many dead especially\namongst the Northmen. After five years of attacks, Gondor finally\nassembled an army led by King Narmacil II himself. The battle was lost\nand King Narmacil was slain in it as was his faithful Northman ally\nMarhari. Afterwards, Gondor lost its eastern lands and the realm of\nRhovanion was occupied and enslaved.\n\nRule of the Wainriders\n\nFor forty-five long years, the Wainriders ruled in Rhovanion where they\nbuilt homes, settlements, outposts, and storehouses most likely with the\nuse of forced labor. They also no doubt had freedom of movement between\ntheir conquests in the west and Rhûn that they never had had before,\nwithout opposition from Gondor or anyone else.\n\nThe Beginnings of the Éothéod\n\nAlthough most of the Northmen of the former realm of Rhovanion fell into\nslavery, some survivors of the sack and people made into fugitives by\nthe Wainrider's takeover followed Marhwini, the son of the Marhari\nnorthwest into the Vales of Anduin where they settled. Out of these\npeople came the Éothéod, who opposed the invaders and maintained\nfriendship with Gondor. Surviving the Wainriders rule, they somehow knew\nof the Wainrider's plans and found out that they had grown hunger from\nmore conquests and that there was great hatred of the Wainriders in\nthose that they ruled. By TA 1899, they knew of their plans to attack\nthe Gondor province of Calenardhon from over the Undeeps and gave that\ninformation to the Gondor. They also planned to rouse and assist a\nrebellion in Rhovanion when such an attack begun.\n\nThe Tables Turn\n\nAs the Wainriders prepare for war, the Gondor king Calimehtar sent a\ngreat host against them from out of North Ithilien. With this, the\nWainrider's plans for Calenardhon changed and they sent all against\nGondor. This worked in Gondor's favor as it allowed for the two foes to\nmeet with all force in one place instead of many, leaving the Undeeps\nundefended. Gondor and its Éothéod allies took quick advantage of this\nand sent their own cavalry over the Undeeps, meant to attack the enemy\nfrom behind. The two armies met in Dagorlad, and the Wainriders were\ndefeated with Marhwini's _éored_'''s ''support and with Gondor's cavalry\nassailing them from behind.\n\nThe Wainrider's defeat led to an uprising in Rhovanion by the slaves but\nthe Wainriders were not completely expelled from the west, as they still\nremained in Rhovanion due to the slow progress of the slave rebellion.\nThe Éothéod also continued to harass them from the northwest as well.\nNever-the-less, it was the beginning of the end to the Wainriders hold\non the west.\n\nA New Threat\n\nFor forty-five more years, the Easterling Wainriders were still a\nproblem despite their losses in the west and plotted a new campaign.\nNeeding more support to recoup their losses and defeat Gondor, they\nformed alliances with the Men of Harad and those of Khand. Once again,\nthe Éothéod again warned Gondor of this new threat to the west. In the\nmonth of Cermië of TA 1944, war resumed with the Wainrider alliance\nthreatening Gondor from both the north and the south. Ondoher prepared\nto meet the enemy in the north while Eärnil, his most trusted captain of\narmies prepared to face them in the south.\n\nThe King marched his army out of Ithilien intending to fight the enemy\nonce again on the Dagorland, but is driven to the Black Gate by\nWainriders from Rhovanion and a combined Wainrider/Khand army from Rhûn\ntraveling along the Ash Mountains to battle. There King Ondoher was\nutterly defeated losing his life and his two sons: Artamir and Faramir.\nThere were some survivors of the defeat that scattered south but field\nwas lost.\n\nThe Wainriders occupied Northern Ithilien was no opposition setting up\ncamps. Here, the victors celebrated believing Gondor was at last\ndefeated but it was not true for Eärnil's smaller but well led Southern\nArmy defeated an army of Haradrim in Southern Ithilien, and proceeded to\nmarch north to face the Wainriders. He met up with some of the\nretreating troops of Ondoher's defeated army and fell upon the\nWainrider's camp in a surprise attack. The Wainrider's were completely\ndefeated in a great rout. Those Wainriders that didn't escape back to\nRhûn died in the Dead Marshes. The war was over.\n\nAfterwards\n\nThe Wainrider threat was over and the Northmen realm in Rhovanion was\ncompletely freed and cleared of the invaders and some of these Men\nmigrated to Gondor where they were welcome as distant brethren. In\nTA 1945, Eärnil was crowned King of Gondor. The Éothéod also\nmaintained friendship with Gondor. Gondor's policy switched to\naiding Arnor in the defeat of Angmar.\n\nLegacy\n\nThe Wainrider War led to a series of events that created the Éothéod who\nlater became the Rohirrim. Their long friendship with Gondor led to the\nlater Oath of Eorl taken by their Lord and later King Eorl the Young\nafter coming to the aid of another war against another Easterling\nthreat, and the afterwards granting of Calenardhon to his people which\nafterwards became Rohan.\n",
    "conflict": "Easterling Wars",
    "location": "Rhovanion",
    "outcome": "Costly Gondor victory"
  },
  {
    "name": "Battle of the Black Gate",
    "lotr_page_id": "748",
    "text": "The BATTLE OF THE BLACK GATE, also known as the BATTLE OF THE\nMORANNON, was the final major battle of the War of the Ring. It resulted\nin the ultimate defeat of Sauron not by victory on the battlefield, but\nby means of the destruction of the One Ring by the hobbit Frodo.\n\n\nHistory\n\nBackground\n\nAfter the victory of the Free Peoples in the Battle of the Pelennor\nFields, the enemy retreated to Mordor. Sauron was defeated but he still\nhad thousands of Orcs at his disposal in Mordor. He was aware that the\nOne Ring was somewhat close to the vicinity of his territory, but he did\nnot know that the Hobbit Frodo Baggins and his companion Samwise Gamgee\nhad entered Mordor via Morgul Vale with the intention of destroying the\nRing.\n\nPlot against the Dark Lord\n\nAfter the Last Debate, the Men of the West assembled the Host of the\nWest, 10,000 strong, led by Aragorn, who marched on the Black Gate as a\ndiversionary feint to distract Sauron's attention from Frodo and Sam,\nwho were carrying the One Ring through Mordor to be destroyed in the\nfires of Mount Doom. It was hoped that Sauron would think Aragorn had\nthe Ring and was now trying to use it to overthrow him in Mordor.\n\n\n\nMustering\n\nInitially, the Host of the West consisted of 10,000 men, but 3,000\nRohirrim were sent to guard the crossroads, leaving Aragorn with 7,000\nmen. Before they reached Ithilien they were ambushed by Haradrim and\nEasterlings, but they drove them away easily with no casualties.\n\nThen, as they approached Dagorlad, some of the farmers of Lossarnach and\nRohan were too afraid to continue to pass the Desolation of the\nMorannon. Aragorn dismissed the faint-hearted, ordering them to liberate\nCair Andros on the river Anduin. This resulted in the departure of an\nestimated 1000 men, leaving Aragorn with 6,000.\n\nParley with the Dark Lieutenant\n\nBefore the battle began, the Black Gate opened slightly, letting out a\nsmall embassy. At the head was a high servant of Sauron, a Black\nNúmenórean called the Mouth of Sauron, who had been ordered to speak\nwith the Captains of the West. He reasoned that the Army of the West\ncould not defeat Sauron's host on the battlefield, and demanded the Army\nsurrender. The Lieutenant then brought forth several items that had\nbelonged to Frodo and Sam (Sam's sword, an Elven cloak, and Frodo's\nMithril shirt). Gandalf asked for the terms of their surrender, which\nwere to allow Sauron dominion over Isengard and Rohan, as well as\nGondor's vassalage. Gandalf vehemently refused.\n\nRealizing the Army intended to fight and being outnumbered, fear and\nanger overcame the Lieutenant, and he retreated to the Morannon, which\nthen opened to reveal a massive army of Sauron's forces. Thousands of\nOrcs also emerged from the hillsides around the Morannon. In the film\nAragorn, not believing what happened to Frodo, beheads The Mouth of\nSauron.\n\nThe Battle\n\nAgainst the Host of the West was arrayed a large hordes of Orcs, Trolls,\nand Mannish allies such as the Easterlings and Haradrim. An exact count\nis not given of the number of Sauron's forces, but it is said that they\nwere “ten times and more than ten times” greater than the Host of the\nWest, making it a force of at least 60,000. Sauron's forces surrounded\nthe Armies of the West on three sides, with the Easterlings on the left\nflank, the Orcs held the center, and the Haradrim on the right.\nInitially, Sauron's forces found difficulty in getting to the Army of\nthe West, due to the large slag pools and pits of waste surrounding\nparts of the Morannon, which impeded their progress. The Armies of the\nWest always had cohesive stability within their center and kept the\nEnemy from breaking through by force of numbers. The solid infantry\nsquares of Gondor infantry beat off their inferior Orcish opponents\nwhile the Rohirrim cavalrymen staved off the archers of the Harad. The\nsmall force of Easterlings launched a quick attack before being repulsed\nby the armies of Gondor and Rohirrim while the larger Haradrim force\nslowly retreated to the hills. By now, pressure had eased off of the\nflanks of the Armies of the West, who smashed into the lines of the\nOrc-host, slowly beating them off and forcing a retreat back through the\nBlack Gate (though not without suffering sizable losses of their own).\n\n\n\nDuring the course of the battle, the remaining eight Nazgûl emerged and\nattacked the Army of the West. Shortly thereafter, however, the Great\nEagles of the Misty Mountains, led by Gwaihir the Windlord, arrived and\nattacked the Ringwraiths, preventing them from pressing their aerial\nadvantage. Trolls began to crash through the lines of infantry, and the\nOrcs and Easterlings made renewed assaults on the Army of the West,\nencircling it. Many of the soldiers of the West began to become\ndistraught. That was when Frodo put on the One Ring and Sauron realized\nthat Frodo and the Ring were inside Mount Doom.\n\nThe Fall of Barad-dûr and Sauron\n\nThe Nazgûl immediately left the battle to intercept Frodo. Before they\ncould get there however, Gollum bit the Ring off Frodo's finger and\ndanced with joy accidentally falling into the Crack of Doom, destroying\nthe Ring, and Sauron's power was overthrown.\n\n\n\nBarad-dûr, the Black Gate, and the Towers of the Teeth collapsed to\nruin. The Orcs and other creatures of Sauron were completely\ndirectionless with the Dark Lord's demise and were easily defeated and\ndestroyed by the remaining troops of the Host of the West. Some of the\nEasterlings and Haradrim fought on stalwartly, though eventually many\nthrew down their weapons and surrendered (later to be sent home in peace\nby Aragorn).\n\nThe Rest of the Battle\n\nDespite the destruction of Mordor and its armies, the fight against\nSauron's remaining forces would continue in the northern theater of the\nWar of the Ring for several weeks, notably at Dol Guldur in Mirkwood and\nat The Lonely Mountain, but the power of Sauron, the Dark Lord of\nMordor, was no more.\n\nMonths later, the Battle of Bywater in the Shire against Ruffians men\nled by Saruman, and the subsequent killing of Saruman by Wormtongue who\nthen was later slain, ended the War of the Ring.\n",
    "conflict": "War of the Ring",
    "date": "March 25, 3019",
    "location": "Black Gate",
    "outcome": "Decisive Gondor and Rohirrim victory, final defeat of Sauron."
  },
  {
    "name": "Dagor Dagorath",
    "lotr_page_id": "5728",
    "text": "The DAGOR DAGORATH or “FINAL BATTLE” is the end-times event described\nand alluded to in the works of J.R.R. Tolkien. The published\n_Silmarillion_ ends with the recounting of the voyage of Eärendil the\nMariner, but this is due to an editorial decision by Christopher\nTolkien. The _Silmarillion_ as Tolkien originally wrote it ends with a\nprophecy by Mandos about the Dagor Dagorath, often referred to as “THE\nEND”. The remaining clue to this prophecy is found at the end of\nAkallabêth, where \"Ar-Pharazôn and his mortal warriors who had set foot\nin Aman were buried by falling hills, imprisoned in the Caves of the\nForgotten until the “LAST BATTLE AND DAY OF DOOM”. The account is\nclearly inspired by and bears many similarities to the Norse legend of\nRagnarök, but also that of the Biblical Armageddon. It is important to\nnote that the final, published version of the ''Silmarillion ''contains\nno direct references to this prophecy (though there are still indirect\nreferences including the 'Last Battle', 'Day of Doom' and 'end of\ndays'.\n\nTom Bombadil once referred to this future time as when “the world is\nmended”, in a song.\n\nDoom of Melkor\n\nIn later writings of Tolkien's, it becomes apparent that Melkor was not\nmerely bound, but unhoused, after his final capture, being “beheaded”\nand thus “killed”; that is, the body to which he had become so bound\ntowards was destroyed, after which execution his spirit, still bound\nwith the enchanted chain Angainor, was cast out through the Door of\nNight. His “will” is spoken of as an active force in the world, tempting\nand urging in thought, and sometimes in phantom manifestation.\n\nThe Second Prophecy of Mandos\n\n“Thus spoke Mandos in prophecy, when the Valar sat in judgement in\nValinor and the rumour of his word was whispered among all the Elves of\nthe West. When the world is old and the Powers have grown weary,\nMorgoth, the Black Foe of the World, seeing that the guard sleepeth,\nshall come back through the Door of the Night out of the Timeless Void;\nand all shall be darkness, for the sun he will turn to black, and the\nmoon will no longer shed his light.. But the Host of Valinor shall\ndescend upon him as a searing flame, white and terrible. Then shall the\nLast Battle be gathered on the fields of Valinor. In that day, Tulkas\nshall strive with Morgoth, and on his right hand shall be Eönwë, and on\nhis left Túrin Turambar, son of Húrin, returning from the Doom of Men at\nthe ending of the world; and the black sword of Túrin shall deal unto\nMorgoth his death and final end; and so shall the Children of Húrin and\nall fallen Men be avenged.”\n\n“Thereafter shall the Earth be broken and remade, and the Silmarils\nshall be recovered out of Air and Earth and Sea; for Feanor shall\nsurrender them willingly Yavanna will rekindle the Two Trees, and a\ngreat light shall come forth. And the mountains of Valinor shall be\nlevelled, so that the light shall go out over all the world. In that\nlight the Valar will grow young again, and the Elves awake and all their\ndead arise, and the purpose of Ilúvatar be fulfilled concerning them.\nBut of Men in that day the prophecy of Mandos doth not speak, and no Man\nit names, save Túrin only, and to him a place is given among the sons of\nthe Valar.” - The Later Quenta Silmarillion (History of Middle-earth,\nvolume 11).\n\nBattle\n\nAccording to the prophecy, Morgoth will discover how to break the Door\nof Night, and will blacken the Sun and the Moon. For the love of these,\nEärendil will return from the sky and shall meet Tulkas, Manwë, Eönwë\n(with the old version of his name Fionwe) and Túrin Turambar on the\nplains of Valinor.  There the\nforces of the Valar shall fight against Melkor and The Dark Powers.\nTulkas will wrestle with Morgoth, but it will be by the hand of Túrin\nthat finally death and destruction will be dealt to Melkor. Túrin will\nrun his black sword Gurthang (Iron of Death) through Melkor's heart,\nthus avenging the Children of Húrin (Sindarin: _Hîn Húrin_) and all the\nfallen (In the end of _The Hiding of Valinor_ Eönwë, and not Turin,\nkills Morgoth). Then the three Silmarils will be recovered from the\nEarth, sea, and sky, then Fëanor taking them and will break, and with\ntheir fire Yavanna will rekindle the Two Trees, and a great light shall\ncome forth, and Pelóri Mountains will be leveled. The battle will end\nand renew Arda's existence: all the Elves will awaken and the Powers\nwill be young again.\n\nFollowing this, there will be a Second Music of the Ainur. This song\nwill sing into being a new world. Men and Elves will sing it with the\nAinur. It is unknown what the fate of the old races, or of the old\nworld, will be in the new one. However, It is worth noting that the\nDwarves believe that after the greatest battle of all time, they will\nhelp the Vala, Mahal, rebuild Arda. For though Mandos prophesied it,\neven the Ainur do not know anything of the second world or the Second\nMusic. All the Ainur know is that the Second Music will be greater than\nthe First Music.\n\n\nNotes\n\nChristopher Tolkien removed the prophecy from _The Silmarillion_ based\non a 1958 version of the Valaquenta, wherein his father wrote that none\nof Mandos' dooms had declared whether the Marring of Arda would ever be\nrepaired (Christopher Tolkien adopted this passage and used it to close\nthe Quenta Silmarillion). Given this removal of the prophecy Christopher\napparently assumed that the Dagor Dagorath had been removed as well.\n\nThe published _Silmarillion_ contradicts the Second Prophecy in places.\nWhereas the Second Prophecy explicitly states that the Elves and Valar\nshall be renewed after Dagor Dagorath and that the fate of Men is\nunknown, _The Silmarillion_ states that Men will participate in singing\nthe Second Music, and that it is the fate of the Elves that is unknown.\n\nIn all of this the Creator, Eru, will retain His sovereignty and nothing\nMorgoth nor any evil force could do will be able to threaten his plan in\nany way. As Eru said, “And thou, Melkor, shalt see that no theme may be\nplayed that hath not its uttermost source in me, nor can any alter the\nmusic in my despite. For he that attempteth this shall prove but mine\ninstrument in the devising of things more wonderful, which he himself\nhath not imagined.”\n\n\nEtymology\n\n_Dagor Dagorath_ was Sindarin for “Battle of Battles”.",
    "conflict": "Dagor Dagorath",
    "date": "The last year of Arda",
    "location": "Aman",
    "outcome": "Pyrrhic Victory for Valinor, Final Death of Morgoth, Rekindling of the, Two Trees, Destruction and remaking of Arda"
  },
  {
    "name": "Dagor Bragollach",
    "lotr_page_id": "2344",
    "text": "The DAGOR BRAGOLLACH or BATTLE OF THE SUDDEN FLAME was the fourth of the\ngreat battles of the War of the Jewels. It marked the end of the Siege\nof Angband and beginning of Morgoth's gains against the Elves and Men of\nthe Beleriand.\n\n\nHistory\n\n\n\n\n\nFor four hundred years after Dagor Aglareb the Ñoldor had managed to\ncontain Morgoth's power inside Angband. Peace and prosperity reigned in\nBeleriand, to the point where green grass grew even to the very doors of\nAngband. The strength of the Elven kingdoms, and that of their Edain\nallies, became such that Fingolfin, High King of the Ñoldor, believed\nthat the siege would last forever. But though the Elves and Edain had\nmanaged to contain Morgoth's forces, it was beyond their power to\nassault Angband or to overthrow the power of Morgoth. As such, the Dark\nLord labored undisturbed in Angband during the siege, breeding countless\nlegions of Orcs and other evil creatures, as well creating the first\nDragon. He intended to use this new, unprecedentedly powerful force to\nutterly destroy those who had opposed him. However, in the furious haste\nof his malice, he decided to strike before his designs were complete,\ncynically underestimating the valor of the Elves, and not accounting for\nthe Edain at all. This haste was credited as the reason why resistance\nagainst Morgoth was able to continue after the conclusion of the\nconflict; for if Morgoth had waited for a short time longer to complete\nthe buildup of his forces, his foes would have been annihilated.\n\nOn a cold winter's night when the Elven watch was at its least vigilant,\nMorgoth sent out rivers of flame and poisonous fumes from Thangorodrim\nand the Iron Mountains. The plains of Ard-galen were consumed by the\nfire and transformed into a barren desert which was renamed\nAnfauglith, “the Gasping Dust”. The Elves had never faced an assault of\nthis sort before, and many perished as they fled from these flames.\nBehind them came the Balrogs, Glaurung the Father of Dragons, and\nlegions of Orcs in such numbers as the Elves had never imagined.\nMorgoth's primary aim was an onslaught so rapid that the various\nkingdoms of the Elves would not be able to consolidate their forces or\ncome to each others aid. And so it was that each of the Elven kingdoms\nhad to fight Morgoth's forces on their own. The Orcs quickly overran the\nhighlands of Dorthonion, and slew Angrod and Aegnor. Maglor's horsemen\nwere burnt alive on the plain of Lothlann, and Maglor's Gap was taken,\ngiving Morgoth an entry into Beleriand. Maglor retreated with heavy\nlosses to Himring, where he helped defend the city of Maedhros. Though\ngrievously besieged, the heavily fortified city did not fall, and\nMaedhros himself accomplished deeds of surpassing valor during the\nfighting.\n\nThe Pass of Aglon was also breached, and Celegorm and Curufin fled north\nof Doriath to Nargothrond. Morgoth's Orcs took the mountain forests of\nMount Rerir, and defiled Lake Helevorn, scattering south through\nThargelion into East Beleriand. Caranthir fled to Amon Ereb, where he\nand Amrod built defenses. From there they slowly freed East Beleriand of\nthe Orcs, while Maglor and Maedhros held the northern border.\nEventually, Maedhros even managed to re-secure the Pass of Aglon,\ndenying the forces of Morgoth continued entry into Beleriand from that\nroute.\n\n\n\nMinas Tirith in the Pass of Sirion in the West under Orodreth held, and\nOrodreth's uncle and Lord Finrod Felagund came north from Nargothrond\nwith a large army. However, they were ambushed by a huge number of\nMorgoth's forces at the Fen of Serech. The Noldor found themselves\ntrapped, and Finrod would have been killed or taken but for a sortie by\nBarahir and his men, who descended from Dorthonion and rescued the Elven\nlord. The cost in lives was heavy, but Finrod escaped the Orcs. In\nprofound gratitude, Finrod gave Barahir his ring, which would become\nknown as the Ring of Barahir, and pledged that he would aid Barahir and\nhis kin in any time of need.\n\nFinrod and his folk fled south to Nargothrond, while Barahir continued\ndefending Dorthonion until both his forces and his people dwindled to\nnothing. The mountain forts of the Ered Wethrin around Hithlum were\nheavily assaulted but managed barely to hold, as the mountains\nthemselves provided protection from the fires Morgoth had released from\nThangorodrim.\n\nThus the Siege was broken, the Sons of Fëanor scattered, and the forces\nof Morgoth roamed at will throughout the north.\n\nWhen Fingolfin, the High King of the Ñoldor, learned of the heavy\ncasualties of so many Ñoldor, he rode in wrath across the dust of\nAnfauglith to Angband and challenged Morgoth to single combat. At the\ndoors of Angband itself, they fought a great duel, and Fingolfin wounded\nMorgoth seven times. Yet, Fingolfin was ultimately no match for the Dark\nLord and was crushed beneath Morgoth's foot, but not before stabbing\nMorgoth in the heel with his last stroke. Thorondor, king of the Great\nEagles, then swooped down and retrieved Fingolfin's body and scarred\nMorgoth's face. Though Morgoth's wounds would never heal and he was left\nwith a permanent limp, Morgoth and his forces were nevertheless\nvictorious.\n\nStill, Morgoth was cautious. For though he had won a great victory, his\nfoes had inflicted upon him loss as great as their own. As his initial\nonslaught had abated, his foes had begun to recover, making small\nadvances into the fringes of the territory he had conquered. He had not\nexpected the Elves to resist him so strongly, and the aid of their Edain\nallies had been a completely unforeseen variable in his plans. As such,\nhe checked his assault and recalled the main host of the Orcs to\nAngband.\n\nTwo years after Morgoth's onslaught abated, the isle of Tol Sirion, held\nby Orodreth brother of Finrod, came under assault by Morgoth's most\nterrible servant, Sauron. His coming caused a dark cloud of fear to grip\nthe hearts and wills of the defenders, and the watchtower of Minas\nTirith upon the isle was taken. This secured for Morgoth the western\npass of the river Sirion. After another five years had passed, Morgoth\nrenewed his assault against Hithlum and very nearly destroyed it.\nFortunately for Fingon, now High King of the Ñoldor, his forces were\nreinforced by a host under the command of Círdan, and the Orcs were\nrepelled.\n\n\nEtymology\n\n_DAGOR BRAGOLLACH_ is Sindarin for 'Battle of Sudden Flame'.",
    "conflict": "The War of the Jewels",
    "date": "FA 455 - FA 456",
    "location": "Thangorodrim",
    "outcome": "A decisive victory for the forces of Morgoth"
  },
  {
    "name": "War of Wrath",
    "lotr_page_id": "862",
    "text": "The WAR OF WRATH, also called the GREAT BATTLE, was the war of Elves,\nMen, Dwarves and Valar against Morgoth at the end of the First Age,\nwhich marked the end of his rule in Middle-earth. It was the largest\nbattle of the First Age and possibly the largest battle ever to have\ntaken place in Middle-earth. It resulted in the expulsion of Morgoth\nfrom Arda and the ruin of the Thangorodrim, but the violence of the\nclashes between the forces of the Valar and Morgoth shattered the\nnorthwestern portion of Middle-earth, Beleriand, and caused it to sink\nbeneath the ocean.\n\n\nHistory\n\nBackground\n\n\n\nBy the early sixth century of the First Age, Morgoth's dominion had\nbecome completely uncontested in Middle-earth. The power of the Elves,\nMen, and Dwarves to resist him had been utterly destroyed, and all the\ngreat kingdoms of the Elves had been overthrown. Morgoth was now master\nof nearly all of Beleriand, save for the havens in Arvernien, which he\ngave little heed to. To make matters worse, and to the great amusement\nof Morgoth, the Sons of Fëanor, seeking the Silmaril of Beren and\nLúthien, had launched two devastatingly brutal Kinslayings in which they\nhad destroyed both Doriath and the Havens of Sirion. In this time of\nneed, the mariner Eärendil, by the guidance of a Silmaril which he wore\non his forehead, searched for and came to Valinor on behalf of Elves and\nMen. There, he begged the Valar to pardon and aid the overmatched\npeoples of Middle-earth.\n\nThe Battle\n\nDespite having pledged to leave the Ñoldor to reap the bitter harvest of\ntheir folly in pursuing Morgoth, Manwë was moved by Eärendil's plea.\nAlong with the Vanyar and the remaining Ñoldor in Aman, the host of the\nValar came to Middle-earth in the mightiest gathering of arms in the\nhistory of Arda. The Teleri of Alqualondë granted the use of their ships\nto ferry the hosts of Aman to Middle-earth, but they remembered still\nthe Kinslaying of their people long ago and harbored much bitterness\nover it. As such, they sent only what mariners were needed to man the\nships, and none of them set foot on Middle-earth once they arrived. The\ngreat force of Aman marched across Beleriand, and met the armies of\nMorgoth in the plains of Anfauglith. Morgoth marshaled the entirety of\nhis forces, which had by this point grown so vast that Anfauglith could\nnot contain their numbers.\n\nThough the war lasted for over 40 years, the host of the Valar utterly\ndestroyed the Orc armies of Morgoth, as well as most of the Balrogs.\nWhile the Three Houses of Men fought alongside the Valar, many other Men\nfrom the East fought for the forces of Morgoth and were either destroyed\nor forced to flee back to the far eastern parts of Middle-earth. Facing\nfinal defeat, Morgoth released his ultimate weapon, the winged Dragons,\nwhich had never been seen before. Their terrible onslaught was\naccompanied by lightning storms and tempests of fire, and they drove the\nValar back and nearly destroyed the host of the West.\n\n\n\nFortunately, Eärendil came with his sky-ship Vingilot, along with the\nEagles of Manwë led by Thorondor. In the skies above Angband, they\nconfronted the dragons, and Eärendil himself slew their captain, the\nmighty Ancalagon the Black, who broke the towers of Thangorodrim in his\nfall. Angband was then leveled and Morgoth was finally captured in the\ndeepest of his mines. He sued for peace and pardon, but he was bound\nagain with the old chain Angainor and the two Silmarils still in his\npossession were taken by the Maia Eönwë, the herald of Manwë. Morgoth\nwas taken to Aman and tried for his crimes. In the end, the Valar\nun-housed Morgoth by beheading him and “thrust him through the Door of\nNight”, beyond the Walls of the World, into the Timeless Void, the doors\nof which are forever guarded by Ëarendil.\n\nAftermath\n\nThe geographical wreckage of the war was immense; most of the land west\nof the Blue Mountains was destroyed and sank beneath the waves. Though\nit is not known exactly how many casualties the Host of the West\nendured, the war dragged on for decades before they managed to approach\nAngband, and the attack of Morgoth's winged dragons was known to have\nbeen nearly catastrophic for the forces of the Valar. While the hosts of\nMorgoth were utterly defeated, the creatures that composed them were not\neradicated, and many (particularly Orcs) remained to trouble the world\nunder the power of Sauron. Additionally, it was noted that a few Balrogs\nfled and hid deep in the Earth, though only one, known by the title of\nDurin's Bane, was ever noted by history to have appeared again. Some\nnumber of dragons, particularly Cold-drakes, also hid themselves away in\nthe mountains. These dragons bred over time, and became particularly\ntroublesome for the Dwarves in ages to come. Nearly all of the winged\nFire-drakes were destroyed by Ëarendil, Thorondor and his Eagles, but\nsome managed to escape, as at least one of the species, Smaug the\nGolden, was known to have been active during the Third Age.\n\nThe remaining Elves were bidden by Ëonwë to return with him to the lands\nof Aman. Most of the Elves went into the West, while others still\nrefused the summons and rather journeyed eastward where they would\nbecome lords of the remaining Eldar or those Elves who still dwelt in\nthe East. Gil-galad, Galadriel, Celeborn, and Elrond were chief among\nthese. Additionally, the victory was made even more bitter by the loss\nof the Silmarils. Maedhros and Maglor, the two surviving sons of Fëanor,\nwere compelled by their oath to recover the gems. Though sick at heart\nat the burden of the terrible oath, they conspired to sneak into the\ncamp of the victorious Host of the Valar, where they slew the guard\naround the Silmarils and took them. The camp was roused against them,\nand though they were prepared to fight to the death to keep the gems,\nthey were permitted to go. But they soon discovered that, due to the\nwicked deeds they had performed in recovering the jewels, first among\nthem the three Kinslayings, they could not hold the Silmarils without\nsuffering terrible pain. And so Maedhros cast himself and the Silmaril\nhe bore into a fiery pit, and Maglor threw his into the Sea. And so both\nwere lost to the Host of the Valar, and they returned to Aman empty\nhanded.\n\nFor those men of the Edain who fought for the host of the Valar, the\nland of Númenor (in the full Quenya form Nùmenórë) was given to them.\nThis land was neither of Aman nor of Middle-earth, but was closer to\nAman.\n",
    "conflict": "The War of the Jewels",
    "date": "FA 545 - FA 587",
    "location": "Ard-galen",
    "outcome": "Decisive but very costly victory for the Host of Valinor and its allies"
  },
  {
    "name": "Disaster of the Gladden Fields",
    "location": "Gladden Fields",
    "lotr_page_id": "2762",
    "text": "The DISASTER OF THE GLADDEN FIELDS or the BATTLE OF THE GLADDEN FIELDS\nwas a battle at the beginning of the Third Age, in which Isildur and a\nretinue of the Dúnedain of Arnor, marching home after the defeat of\nSauron, were attacked by a large group of Orcs from the Misty Mountains.\nThe king and his three eldest sons -- Elendur, Aratan, and Ciryon --\nwere slain and the Ring of Power was lost in the River Anduin. Only\nthree men survived the encounter, but the shards of Narsil were saved by\nOhtar, an esquire of the king. \n\nThe repercussions of the attack were wide-ranging, as Isildur had been\nking of both Gondor and Arnor, and his death left the two kingdoms to\nseparate into isolated realms. Arnor wouldn't be able to completely\nrecover from this catastrophic loss of a considerable part of its nobles\nand knights until the kingship of Aragorn II Elessar of the Elendili in\nthe Fourth Age. However, most importantly, Isildur's death prevented him\nfrom passing on the One Ring to the Keepers of the Three, which he had\ndivulged to his son Elendur to be his chief reason for visiting Elrond\nin Rivendell.\n\n\nHistory\n\nPrelude\n\nAfter that War of the Alliance, Isildur remained in Gondor for a year,\nregaining lost territories, and reorganising the realm. He sent the\ngreater part of the armies of Arnor back to Eriador via the Númenórean\nroad from the Fords of Isen to Fornost. After he was done with arranging\nthe affairs of the southern realm, he delivered the South Kingdom to\nMeneldil and forthwith designed to march to Rivendell. He had left his\nwife and youngest son there, yet he also greatly desired the counsel of\nElrond at that time. It was for this reason that he proceeded from\nOsgiliath into the Vale of the Anduin, and over the Cirith Forn en\nAndrath, which was the high-climbing pass of the Northern Misty\nMountains which led down into the valley of Rivendell. \n\nThe Battle\n\nThe Dúnedain host had traveled northwards from Lórien, marching along a\npath that led to Greenwood the Great wherein Thranduil was king. Their\nroute had been diverted by the flooding of the Anduin, which had\ncompelled Isildur to take the road on the sheer slopes on the eastern\nbanks of the river. King Isildur's party was flanked on its left by\nsteep cliffs overlooking the River Anduin, and to its left, by hills and\na forest.\n\nThe Dúnedain were singing marching songs and generally of good cheer as\ndusk drew close, at which time the lusty men heard the strain of orcs in\nthe forest hills. Isildur organised his retinue into a “Thangail,” a\nshield-wall two men deep and flexible at the flanks; it could be made to\nback up completely so as to form a defensive ring should the unit be\nsurrounded. The Dúnedain could only guess at the strength of the enemy,\nbut they perceived that the orc host was many times, perhaps even 10\ntimes as large as their own. Isildur expressed regret that the orcs\nshould have approached them at such uneven ground, for had it been level\nor rather downhill for the Dúnedain, then they should have formed up\ninto a “Dírnaith”, a wedge formation that could have shattered the\nmiscreant orcs. \n\nThe first orc onslaught came quickly, striking at the center of the\nDúnedain line after a volley of arrows had been fired. At this point,\nIsildur sent for his esquire, Ohtar, to take the shards of Narsil to\nRivendell for safekeeping should the battle go ill. The orcs were\ndiscomfited at no cost among the Dúnedain, all of whom towered above the\ntallest of the orcs. Piles of orcs had gathered before the Dúnedain, and\nthe orcs again kept their distance out of range of the powerful\nNúmenórean bows. Isildur judged that the orcs, in their typically craven\nfashion, were so thoroughly dismayed to be stung so badly in the fight\nthat they would not resume battle, but would rather stalk the Dúnedain\nfrom a distance. The king then resolved to bring his retinue onto lower\nand more level ground, yet the host had not marched more than a mile\nbefore the orcs returned again. Hope faded as the orcs crept towards\nthem in silence and under cover of darkness. In this second attack, the\norcs approached in a full crescent, resolving to pressure the Dúnedain\nat all points in their formation. Men were slain, and the formation\nstarted crumbling. Yet the Men of Númenór did their sires honour, for\nmany died at the cost of five orcs each. Ciryon and Aratan were killed,\nand Elendur convinced Isildur to flee and cross the Anduin if he could,\non whose other side he might find safety and make his way to Rivendell. \n\nThe Route of Isildur\n\nIsildur then cloaked himself with the ring, and sped down into the\nvalley. He made a long journey to the banks of the Anduin, and there\nparted with all of his arms and armour save for a short sword. The river\nwas hard to cross, thus, though rarely equaled in strength and vigour\neven by fellow Dúnedain, Isildur was exhausted when he reached the\nwestern shallows. There, reeds and rushes tangled him and the ring\nabandoned him, slipping from his fingers. Orc prowlers then caught sight\nof the large and imposing figure, and out of fear they shot at him and\nfled quickly, having pierced him in throat and heart. \n\nAftermath\n\nOnly Ohtar, and an unnamed companion; and a stunned combatant and\nesquire of Elendur, Estelmo, had survived the disaster. Isildur's body\nwas never recovered by men, and was secretly presumed captured and\nmutilated at Sauron's command. The orc host which had waylaid the\nDúnedain were quickly scattered by a relief force of woodsmen which\nnone-the-less had come too late to affect the fate of the king's\nretinue. The orc victory had been so Pyrrhic that it would take them\nmany years before they would gather the strength to venture out again in\nthe Vales of Anduin. Estelmo was recovered alive, but stunned from a\nclub's blow, and he told of how Isildur and Elendur had related to each\nother about the One Ring before their deaths. Isildur remarked: “I\ncannot use it. I dread the pain of touching it. And I have not yet found\nthe strength to bend it to my will. It needs one greater than I know\nmyself to be. My pride has fallen. It should go to the Keepers of the\nThree.”\n\nThen, probably the biggest consequences of the Gladden Fields was that\nthe union of Arnor and Gondor was broken by blood, but more importantly;\nthat Isildur never managed to give the Ring of Power to Elrond,\nGaladriel and Celeborn. All of them would have most likely decided to\ndestroy it long before Sauron could have gathered his spirit again and\nrefortified Mordor; in effect destroying the Dark Lord in the same way\nhe was extinguished beyond all hope of recovery by Frodo."
  },
  {
    "name": "Nírnaeth Arnoediad",
    "lotr_page_id": "2433",
    "text": "The NÍRNAETH ARNOEDIAD (“BATTLE OF UNNUMBERED TEARS”) was the fifth\ngreat battle against Morgoth that took place in the First Age.\n\n\nHistory\n\nAlmost twenty years after the defeat of the Elves and their Edain allies\nin the Dagor Bragollach, the Noldor had lost control over the entire\nnorth of Beleriand, and were for the most part reduced to holding on\ndefensively in Hithlum, Himring and Nargothrond. Gondolin was still\nhidden and could not yet be assailed. However, the deeds of Beren and\nLúthien, defeating Sauron at Tol-in-Gaurhoth and retrieving a Silmaril\nfrom Angband, convinced Maedhros that Morgoth was not invincible. In the\nyear 468 of the Years of the Sun in the First Age, Maedhros began\nbuilding an alliance that he believed capable of taking the war to\nThangorodrim, known as the Union of Maedhros.\n\nUnder the command of Maedhros, all the Elves of Beleriand, as well as\nthe Edain, Dwarves, and the newly arrived Easterlings were invited to\ncombine in arms and fight against Morgoth. Unfortunately, the Oath of\nFëanor and the evil deeds done by the Sons of Fëanor to fulfill it\ncaused the Union to have less strength than it could have had. For\nOrodreth, the Lord of Nargothrond, remembering the deeds of Celegorm and\nCurufin that indirectly resulted in the death of Lord Finrod Felagund,\nsent no aid to the alliance. Against Orodreth's will however, a small\ncompany under the command of Gwindor went from Nargothrond. Their hope\nwas to avenge the capture of Gwindor's brother Gelmir during the Dagor\nBragollach. Worse yet, from Doriath there came only Mablung and Beleg,\nwho wished to take part in the great deeds they knew were to come. For\nThingol, King of Doriath, had in his possession the Silmaril recovered\nby Beren and Lúthien, and the Sons of Fëanor sent to him a haughty\ndemand for its surrender. Thingol however, was both insulted by the\ndemand and had begun to lust for the Silmaril. Thus, against the counsel\nof Melian, he refused to surrender it. As a result, Celegorm and Curufin\nvowed openly to destroy Doriath should they emerge victorious from the\nbattle against Morgoth. Therefore Thingol enhanced the guard at his\nborders and sent no troops to aid Maedhros.\n\nThe Union divided its strength into two separate forces to attack\nAngband. Under Maedhros in the east were gathered the remainder of the\nSons of Fëanor, the Elves and Men of Himring under Maedhros and Bór, the\nmen of Amon ereb under Caranthir and Ulfang, and the Dwarves of Nogrod\nand Belegost. Under Fingon in the west were gathered the Elves and Men\nof Hithlum, the Elves of the Falas, the Haladin of Brethil, the\ncompanies sent from Nargothrond and the two Elves of Doriath, Beleg and\nMablung. The plan was for Maedhros's host, the slightly greater of the\ntwo, to march openly across Anfauglith and draw out the main army of\nAngband, after which Fingon's host would attack from the Ered\nWethrin and crush the armies of Morgoth between the two forces. They\nwould then seal the doors of Angband and, hopefully, drive Morgoth\nunderground forever. The Union first cleared Beleriand and Dorthonion\nfrom the Orcs, and then gathered to assault Angband. However, these\nattacks alerted Morgoth to the existence of the Union, and he took\ncounsel against it.\n\nMorgoth learned of the battle plan of the Eldar from his spies, and\nsought to prevent Maedhros's forces from meeting with Fingon's. To that\nend, he sent a gigantic force of his own, one which included Glaurung\nand his numerous fire-breathing brood, to destroy Maedhros's host.\nFingon's troops eventually settled in the woods of Ered Wethrin to await\nthe coming of Maedhros's forces, not knowing that they had been\nattacked. Upon the arrival of Fingon's forces to Ered Wethrin, smoke and\nfire poured forth from Thangorodrim and the Iron Mountains. Fingon thus\nknew that Morgoth had become aware of his forces, and doubt began to\ngrow on him. Just at that moment however, Turgon arrived unexpectedly\nwith an army ten thousand strong from Gondolin, and hope was renewed in\nthe heart of the Elven host.\n\nAware of both the location of Fingon's troops and the strategy the elves\nhoped to employ, Morgoth sent a great force of Orcs from Angband to meet\nFingon's host. In actuality, this force was but a small portion of the\narmies Morgoth had prepared, and was ultimately little more than bait.\nFor Morgoth intended for this decoying force to draw out Fingon's army,\nand then to strengthen it when Fingon came from the hills to meet it.\nBut Fingon, wary of the guile of Morgoth, ignored the taunts of the Orcs\nand kept his forces hidden. Seeing this, the captain of the Orcish host\nsent out riders with tokens of parley. With them was Gelmir, Gwindor's\nbrother of Nargothrond, whom the Orcs had blinded. To provoke the Elvish\nhost, they dismembered Gelmir within sight of the Ered Wethrin and then\nkilled him, threatening to do the same with their other Elvish thralls.\nUnfortunately, Gwindor himself was in the forefront of the Elvish host,\nand he witnessed the cruel murder of his brother. Insane with grief and\nrage, he broke ranks and charged the heralds with the company from\nNargothrond and slew them, driving deep into the center of the Orcish\nhost. Seeing that his troops could not be restrained, Fingon sounded the\ncharge, and committed his entire force to the battle. Here, Morgoth's\ndesigns nearly went astray, for the onset of the Noldor charge was so\nswift and terrible that the Orcish host was destroyed before it could be\nstrengthened. At the forefront of the battle were Gwindor and his\ncompany, and their wrath was so great that they burst through Morgoth's\nouter gates and slew the guard in the very courts of Angband.\n\nIt was said that Morgoth trembled as Gwindor's company pounded upon his\ngates, but surrounded by a sea of enemies they became trapped in the\ncourt, and all were slain except Gwindor who was taken, for Fingon could\nnot come to their aid. Then, from many hidden doors in Thangorodrim,\nMorgoth let forth his main host. Fingon's army was driven back from the\nwalls of Angband with great loss. The Men of Brethil that comprised the\nrearguard were nearly all slain, along with Haldir, Lord of the Haladin.\nThe fourth day of the conflict was the official beginning of Nírnaeth\nArnoediad, and Fingon's forces continued to retreat with their\ncasualties mounting. At the start of the fifth day however, Fingon's\nforces were joined by Turgon, who had withheld most of his troops from\nthe foolhardy assault. The phalanx of Turgon broke through the lines of\nthe Enemy, and met with the guard of Fingon, along with Húrin son of\nGaldor. With Turgon's help, Fingon's forces managed to beat back the\nhost of Angband enough to begin an orderly retreat. \n\nHowever, the fortune of the Eldar then took another turn for the worse.\nFor while Fingon's armies had been fighting Morgoth's forces on the\nplains of Anfauglith, Maedhros had been defeated by the armies that\nMorgoth had sent against his host. To make matters worse, Maedhros had\nbeen betrayed by Ulfang, one of the sons of Uldor, who had summoned a\ngreat force of evil men from the surrounding hills to attack the elven\nhost. Reeling from the unexpected treachery and the continual assault of\nMorgoth's dragons, the eastern host would have been utterly destroyed if\nnot for the valor of the Dwarves of Belegost. For they were naturally\nable to withstand the dragons' fire better than Elves or Men, and\nmoreover they wore great iron masks that gave them additional\nprotection. These dwarves formed the rearguard of the eastern host, and\nallowed the remaining Elves and Men to escape the dragons. Azaghâl, King\nof the Dwarves of Belegost, gathered his forces and formed a ring around\nGlaurung to keep him at bay. Such was their strength and the keenness of\ntheir axes that even Glaurung's armored hide was not invulnerable to\ntheir blows. Enraged, Glaurung struck down Azaghâl and crawled over him,\nbut with his last strength Azaghâl ran a dagger through Glaurung's\nbelly, and the dragon fled in pain. With him fled all the beasts of\nMorgoth. In a solemn ceremony the Dwarves picked up their fallen leader,\nforgetting about the battle, and they marched his corpse home. Their\nwrath was so great that none troubled them. Their sacrifice allowed all\nseven of the Sons of Fëanor to escape, though their host was routed and\nscattered throughout Ossiriand.\n\n\n\nAfter defeating Maedhros, Morgoth's eastern host had made haste to to\njoin the battle against Fingon's forces, and arrived as the elven forces\nhad begun to withdraw. As they engaged the retreating Elves, Gothmog\nhimself arrived on the field with his Troll guard and engaged Fingon in\nsingle combat. The High Elven King managed to hold his own against the\nHigh Captain of Angband until another Balrog restrained Fingon from\nbehind. Gothmog then clove Fingon's head with his Black Axe, and the\nfield of battle was soon utterly lost. Seeing this, Húrin begged Turgon\nto return to Gondolin, and told the King that he and his men would cover\nthe Elven retreat. Huor, Húrin and the remaining Men of Dor-lómin then\nformed a living wall across the Fens of Serech, buying time for Turgon\nto escape with most of the surviving Elves of the north. The warriors of\nDor-lómin were all slain, and Huor fell with his eye pierced by a\npoisoned arrow. Finally Húrin was left to fight alone, wielding the\ngreat axe of an Orc captain two handed. He managed to slay seventy of\nhis foes, including a great number of Gothmog's troll guard, falling at\nlast after his axe withered away from the caustic troll blood upon it.\nGothmog then pulled Hurin out from under the mountain Orcs and Trolls\nthat he slew, bound him, and dragged him to Angband with mockery.\n\n\nAftermath\n\nAfter Nírnaeth Arnoediad, the ability of Elves and Men to make war\nagainst Morgoth was broken. Morgoth's victory was essentially complete,\nas he had destroyed all the people of Hithlum and had scattered the sons\nof Fëanor away from Himring. Morgoth's orcs razed all of Beleriand\nexcept for Doriath, which was still protected by the Girdle of Melian,\nand sacked the havens of the Falas. Nargothrond was also still free, but\nMorgoth gave little thought to either it or Doriath, knowing that the\ntwo remaining Elven kingdoms were no threat to him.\n\nMorgoth betrayed his servants the Easterlings and trapped them in\nHithlum under penalty of death, denying them the fertile lands of\nBeleriand. Still Morgoth knew fear, for Turgon, now High King of the\nÑoldor after the death of Fingon in the battle, had survived, and his\ncity of Gondolin was still unknown to Morgoth. Hoping to discover the\nwhereabouts of Turgon, Morgoth summoned Hurin to him, seeking from him\nthe location of Gondolin. But Hurin mocked Morgoth and refused to betray\nTurgon. Morgoth then laid a terrible curse upon him and his kin, and\nbound Hurin to a chair upon Thangoridrim to witness the curse\nunfold.\n\n\nAn alternate version\n\nA first and older version of the story was drawn by Christopher Tolkien\nprimarily from a text called the _Grey Annals_, although the Quenta\nSilmarillion was used as well. But in the writing of the long Narn i\nChîn Húrin, J.R.R. Tolkien wrote a new version of the battle which\npostdates both the GA and QS accounts. Christopher Tolkien did not\nincorporate the major changes of the new version into the Silmarillion\ntext, although he did take some phrasing and description from it.\n\nIn the earlier version of the battle, Morgoth sent no armies against the\nforces of Maedhros, and instead Uldor delayed Maedhros's host with a\ntreacherous warning of a false assault from Angband. Maedhors eventually\nrealized what he believed to be a mistake on Uldor's part, and his host\nat last arrived to aid Fingon in the fifth day as Turgon's forces did.\nMaedhros's forces assailed the armies of Angband in the rear, and\nMorgoth was forced to release his reserves, including his Balrogs,\nGlaurung and his brood, and Gothmog the Lord of Balrogs. It was said in\nthis version that the Elves might still have won, but Ulfang and his\nEasterlings betrayed Maedhros, and summoned a great strength of evil Men\nfrom the surrounding hills, routing the host of Maedhros.\n\nThe major difference was that Morgoth defeats the Elves much more\nhandily in the newer version than he did in the old one. The entire\nelement of the “Machinations of Uldor” delaying Maedhros's march is\nremoved, and Morgoth sends a second force to meet Maedhros and prevent\nhim from joining with the other elf lords. This version also lacks the\nnearly explicit statement that the Elves could have won had it not been\nfor the treachery of men.\n\nChristopher Tolkien did not venture a guess on why his father made these\nchanges, but it may be that he felt the Elves did much better against\nMorgoth than they reasonably should have (especially given the extreme\nlength and difficulty of the later War of Wrath). This is all\nspeculation, however. It was explicitly stated several times both by\nin-universe characters and Tolkien in the Silmarillion that the Elves\nhad absolutely no chance of defeating Morgoth unaided, so it is possible\nthat the changes were made to concur with this line of thinking.\n\n\nEtymology\n\n_NÍRNAETH ARNOEDIAD_ was Sindarin for 'Tears Unnumbered'.",
    "conflict": "The War of the Jewels",
    "date": "FA 472",
    "location": "Thangorodrim",
    "outcome": "Crushing victory for Morgoth and the Dark Powers"
  },
  {
    "name": "War of the Ring",
    "lotr_page_id": "209",
    "location": "Middle-earth",
    "text": "The WAR OF THE RING was fought between Sauron and the free people of\nMiddle-earth for control of the One Ring and dominion over the\ncontinent. It took place at the end of the Third Age. Together with the\nQuest of Mount Doom, it is one of the overarching plot-lines of _The\nLord of the Rings_.\n\nThe war was initiated by Sauron, who had gained strength since the end\nof the Second Age and sought the One Ring. During the War of the Ring,\nmany thousands of Men of Rohan and Men of Gondor were killed. The\noverall number of combatants in the war is estimated to be over one\nmillion—tens of thousands from the side of the Free Peoples and hundreds\nof thousands from the Evil side. The war also signified the decline of\nthe Elves' power in Middle-earth, the rise of Men in the West, the\nrestoration of the King of Gondor and Arnor and the start of the Fourth\nAge.\n\nBattles were fought in Gondor, Rohan, Lórien, Mirkwood, at the Lonely\nMountain and at Dale. These were primarily waged against Sauron's\nforces, but Saruman, a third contender, also had armies, who fought\nbattles at the Fords of Isen and Helm's Deep.\n\nThe first full-scale battle fought in the war was the first Battle of\nthe Fords of Isen, and the war ended after the Battle of Bywater and,\nshortly afterwards, the deaths of Saruman and Gríma Wormtongue. Towards\nthe end of the War of the Ring, Elessar was crowned King of Gondor, and\nforgave the Men who had fought under Sauron, heralding a great renewal\nof cooperation and communication between Men, Elves, and Dwarves.\n\n\nOrigins of the War\n\nAccording to Mithrandir, the War of the Ring had begun at the\ntime Thorin Oakenshield met Bilbo Baggins in The Shire. Gandalf's\nreasoning is explained in the book _Unfinished Tales_. This is an\nexcerpt from a narrative of Gandalf to Frodo set in a house in Minas\nTirith. “_You may think that Rivendell was out of his reach, but I did\nnot think so. The state of things in the North was very bad. The Kingdom\nUnder the Mountain and the Strong Men of Dale were no more. To resist\nany force that Sauron might send North to regain Angmar were only the\nDwarves of the Iron Hills, and behind them lay desolation and a Dragon.\nThe Dragon Sauron might use with terrible effect._” That is why Gandalf\nthought that he had to get rid of Smaug, and he chanced upon Thorin and\nBilbo at different times, and saw the way to do it, which is told in\n_The Hobbit_.\n\nGandalf's role\n\nGandalf was to the Free Peoples of Middle-earth as a field marshal is to\nhis army fighting on the field—a master strategist and tactician. As\nseen in the opening stages of _The Fellowship of the Ring_ book and\nmovie, Gandalf the Grey would spend many hours, searching, scavenging,\nand sifting out archaic maps and accounts in long-hidden archives strewn\nabout Middle-earth. He would often carefully examine them, figuring out\nthe best way to defeat the Enemy and marshal as many allies as possible\nto his cause.\n\nGandalf likely spent much thought in strategy, before implementing his\nplans to maximum effect. He had been roaming Middle-earth for many years\nduring the Third Age, before Sauron's power was at its apex. He might\nhave had a 'hit list' of targets to neutralize that Sauron might use in\nthe next war upon the Free Peoples. One of these targets was Smaug, as\nseen in _The Hobbit._\n\nGandalf's adaptability and aptitude for strategy proved invaluable to\nhis allies during the complicated web that was to prove to become the\nWar of the Ring. As told in _Unfinished Tales_, Gandalf had known for\nquite a while that Sauron's use of Smaug would virtually guarantee\nvictory over his enemies, namely those of Gondor. He and his Dwarf\ncompanions thus set out to destroy Smaug, and bring the victory of the\nWar of the Ring one step closer for the Free Peoples.\n\nThe Roles of the other Istari\n\nSaruman became the secondary enemy in the War of the Ring, originally\nhaving served the Free Peoples and eventually succumbing to the power of\nthe One Ring.\n\nThe two Blue Wizards, Alatar and Pallando, also served an important role\nin the outcome of the war. Although they weren't directly mentioned in\nthe _Lord of the Rings_, they were enemies of Sauron, and might have\nused the Dark Elves and the Dwarves of the Red Mountains to weaken the\nEasterlings.\n\n\nEvents\n\nSouthern Theatre\n\nThe objective of Sauron's grand strategy was to defeat the strongest of\nthe nations that opposed him, Gondor, and to do so he would need to take\nthe capital city and greatest fortress of Gondor, Minas Tirith. To this\nend, the war effort of Mordor was focused in the south in and around\nGondor, in a strategy of divide and conquer. To keep Gondor's ally\nRohan, on its northern border, from sending aid, Sauron promoted the\nrise of Saruman at Isengard to the west of Rohan. Thus all of Rohan's\nforces would be focused in the west trying to stem the tide of the\nIsengard attack, and none would be sent to Minas Tirith's defence.\nMeanwhile, Sauron sent the Mordor-allied Corsairs of Umbar to attack\nGondor's populous southern coastal fiefs, which as a result sent only a\nfraction of their forces to defend Minas Tirith in northern Gondor,\nwhile the rest stayed on the coasts preparing for the Corsair assault.\nHowever, Sauron's divide and conquer strategy was ultimately foiled and\na united front of Gondor and Rohan's forces faced Mordor.\n\nRohan\n\nThe War of the Ring started in Rohan when Saruman's troops crossed the\nFords of Isen. Théodred, the son of the King Théoden, had mustered his\nforces on the fords in order to launch a surprise attack against the\nenemy. On February 23, 3019 he attacked the vanguard of the Orcs\nmarching out of Isengard. Reinforcements were quickly sent from Isengard\nhowever, and Théodred ordered a retreat. His forces retreated to an\nisland in the fords, but they were soon surrounded and he was killed.\nGrimbold managed to hold the island, but would not have succeeded if\nElfhelm had not come with reinforcements from Helm's Deep. Thus the\nfirst battle of the Fords of Isen ended in victory for the Rohirrim.\n\nNow that the Marshal of the Westmark was dead, Erkenbrand took command\nof the Westfold. He placed Grimbold and Elfhelm at the Fords. However,\nthey were unable to withstand the force of Isengard, and were\nsurrounded. Though they successfully broke through the enemy's lines,\nthey ended up scattered around the Westfold, giving Saruman clear\npassage into Rohan.\n\nMeanwhile, Gandalf drove Gríma Wormtongue out of Edoras and went to\ngather Erkenbrand's scattered forces, advising King Théoden to move to\nthe stronghold of Helm's Deep. The king and his forces arrived\nunmolested, but soon the fortress was surrounded by Saruman's troops.\nAll through the night of March 3rd-4th a combined force of Orcs and Wild\nMen from Dunland besieged Helm's Deep, and despite the efforts of the\nRohirrim (aided by Aragorn, Legolas and Gimli) hope appeared lost.\nBelieving Rohan was lost, Théoden decided to mount a final, suicidal\ncharge against Saruman's forces. Unexpectedly, however, Gandalf arrived\nin the nick of time with Erkenbrand and the scattered Rohirrim, along\nwith a forest of Huorns who had been sent to the battle by Treebeard.\nThe Orcs were trapped and utterly annihilated. The wild Men were taken\ncaptive, however, were freed after swearing an oath of loyalty to Rohan\nand clearing the battlefield of the dead. (The mercy of this act amazed\nthe captives, who had been told by Saruman that the men of Rohan were\ncruel and burned their captives alive.)\n\nDays before, at an Entmoot in Fangorn Forest, the Ents, furious over the\ndestruction Saruman had wrought upon the forest, decided to march on\nIsengard. They were to move up to Isengard and destroy it. By 3 March\nthe destruction was completed, and the command of Isengard was taken by\nthe Ent Treebeard. At Gandalf's request he sent a large herd of Huorns\nto the Battle of Hornburg, to aid the Rohirrim.\n\nGondor\n\nFor over 3000 years, the realm of Gondor had held back the threat from\nthe East. In time, the kingdom declined, and Sauron prepared to swoop in\nfor the kill. Faramir, captain of Gondor, had divided his forces to too\nmany fronts. The two most important of these were in the island citadel\nof Cair Andros and the ruined city of Osgiliath. In a strict sense, the\nWar of the Ring began with the Great Signal from Minas Morgul and the\nanswering signal from Mount Doom, and thus the attack on Osgiliath was\nthe first battle of the war proper. Sauron's two armies obliterated the\nfortresses, and Faramir was forced to retreat to the causeway forts, the\nlast defence against the Morgul forces. Soon these too were destroyed,\nand only Minas Tirith remained.\n\nThe attack soon began, as the Nazgûl hovered above and spread terror and\nconfusion, and siege towers tried to take the walls but were all\ndestroyed. After several repulsed attacks, the Gate of Minas Tirith was\nbroken, and the Lord of the Nazgûl entered. He was the first and only\nenemy to do so. All seemed lost — until six thousand Rohirrim, under\nKing Théoden's command, came and somewhat relieved Gondor's defenders.\nStill, the battle was in doubt until Aragorn arrived with a large force\nout of South Gondor. The joint force of Gondor and Rohan then\nsuccessfully defeated their enemies after an exhausting day of fighting.\nThis battle resulted in the deaths of the Witch-king of Angmar, King\nTheoden, and Denethor, Steward of Gondor.\n\nThe Battle of the Morannon was the final major battle against Sauron in\nthe War of the Ring, fought at the Black Gate of Mordor. The Army of the\nWest, roughly 6,000 strong, led by Aragorn marched on the gate and faced\na vastly larger force as a diversionary feint to distract Sauron's\nattention from Frodo and Sam, who were carrying the One Ring through\nMordor. It was hoped that Sauron would think Aragorn had the Ring and\nwas now trying to use it to overthrow Mordor. Despite the seemingly\nimpossible odds the Army of the West was eventually victorious, for when\nthe Ring was destroyed, Sauron's forces fled or surrendered in dismay.\n\nNorthern Theatre\n\nMordor's war effort was focused in the south against Gondor, but using\nhis outstretched right arm Sauron attempted to flank the lands of the\nFree Peoples through Rhovanion, using orcs and allied barbarian nations\nof Men. In this theatre of the war (which had spread far across\nMiddle-earth) Sauron's primary objective was to use the forces at his\nprimary base of operations in the area, Dol Guldur in southern Mirkwood,\nto defeat Lothlórien, then pass the Misty Mountains (attacking\nRivendell), and wheel around to take Rohan and Gondor from the rear.\nHowever, Dol Guldur had to deal with the threat of the Woodland Realm of\nThranduil, and thus split their forces between the attack on Lothlórien\nand the one on the Woodland Realm. Sauron wanted to use his barbarian\nEasterling allies in a joint attack with the Orcs from Dol Guldur on the\nWoodland Realm, and then have this victorious army link up with the\nother ones attacking Lothlórien and defeat it. However, unfortunately\nfor Sauron a strong and extremely powerful Dwarf nation now existed at\nthe Lonely Mountain thanks to the efforts of Gandalf, as well as the\nDwarves of the Iron Hills and allied Men of Dale. Mordor's Easterling\nallies were tied up fighting the Dwarves of Erebor and Men of Dale,and\nnever linked up with the Mordor forces assaulting the Woodland Realm,\nwhich in turn could not link up with those attacking Lothlórien, and the\nline held.\n\nBridging the gap between the northern and southern theatres of the war\nwas the line of the River Anduin between Lothlórien and Gondor, running\nalong the Rohan border. Orc armies peeling off from the assault on\nLothlórien tried to enter Rohan via this route, while almost its entire\narmy had left to fight at Minas Tirith, but the Ents of Fangorn forest\ncounterattacked and drove the orcs back in a panic, and most if not all\ndrowned while attempting to flee by crossing the river.\n\nDale and the Lonely Mountain\n\nWhen the war began, the Dwarves of Erebor\nrefused to cooperate with Sauron in his hunt for the Ring. And so Sauron\nsent an army of Easterlings to Dale. On March 17 they met the armies of\nthe Dwarves of Erebor (and of the Iron Hills as well) and the Men of\nDale. After three days of fighting, Men and Dwarves were overrun, Dale\nwas sacked and razed to ash (the second, possibly third, time in a\ncentury) and sought refuge in Erebor. The defenses of the Lonely\nMountain were prepared for the battle that would decide the fate of\nnorthern Middle-earth, and possibly even the War of the Ring itself.\n\nThe Easterlings hurled their full force at the allied armies, exploiting\ntheir dreaded heavy infantry force to punch a hole in the Dwarvish and\nMannish lines. A furious melee ensued, evolving into a tempest of fire,\ndead and dying men, and the flash of steel. Both sides took horrendous\nlosses, the Easterlings from the arrows, spears, and rocks cast from the\nLonely Mountain's cliffs, and the Men and Dwarves from the scimitars and\nmaces of the Easterlings. Finally, King Brand of Dale fell before the\ngate of the Lonely Mountain, and King under the Mountain Dáin II\nIronfoot fell as he was defending Brand's body.\n\nThe Dwarves of Erebor had learnt a crucial lesson from the devastation\nof Smaug and the Battle of the Five Armies nearly a century earlier, a\nlesson bought with the blood of loved ones. They fortified all of the\nsides of the Lonely Mountain, preventing the breakthrough of orcs that\nnearly caused the loss of the Battle in the days of Bilbo Baggins and\nThorin Oakenshield. The defenders knew with grim fatalism that there\nwould be no Beorn and no Eagles to save them this time, and they were\nthus determined to fight to the last. The Lonely Mountain was staged to\nbecome the Minas Tirith of the North, a ruthless battle of the will of\nthe defender and the will of the aggressor.\n\nThe invaders from the east constructed siege works, battering rams, and\nassorted siege catapults to bombard their enemies into submission.\nHowever, despite all of their efforts, the great gates of the Lonely\nMountain withstood the tidal wave of invaders from the East. Many Men\nand Dwarves made their escape to Erebor however and were able to\nwithstand the siege of the mountain fastness. When news spread about the\nvictory in the South, the Easterlings became extremely demoralized and\nproceeded to scatter, while the sons of Brand and Dáin let their army\nout of Erebor to break the encirclement.\n\nLothlórien and Mirkwood\n\nOn March 11, Lothlórien was first attacked from Dol Guldur. It was\nattacked two further times, on the 15 and the 22. When the Dark Lord had\nfallen, Celeborn led his army out of Lóerin, and crossed the Anduin. Dol\nGuldur was captured and destroyed by Galadriel.\n\nThranduil of Mirkwood was also attacked from Dol Guldur on March 15\nresulting in the long Battle Under the Trees, in which Thranduil's\nkinfolk won a hard victory. After the destruction of Dol Guldur,\nCeleborn met Thranduil on April 6, and as the shadow had passed, they\ndivided Mirkwood and renamed it Eryn Lasgalen.\n\nThe Shire\n\nAfter the defeat of the Dark Lord, Saruman used the magic of his voice\nto convince Treebeard to release him from Isengard. He travellled to the\nShire, where he replaced Lotho Sackville-Baggins as the Chief under the\nname _Sharkey_. Under his command Ruffian men entered The Shire and\nruined it. They were defeated by Hobbits under the lead of Meriadoc\nBrandybuck and Peregrin Took in the Battle of Bywater on the 3rd of\nNovember. The Hobbits headed to Hobbiton where Frodo ordered Saruman and\nWormtongue to leave the Shire. Wormtongue, however, killed Saruman,\nbefore he himself was killed by the Hobbits and their arrows. With the\ndeath of the wizard Saruman, the War of the Ring finally ended, as did\nthen the Third Age.\n\n\nConsequences and Legacy\n\nThe War of the Ring had great influence on all of the lands of the\nnorthwest of Middle-earth. Most importantly it led to the restoration of\nthe Kingdoms of Arnor and Gondor as the Reunited Kingdom, under King\nElessar Telcontar. The Steward of Gondor was dead, but he was succeeded\nby his son Faramir, who kept the office and was given the title _Prince\nof Ithilien_.\n\nIn Rohan the heir apparent, Théodred, was killed, and, during the Battle\nof Pelennor Fields, King Théoden died as well. He was succeeded by his\nnephew Éomer. In the Glittering Caves at the Hornburg, a Dwarven colony\nwas established, and Isengard was given to the Ents, who filled\nSaruman's pits and reforested the land, renaming it The Treegarth of\nOrthanc\n\nIn Dale, both King Brand and King Dáin II Ironfoot were killed, who were\nsucceeded by their sons Bard and Thorin III Stonehelm. They sent their\nemissaries to the crowning of Elessar, and were in alliance with Gondor\nuntil their Kingdoms ended.\n\nFor the Elves, the final decline had begun. With the destruction of the\nOne Ring, the power of the Three Rings faded, and the kingdoms that had\nbeen preserved by their magic began to fade with them. The bearers of\nthe Rings left Middle-earth, and Lórien was eventually abandoned. The\nElves of Lothlórien who did not depart over the Sea moved east to the\nsouthern third of Mirkwood, below the Narrows, which they named East\nLórien. In Eryn Lasgalen however, Thranduil's rule continued, and they\nhad peace. There was also an Elven colony in Ithilien. Many of the Elves\nof Rivendell departed over the Sea, and by Aragorn's death 120 years\nlater, it was entirely deserted.\n\nIn the Shire life continued as it had prior to the war. It was declared\na free land under the Sceptre of Annúminas, and Men were forbidden to\nenter it. The Westmarch was added to the Shire by King Elessar in SR\n1452.\n\nThe different races of Men that had served Sauron suffered grievously at\nthe hands of what appeared to be booty and loot just begging them to\ncome; much of Harad's army was annihilated on the Pelennor Fields,\nslaughtered by the swords of Gondor and the lances of Rohan. The mighty\nEasterlings hastily retreated back to their homelands after Sauron's\nfall and fought several territorial wars with King Elessar over lands\nnear the Sea of Rhûn, but ceased to be a threat altogether. While they\nwere still a menace, much like a sleeping viper, they never troubled the\nReunited Kingdom again.\n\nOnce the Fourth Age began, the elves stopped having an active influence\non the affairs of Middle-earth, having started fading away ever since\nthe Third Age. Orcs never became a serious threat again, reduced to\nsmall bands of mountain brigands they were never more than a nuisance.\nAll the Nazgûl were killed, with Sauron reduced to a mere shadow of\nmalice. Wars would still be fought by the Reunited Kingdom and Rohan\nagainst the Men that had allied with Sauron, the Haradrim and\nEasterlings."
  }
]