[
  {
    "name": "Half-orcs",
    "lotr_page_id": "8126",
    "locations": "Dunland, Isengard",
    "characters": "Squint-eyed Southerner",
    "skin_color": "Sallow",
    "distinctions": "Saruman bred Half-orcs and Goblin-men who served him.",
    "text": "HALF-ORCS or “GOBLIN-MEN” were spies and warriors used by Saruman during\nthe time he sought power in Middle-earth in the late Third Age.\n\nThey were the servants of Saruman used in the old process of breeding\nUruk-hai. Only once are they mentioned in the books. In _The Two Tower_s\n(“Helm's Deep” chapter, during the Battle of the Hornburg), Gamling, a\nman of Rohan, refers to the army bred by Saruman as _half-orcs_ and\n''goblin-men. ''\n\nFrodo_ _quotes to the Fellowship upon leaving Bree \"_So that's where\nthat southerner is hiding... he looks more than half like a goblin''_\n_referring to the Squint-eyed Southerner, an outlaw from Dunland and\nagent for Saruman selling Pipe-weed.\"_\n\n\nHistory\n\nHalf-orcs were usually the product of the union of Men and Orcs. They\nwere not as wide spread as Uruk-hai, but they were still deadly. It is\nrecorded that Half-orcs came to be by an evil act of sorcery where\nSaruman bred Dunlendings with his Orcs. The evil Half-orcs were the\nresult of this union.The Half-orcs were slant-eyed like orcs, yet as\ntall as men.They worked in the deep caverns of Isengard for years\npreparing for Saruman's conquest of Rohan, forging weapons and armor. It\nis unknown if they were Immortal, or at least longer lived than Men.\nThey were part of the armies of Saruman who attacked Rohan twice in the\nBattles of the Fords of Isen, and of the 10,000 that attacked the\nRohirrim in the Hornburg, where most of them perished at the Battle of\nthe Hornburg, either before the fortress walls or in the Huorn's forest.\n\nThe rest of them were killed in the pits of Isengard, mostly because of\nthe huge flood the Ents made when they descended upon Isengard with\nwrath. Some lived beyond that day of doom and followed Saruman into\nexile, even during the Scouring of the Shire, where they served the\nfallen wizard with others until his last breath. In the Shire, they were\nall killed along with their fellow villains the Ruffians in the Battle\nof Bywater and buried in the Battle Pit."
  },
  {
    "name": "Werewolves",
    "lotr_page_id": "3732",
    "text": "WEREWOLVES were servants of Morgoth, bred from wolves and inhabited by\ndreadful spirits (fallen lesser Maiar or the fëar  of orcs)\nimprisoned in these wolfish forms by Sauron. Unlike werewolves of other\nliterature, the werewolves of Middle-earth do not transform from man to\nwolf at night and their behavior is not influenced by the full moon or\nother lunar cycles.\n\nThey inhabited Tol-in-Gaurhoth, which became known as the Isle of\nWerewolves.\n\n\nHistory\n\nOrigins\n\n The first werewolf was Draugluin at Tol-in-Gaurhoth, and the greatest\nwerewolf after him was Carcharoth, the guardian of Angband, and a\ndescendant of Draugluin as all other werewolves were. The form of the\nwerewolves was first thought of by Sauron, who was their lord, and took\nthe shape of a great wolf himself at least once.\n\nGandalf suggests in his talks with Frodo after the Ford of Bruinen that\nwerewolves survived into the Third Age, and makes a distinction between\nthem and wargs. The latter, though, might simply be descended from\nwerewolves, as they could speak, suggesting they had fëar (souls).\n\n\nCharacteristics\n\nThe werewolves of Middle-earth were not shape-shifters, and were always\nin the form of great beasts. The fangs of Carcharoth were venomous,\nthough it is not known if all werewolves had venomous fangs.\n\nWerewolves are similar to wolves and wargs, and were quite large even\ncompared to wargs. Known to be stronger and faster than the famous warg\nrace, they were also as intelligent as a mortal man, which made them\ncapable of negotiating and communicating with others. Thus they were\nable to speak the Black Speech, Westron, and the Elvish languages.\n\n\nEtymology\n\nThe name _werewolf_ appears to have been chosen because they were in\nessence sapient (but evil), and thus had a status similar to men rather\nthan beasts — the word \"_were\"_ in the word _werewolf_ being from the\nAnglo-Saxon word _were_, meaning man, so the term werewolf can be\ntranslated to man-wolf. They were known by the Elves of their time as\n'gaurhoth'.",
    "languages": "Black Speech, Westron, and Elvish[_citation\\ needed_]",
    "characters": "Carcharoth, Draugluin",
    "distinctions": "Large, powerful, fast",
    "height": "Varies",
    "hair_color": "Black",
    "locations": "Angband, Tol Sirion"
  },
  {
    "name": "Huorns",
    "lotr_page_id": "914",
    "text": "HUORNS were the dreadful,\nliving race of ancient, slow-moving trees, whom the Ents cared for and\ntended to in the Second and Third Ages.\n\nIn Middle-earth, they were known to dwell in the Old Forest and in\nFangorn Forest.\n\n\nHistory and Origin\n\nAmong the most ancient of the Olvar that lived within Arda were the\ntrees of the Great Forests that came from the seeds that Yavanna devised\nduring the Age of the Lamps. For many ages they grew peacefully, but in\nMiddle-earth at the beginning of the Ages of the Stars there came among\nthe trees great spirits later known as Ents. These protectors appeared\nbecause many other races in that time came into the world and Yavanna\nfeared that the forests would be destroyed. So through the Ages of the\nStars and Sun, the Ents walked the forests, and in time it is said some\nEnts became more tree-like and the ancient trees became more Ent-like\nand limb-lithe. Like Ents, they learned the Art of Speech. Whether tree\nor Ent in the beginning, by the Third Age of the Sun they were a race\napart, referred to as _Huorns_.\n\nThe Huorns mostly stood as dark trees in the deepest forests, gnarled\nand unmoving, yet watchful. When aroused in wrath they moved swiftly as\nif wrapped in shadows, falling on foes with deadly and merciless\nstrength.\n\nThe tale of the War of the Ring tells of how, with the Ents, the Huorns\nmarched on Isengard like a great forest, and how, under the direction of\nthe Ents, they exterminated the entire Orc legion in the Battle of the\nHornburg.\n\nHuorns were ancient and long-brooding, and some were said to be\nblack-hearted and rotten. At least one such sentient tree spirit\ninhabited the Old Forest by the banks of the Withywindle River, who was\ncalled Old Man Willow. As the Old Forest and Fangorn were the last\nremnants of the most ancient forests in Middle-earth, Old Man Willow\nwished to prevent further inroads into his realm. He held all the Old\nForest in an enchantment by the power of his song and led all travellers\nto him, where with his limb-lithe roots and branches he consumed them.\n\nIn _The Two Towers,_ the Huorns are witnessed to march to Isengard with\nthe Ents. After Isengard is harrowed of its orcs, most of the Huorns\nchased and killed them after the Battle of the Hornburg. After this\nbrief appearance, the Huorns went back into the forests. The tactics\nused by the Huorns were quite effective, as they only attacked when all\nthe enemy Orcs would be in their midst, denying the orcs chance of\nescape. It is notable that Huorns seemed to have the ability to cloak\nthemselves in shadows, becoming almost undetectable at night.",
    "origins": "Trees and Ents",
    "locations": "Fangorn Forest, Old Forest",
    "characters": "Old Man Willow",
    "distinctions": "Semi-sapient, tree-like creatures"
  },
  {
    "name": "Giants",
    "lotr_page_id": "10408",
    "text": "GIANTS were a mysterious race that lived in\nthe Misty Mountains and North Moors of Middle-earth.\n\n\nHistory\n\nThe origins of Giants are unknown, as is the exact time they began\nappearing in the Middle-earth; however, it seems that they entered the\nhistory of the peoples of Middle-earth in the Third Age.\n\nIn _The Hobbit_\n\nIn _The Hobbit,_ Stone-giants are described as hurling rocks at one\nanother as in a game, during a violent thunderstorm. Their physical form\nwas not described, nor was much else about them.\n\nGandalf used to tell stories to Bilbo when he was young at parties about\ndragons, goblins, giants, and rescue of princesses, and the luck of\nwidow's sons. During the riddle game Bilbo thought of all the giants and\nOgres he had heard of in tales.\n\nAt one point Bilbo saw a rock in a stream, and wondered if it had been\ncast miles into the plain by some giant among giants. He also\ncompared being struck like the crash of battering-rams made of forest\noaks and swung by giants.\n\nGandalf later remarked that he would like to find 'a more or less decent\ngiant' to block several of the orc caves.\n\nIn _The Lord of the Rings_\n\nGiants of the type mentioned in the _Red Book of Westmarch_ are not so\nmuch as mentioned in the'' Lord of the Rings'' trilogy. It is believed\nthat as Tolkien expanded the Middle-Earth cosmology, he simply dropped\ngiants from it.\n\nEarlier versions\n\nIn some of Tolkien's earliest writings giants were among the Úvanimor,\nor monster-folk, that were bred in the earth by Melkor (called _Melko_\nin the early tales) along with monsters, Nauglath (wicked dwarves), and\nogres.\n\nTwo giants are given names in _The Book of Lost Tales Part Two_: Gilim\nand Nan. In addition some of Tolkien's other material there was Wade\n(who may be or have been based on a sea-giant of legend) and Noroth,\nsaid to be a giant.\n\nDuring the development of _The Hobbit_, an early draft described more\ntraditional human-like giants;\n\n  ...rescued so many princesses, earls, dukes, widow’s sons and fair\n  maidens from unlamented giants...\n\nHowever, this was edited to Gandalf telling stories of '...giants and\nthe rescue of princesses' in the final published version.\n\nThere may be a loose connection between the giants described in _Farmer\nGiles of Ham_ and references to generic fairy tale giants mentioned in\nHobbit tales. Farmer Giles giants are described as rude and uncultured\nfolk, and troublesome at times, and being as large as elms and\nstupid. In Tolkien's earliest drafts for _The Lord of the Rings_, he\nwrote;\n\n  'Trolls and giants were abroad, of a new and more malevolent kind, no\n  longer dull-witted but full of cunning and wizardry.'\n\nIn the published editions, the words 'and giants' were removed.",
    "distinctions": "Thick, rocky, massive, powerful, ancient",
    "height": "Gigantic; more than 100 feet",
    "locations": "Misty Mountains"
  },
  {
    "name": "Undead",
    "lotr_page_id": "9670",
    "locations": "Barrow-downs, Dwimorberg, Harrowdale",
    "distinctions": "Dead beings who could still interact with the living.",
    "characters": "The King of the Dead, Witch-king",
    "other_names": "Wights, Ghosts, Dwimmerlaik",
    "text": "“UNDEAD” refers to dead beings who could still interact with the living.\nBy the Third Age, the Rohirric word “DWIMMERLAIK;” meaning “Spectre” or\n“Work of Necromancy”, was used as a catch-all term.\n\n\nTypes\n\n-   BARROW-WIGHTS were evil spirits inhabiting the tombs of the\n    Barrow-downs. They often possessed the grave-gifts and bones of\n    those entombed there, making them similar to the animate skeletons\n    of other works.[]\n-   GHOSTS (the ARMY OF THE DEAD, specifically) are the souls of the\n    dead who are prevented from reaching their final rest. The largest\n    concentration were the dead warriors who betrayed Isildur and were\n    cursed, haunting the mountain until Aragorn persuaded them to fight\n    for him. Their faces often shift from skeletal frames to pasty\n    shadows of themselves. Gorlim the Unhappy might be considered one\n    too.\n-   NAZGÛL or Ring-Wraiths: Formerly Kings of Men, the nine rings gifted\n    to them by Sauron caused them to become ghost-like []Wraiths. They\n    cannot see properly, and rely on smell and hearing. The Nazgûl carry\n    daggers known as Morgul-blades meant to break off in the wound,\n    which can turn the afflicted into a wraith. Frodo was stabbed by one\n    at Weathertop. However, it is mentioned that Nazgul are not properly\n    undead.\n-   WRAITHS were humans (Dwarves had natural resistance) who come into\n    possession of a Ring of Power and wore it too long, or were stabbed\n    by a Morgul-blade. They were permanently invisible, and more or less\n    immortal.\n-   PHANTASMS were delusions and/or spirits or fallen Maiar and\n    therefore not truly undead. Morgoth and Sauron used them for their\n    treachery. It is said Saruman also used them.\n-   '''Lingerers '''are elves whose bodies have been consumed by their\n    fëa. To men, they are indistinguishable from bodiless spirits. These\n    elven spirits are not really undead, because they were never dead to\n    begin with.\n-   “THE HOUSELESS” were ghosts of slain elves who were evil, hateful or\n    otherwise sinful in life and defied the call of Mandos. These elven\n    ghosts had the unique ability to possess living things; most often\n    they desired to steal the bodies of Men to become material again,\n    but according to some, they also could possess anything alive. Old\n    Man Willow may have been possessed by one of the Houseless.\n\nThere may also have been some form of undead residing in the Dead\nMarshes\n\nThere are many of these fearsome creatures in the Barrow-downs where the\nWitch-king of Angmar himself went when he was looking for the One Ring\nin The Shire. For his evil presence, the ancient spirits were raised\nagain killing people with their ceremonial swords and bringing the\nterror with them."
  },
  {
    "name": "Great Eagles",
    "lotr_page_id": "11640",
    "characters": "Thorondor, Gwaihir, Meneldor",
    "text": "The GREAT EAGLES were beings of Arda said to have been “devised” by\nManwë Súlimo, the leader of the Valar, and were often called the EAGLES\nOF MANWË. They were sent from Valinor to Middle-earth to keep an eye on\nthe exiled Ñoldor, and also upon their foe the evil Vala Morgoth, and\nlater yet upon Morgoth's lieutenant and future Dark Lord, Sauron.\n\n\nHistory\n\nFirst Age\n\n\n\nThe Great Eagles were the messengers and spies of the King of Arda, and\npossessed the ability to see through all physical matter except for the\nblackness of Morgoth's evil pits. Morgoth first discovered the limits\nof their sight prior to the fall of the great stronghold of Utumno.\n\nFor a time the King of the Eagles, Thorondor, kept his eyries at the top\nof Thangorodrim, the three mighty peaks that Morgoth raised from the\nIron Mountains above the gates of Angband. While they lived there,\nThorondor helped Fingon rescue Maedhros. Thorondor's folk later\nremoved their eyries to the Crissaegrim, part of the Echoriath about\nGondolin. There they were friends of Turgon, and kept spies off the\nmountains.\n\nThorondor wounded Morgoth in the face after Morgoth's battle with\nFingolfin, and carried Fingolfin's corpse to the Echoriath, where Turgon\nburied him.\n\nThe Great Eagles fought alongside the army of the Valar, Elves and Edain\nduring the War of Wrath at the end of the First Age.\n\nSecond Age\n\nIn the Second Age, a pair of Eagles had an eyrie in the King's House in\nArmenelos, the capital of Númenor, until the Kings became hostile to the\nValar. The Eagles also watched the peak of Mount Meneltarma, and three\nEagles would always appear when someone climbed to the summit.\n\nTowards the end of Númenor, the Valar sent storm clouds in the shape of\nGreat Eagles in an attempt to warn them of their folly and impending\ndoom.\n\nThird Age\n\n\n\nIn the Third Age, Thorondor's descendants Gwaihir and Landroval lived in\nan eyrie to the east of the Misty Mountains in Wilderland.\n\nThese Eagles helped the Elves of Rivendell and Radagast in watching the\nland and in gathering news about the Orcs.\n\nIn _The Hobbit_, no eagles were identified by name. Only the title Lord\nof the Eagles distinguished the eagle leader from other eagles in this\nstory. Many readers assume that it was Gwaihir and Landroval who\nrescued Thorin Oakenshield and Company from a band of Wargs and Goblins,\nflying them to the river Anduin, and later assisting in the Battle of\nthe Five Armies fought near Lonely Mountain. However, in Return of\nthe King Gandalf says that Gwaihir has carried him twice before, while\nthe proper count would be three times if Gwaihir and the _Lord of the\nEagle_s were the same individual.\n\n\n\nBefore and during the War of the Ring, Gwaihir rescued Gandalf the Grey\nfrom the top of Isengard—having been dispatched by Radagast—and again\nfrom Zirak-Zigil. The Eagles aided troops of King Elessar at the\nBattle of the Morannon at the Black Gate. The Eagles arrived in time to\noverthrow some Nazgûl, including Khamûl. Gwaihir, with others of his\npeople, rescued Frodo Baggins and Samwise Gamgee from Mount Doom in\nMordor after the One Ring had been destroyed.\n\n\nNotable Great Eagles\n\n-   Thorondor\n-   Gwaihir\n-   Landroval\n-   Meneldor\n\n\nNames\n\nThe Elves have various names for the Eagles, including the Sindarin\n_thoron_ or _thorn_ and the Quenya _soron_.",
    "languages": "Westron, Quenya, Sindarin, Valarin",
    "lifespan": "Immortal",
    "distinctions": "Tall, gigantic, agile, graceful, courteous, fair, capable of speech",
    "height": "Huge, possibly larger than 100'",
    "locations": "Taniquetil, Crissaegrim"
  },
  {
    "name": "Great Spiders",
    "lotr_page_id": "29188",
    "text": "The_' Great Spiders_', also known as the CHILDREN OF UNGOLIANT, were a\nrace of oversized and sentient arachnids that lived in Middle-earth,\nparticularly in dark and perilous places affected by the power of the\nShadow.\n\n\nDescription\n\nThe Great Spiders could speak to one another, though only those imbued\nwith the power of (or derived from) the Ainur could understand them.\nLike Orcs and Goblins, Great Spiders were known to detest light, yet\nthey thirsted for it and sought to devour it. Great Spiders comprise\nthree separate known species.\n\nGiant Spiders\n\nGiant Spiders were a sentient race of Great Spiders that lived in\nMiddle-earth. They lived in the South of Middle-earth in the First Age,\nbut by the Third Age they had spread to other areas. They were descended\nfrom the spider-creatures of the Ered Gorgoroth. Giant Spiders infested\nthe great forest of Greenwood the Great after the shadow of Sauron fell\nupon it and it became known as Mirkwood.\n\nUmaiar spiders\n\nThe Umaiar spiders, a subspecies of Umaiar (and by extension a\nsub-subspecies of Maiar), which included Ungoliant. There are those\nMaiar who took the form of giant spiders upon joining Morgoth. Apart\nfrom Ungoliant (who died by devouring herself), the fate of this race is\nunknown.\n\nSpawn of Ungoliant\n\nThe Spawn of Ungoliant are the third race of Great Spiders. This race\nwas spawned by Ungoliant after she fled to the South. She mated with and\ndevoured the mortal giant spiders who lived there. Because they were\nhalf Umaiar, these spiders were immortal; they were bigger, stronger and\nsmarter than their mortal kin.\n\n\nHistory\n\nThe first Dark Lord, Melkor, used Ungoliant to help him destroy the Two\nTrees of Valinor and steal the Silmarils. Ungoliant, who had an\ninsatiable desire to devour light, asked for the Silmarils to be given\nto her. Melkor refused and she attempted to kill him. Ungoliant was\nsubsequently driven off by Melkor's Balrogs, and she ultimately wandered\nacross Middle-earth, consuming anything that gave off light, such as\ngemstones; and often mated with other large spiders. Her offspring were\na great bane on the world in later years. She was described as\nsurrounded by “an aura of darkness”. Her fate is unknown, but it is said\nthat, always hungry, Ungoliant ended by devouring herself.\n\n[The Mirkwood spiders]\n\nThe Hobbit Bilbo Baggins, and his thirteen Dwarf companions encountered\ngiant spiders in Mirkwood forest on their Quest to the Lonely Mountain.\nOnly Bilbo's magic ring and an Elven blade (_Sting_) allowed them to\nescape being eaten.\n\n[Frodo caught in Shelob's web, as depicted in the film.]\n\nFrodo Baggins and Sam Gamgee encountered Ungoliant's daughter, Shelob,\nin her lair as they were trying to enter Mordor during their quest to\ndestroy the One Ring. Frodo was ambushed by the spider twice, and was\nparalyzed by her poison on the second encounter. Sam used _Sting_ to\nattack Shelob and wounded her, forcing her to flee the scene. It is\nunknown whether she died from her wounds.\n\n\nInfluence of spiders in Tolkien's life\n\nContrary to popular belief, the reason that Tolkien featured spiders so\nprominently in his stories was not because he was bitten by a tarantula\nwhen he was young, but rather because his son was afraid of them.\nBecause of his son's arachnophobia, they are portrayed negatively,\nalways appearing as antagonists.\n\n _The Silmarillion_, _Quenta Silmarillion_, Chapter VIII: “Of the\nDarkening of Valinor”\n\n _The Silmarillion_, _Quenta Silmarillion_, Chapter IX: “Of the\nFlight of the Noldor”\n\n _The Hobbit_, Chapter VIII: “Flies and Spiders”\n\n _The Lord of the Rings_,'' The Two Towers,'' Book Four, Chapter IX:\n“Shelob's Lair”\n\n _The Lord of the Rings_, _The Two Towers_, Book Four, Chapter X:\n“The Choices of Master Samwise”",
    "languages": "Westron, Black Speech",
    "characters": "Ungoliant, Shelob",
    "distinctions": "Gigantic, dark, arachnid-like traits, lethal, venomous, , Capable of speech",
    "height": "Massive",
    "locations": "Mordor, Mirkwood, Shelob's lair, Dol Guldur, Nan Dungortheb, Gorgoroth"
  },
  {
    "name": "Wizards",
    "lotr_page_id": "2933",
    "distinctions": "Beings outwardly resembling Men but possessing much greater physical and mental power.",
    "text": "The WIZARDS, initially known as the ISTARI, were five Maiar spirits sent\nto Middle-earth as human forms to aid the Free Peoples against the\nthreat of Sauron.\n\n\nHistory\n\nIn the Undying Lands around TA 1000, Manwë became aware that the spirit\nof Morgoth's most dedicated lieutenant Sauron was rising in power again,\nand summoned a council of the Valar to send three messengers to\nMiddle-earth to protect the free peoples and assure them the Valar had\nnot forgotten them. Two Maiar came: Curumo (or Curunir; later known as\nSaruman) sent by Aulë, and Alatar (Morinehtar), sent by Oromë. Manwë\nasked where Olórin (later known as Gandalf) was, and he came, after\nreturning from a journey. Manwë asked Olórin if he would go as the third\nmessenger. Olórin said he was too weak and that he was afraid of Sauron;\nhowever, Manwë said that was all the more reason to go, and that he\ncommanded Olórin to go as the third. Then Varda said, “Not as the\nthird.” Yavanna begged Curumo to take Aiwendil (Radagast), and Alatar\ntook Pallando (Rómestámo) as a friend. They were forbidden to dominate\nthe free peoples of Middle-earth or to match Sauron's power with power.\nWhen Saruman, the greatest of the Wizards, disobeyed this injunction, he\nwas cast from the order and banished from ever returning to Valinor.\n\nThe Wizards were known by various names and were arrayed in different\ncolors. Of those who came to Middle-earth, sent by the Valar, five are\nknown, the Heren Istarion (Order of Wizards). After arriving in\nMiddle-earth, the two Blue Wizards apparently went east before the War\nof the Ring; whether they played a part in the events of that war is\nunknown. (Note: _According to Tolkien's letters they may have formed\ncults for magic worship and practice among the Easterlings._) Radagast\nthe Brown concerned himself mainly with plants and animals and lived in\nMirkwood for many years. Saruman the White and Gandalf the Grey spent\ntime with the Free Peoples: the Elves, Dwarves, and Men. Saruman was\nwise and respected and became head of the White Council in TA 2463.\nHowever, he became prideful and jealous of the potential and purity of\nspirit of Gandalf, who would eventually surpass him in power. Saruman\nslowly came to betray the original purpose of the Wizards and sought\npower for himself. He was overthrown during the War of the Ring, by his\ntormented servant, Grima Wormtongue. Grima slit Saruman's neck after a\nfailed attempt to rule the Shire. Saruman's spirit looked to the West\nand Valinor but was blown away.\n\nAt the end of the Third Age, the Wizards passed from sight; since, with\nthe fall of Sauron, their work was done. Gandalf passed over the Sea\nwith the Last Riding of the Keepers of the Rings. Saruman became a naked\nspirit and wandered Middle-earth forever since he was banished from\nValinor. Radagast stayed in Middle-earth, tending to the wilderness. The\nfate of the Blue Wizards is unknown.\n\n\nAppearance\n\nThe wizards bore the forms of old Men; they were ancient and seemed to\nage very slowly. They possessed the great skill of body and mind; the\ngreater portion of their power as Maiar resided in their staffs. Each of\nthe Istari had his color and grade within the Order. Saruman the White\nwas the eldest and Gandalf the Grey second. The other Istari was\nRadagast the Brown and the two Blue Wizards, who dwelt far in the east.\n\n\nEtymology\n\n_Istari_ is a Quenya word (singular _Istar_). The Sindarin\ntranslation is ''Ithryn ''(singular _Ithron_).\n\n\nNamed wizards\n\n-   CURUMO, the White Wizard, was more commonly known as SARUMAN.\n    However, after being seduced by the evil power of Sauron, Saruman\n    became the Many-Coloured Wizard.\n    -   Saruman (human form) was killed by Gríma Wormtongue following\n        the Battle of Bywater, and Gandalf returned to the Undying Lands\n        in TA 3021. However, the fates of the three other Istari are\n        relatively unknown. Alatar and Pallando disappeared in the east,\n        while Radagast stayed in Middle-earth until at least TA 3018.\n\n&nbsp;\n-   OLÓRIN, the Grey Wizard, was more commonly known as GANDALF.\n    However, after dying at the hands of a Balrog, Durin's Bane, Gandalf\n    was reborn as the new White Wizard.\n\n&nbsp;\n-   AIWENDIL, the Brown Wizard, was more commonly known as RADAGAST.\n    Radagast was a lover of nature and so did not play any major part in\n    the War of the Ring except for announcing to the Great Eagles that\n    Gandalf was at the Orthanc with Saruman.\n\n&nbsp;\n-   ALATAR AND PALLANDO, the Blue Wizards, little is known about them,\n    although Gandalf suspected they may have founded a few magical cults\n    in the east, it is not expressed why he thinks this, although\n    perhaps he noted some strange similarities of knowledge from Maia\n    and knowledge of those cults/teachings (_Note: Later in his life,\n    Tolkien wrote a note, suggesting that the names of the Blue Wizards\n    were Morinehtar and Rómestámo. It is not clear whether these names\n    were intended to replace the names Alatar and Pallando, or whether\n    Morinehtar and Rómestámo were alternate names for the Blue Wizards,\n    possibly those given to them by the peoples of Middle-Earth_).\n\n  The Wizards\n  ------------------- ------------------------------ ----------- -----------------\n  Middle-earth name\n  Saruman\n  Gandalf\n  Radagast\n  Morinehtar\n  Rómestámo",
    "other_names": "_Istari_",
    "origins": "Maiar sent to Middle-earth",
    "locations": "Middle-earth",
    "lifespan": "Immortal",
    "characters": "Saruman, Gandalf, Radagast, Blue Wizards"
  },
  {
    "name": "Maiar",
    "lotr_page_id": "312",
    "text": "The MAIAR (the singular of which is MAIA) were nearly-primordial spirits\nthat descended into Arda to help the Valar first shape the World. They\nwere supposed to be numerous, yet not many were named. Their chiefs were\nEönwë, banner-bearer and herald of Manwë, and Ilmarë, the handmaid of\nVarda.\n\nFive of these spirits, in the Third Age, were the incarnated Wizards.\n\n\nHistory\n\nEach of the Maiar is associated with one or more particular Vala, and\nwere of similar stock, though less powerful. For example, Ossë and\nUinen, as spirits of the sea, belonged to Ulmo the Sea-King, while\nCurumo (known in Middle-earth as Saruman) belonged to Aulë the Smith.\nOthers included Mairon (originally also of Aulë, known in Middle-earth\nas Sauron), Aiwendil (known in Middle-earth as Radagast), who belonged\nto Yavanna the Fruit-Giver, and Olórin, (known by the Elves as\nMithrandir but came to Middle-Earth as Gandalf), who belonged to Manwë\nthe Wind-King and Varda the Star-Queen. Gandalf's ways took him often to\nthe house of Nienna the Weeper, and from her he learned pity and\npatience, which perhaps aided him in his later struggles to unite the\nFree People of Middle-earth against the power of Sauron.\n\nAlatar and Pallando, later known as the Blue Wizards, travelled to the\nEast, never returning to the West; their fate is unknown, though Tolkien\nwrote that they had probably also failed in their mission, but\nestablished cults in the East. The Balrogs (_Valaraukar_ in Quenta) were\nassociated with Melkor, and were his most trusted and terrible servants.\nMelian served both Vána and Estë.\n\nThe Sun and Moon are also piloted by Maiar: Arien, a spirit of fire\nuncorrupted by Melkor, was chosen for her radiant beauty and fierce\ndevotion to the workings of the Valar, was chosen to guide the sun,\nwhile Tilion, a hunter in the company of Oromë, was chosen to steer the\nmoon.\n\n\nCharacteristics\n\n\n\nMaiar, like Valar, do not array themselves in a fixed form, but can\nfreely change their form. Olórin, or Gandalf, walked among the several\npeoples of Middle-earth in an uncertain form for many years before being\nsent on the errand of the Valar as one of the _Istari_.\n\nAlso like Valar, however, this power can be lost when that power is\nspent in hate and mockery, Sauron, following the dark trails blazed by\nMelkor, took upon the form of - and remained - the Dark Lord in the\nSecond Age. And yet, Maiar retain their immortality. From all\nindications, when the physical body of a Maia is destroyed, their spirit\nwanders houseless and their power diminished, until they are either able\nto take a physical form once more, or are restored by their\ncorresponding Valar. Examples of this can be seen in the threat of\nLuthien to Sauron upon his defeat at the Tower of Werewolves, whereby it\nis said:\n\n_“Ere  spirit left its dark house, Luthien came to him and\nthat he should be stripped of his raiment of flesh, and his ghost sent\nquaking back to Morgoth; and she said 'There everlastingly thy naked\nself shall endure the torment of his scorn, pierced by his eyes, unless\nthou yield to me the mastery of thy tower.'”_\n\nFurther example includes the resurrection of Gandalf after he and the\nBalrog of Moria were both slain, one by the other, on the mountain peak\nof Zirakzigil:\n\n“_Naked I was sent back – for a brief time, until my task is done. And\nnaked I lay upon the mountain-top. There I lay staring upward, while the\nstars wheeled over, and each day was as long as a life-age of the\nearth._”\n\nIt is not clear how, or what, restored Gandalf, though it can be\ninferred that Manwë played some role in it. It was Manwë, after all,\nthat sent the Istari on their errand to check the power of Sauron in\nMiddle-earth; therefore, by Gandalf declaring that he was sent back\n“until  task is done”, indicates some level of Manwe's involvement;\nor as argued by some it was the direct intervention of Eru Ilúvatar that\nbrought about Gandalf's return.\n\n\nPowers and Abilities\n\nLike most of the Ainur, the abilities and powers of the Maiar remain\nunknown and presumably diverse. Given the nature the Maiar were to aid\nthe Valar in the shaping of the world; they presumably have considerable\npower to augment the world around them. Maiar, as primordial spirit\nbeings, are functionally immortal and essentially immune to the ravages\nof time, even from physical destruction they remain in spirit form.\n\nBeing of divine origin, they can shapeshift if they so choose. They\nwander the world unseen or shape themselves in any fashion, be they\nElves or other creatures; called ''“Fanar” ''in Quenya could be\ndestroyed but their being not extinguished.\n\nIt is suggested that the Maiar, in their service to the Valar in shaping\nthe world, presumably had the ability to manipulate the elements and\nenergies like their Valar counterparts. They were able to be given a\nphysical body again over time or with help with the Valar. Presumably\nthe Maiar possessed the abilities to perform Magic, thus being able to\nperform blessings, spells, curses, exorcism, etc.\n\nGiven the vastness of the universe and the ability of the Maiar to\noccupy such points, they are capable of teleporting vast distances. By\ntaking the form of a flying creature like vampires, bats, birds etc. the\nAinur were able to fly.\n\n\nNamed Maiar\n\n-   Alatar (Morinehtar)\n-   Aiwendil (Radagast)\n-   Arien\n-   Curumo (Saruman)\n-   Eönwë\n-   Durin's Bane\n-   Gothmog\n-   Ilmarë\n-   Mairon (Sauron)\n-   Melian\n-   Olórin (Gandalf)\n-   Ossë\n-   Pallando (Rómestámo)\n-   Salmar\n-   Thorondor (speculation)\n-   Tilion\n-   Uinen\n-   Ungoliant (speculation)",
    "languages": "Westron, Sindarin, Quenya, Teleri, Mannish, Valarin, Black Speech",
    "characters": "Eönwë, Ilmarë, Ossë, Uinen, Sauron, Gandalf, Gothmog, Melian",
    "lifespan": "Immortal",
    "distinctions": "Tall, wise, fair, powerful",
    "height": "Varies",
    "skin_color": "Varies",
    "hair_color": "Varies",
    "locations": "Aman, Middle-earth"
  },
  {
    "name": "Half-elven",
    "lotr_page_id": "2675",
    "text": "The HALF-ELVEN or _PEREDHIL_ were people of Middle-earth, the name of\nwhom was primarily applied to Elrond and Elros in the Second and Third\nAge, but also to Eärendil and his wife Elwing before them. They were\ncalled so because of their extremely mixed Edain (Human) and\nEldarin (Elven) blood. At the end of the First Age they were given a\nchoice to be Elven and immortal, or to be of the race of Men and accept\nthe Gift of Men which is death.\n\nOthers who are also considered Half-elven were Elrond's sons Elladan and\nElrohir, and Elrond's daughter Arwen Undómiel. They, like the other\nHalf-elven before them, were given the choice of mortality.\n\n\nHistory\n\nThe First Age\n\nTwo important marriages in the First Age of Middle-earth resulted in the\nmixing of elvish and mortal Edain blood.\n\nThe first of these was between the mortal Beren of the House of Bëor and\nhalf-elf/half-maia Lúthien, daughter of the elf Thingol, the King of\nDoriath and High King of the Sindar and his Queen Melian the Maia. Beren\ndied in the quest for the Silmaril, and in despair, Lúthien's spirit\ndeparted her body and made its way to the Halls of Mandos. Mandos\nallowed them a unique fate, and they were re-bodied as mortals in\nMiddle-earth, where they dwelt until their deaths.\n\nTheir son Dior was thus one-quarter elvish by blood, although since he\nwas born after their embodiment, the nature of his mortality is quite\nunclear. He died young in any case, when the Sons of Fëanor attacked\nDoriath.\n\nDior's wife was Nimloth, a Sindarin elf, and with her he had three\nchildren: Elwing, Eluréd and Elurín. During the Sack of Menegroth by the\nSons of Fëanor, Elwing escaped to the Mouths of Sirion while Eluréd and\nElurin were seized by servants of Celegorm and abandoned in the forest\nto die. They were never found and were presumed to have perished in the\nforest.\n\nThe second marriage of men and elves in the first age was between Tuor\nof the House of Hador and Idril of the Noldor and Vanyar. Their son\nwas Eärendil. After the fall of Gondolin, Eärendil also escaped to the\nMouths of Sirion, and married Elwing. They had two sons, Elrond\n'Half-elven' and Elros.\n\n\nThe Choice of the Half-elven\n\n\n\nAfter the conclusion of the War of Wrath, Manwë determined that the\nsurviving Half-elven would have their choice of fates: to be counted\namong Elves, and granted eternal life in the Undying Lands; or to be\ncounted among mortals, and granted the ineffable Gift of Men. This\nchoice could be delayed, although not indefinitely.\n\nEärendil would rather have chosen the kindred of Men, but he chose the\nElves for his wife Elwing's sake, who also chose the Elves. Eärendil\nwould thereafter forever sail the heavens in his ship Vingilot, the\nSilmaril of Beren and Lúthien on the prow. In Middle-earth, he was seen\nas the evening star, and the light of his Silmaril was captured in the\nPhial of Galadriel. Elwing built a tower in the Shadowy Seas and often\nmet him on his return.\n\n\n\nElros chose to be counted among mortals, and became Tar-Minyatur, the\nfirst king of Númenor. He finally took his death at the age of five\nhundred years. The heirs of Elros were not given this choice, but their\nlifespan was enhanced many times that of normal Men, and they had the\nfreedom to take death when they willed. In later times the Kings of\nNúmenor, descendants of Elros, regretted their forefather's choice, and\nthis helped lead to the Downfall of Númenor.\n\nElrond chose to be counted among the elves, serving the household of\nGil-galad until the end of the second age, and founding Rivendell in the\nthird. He married the elf Celebrian, daughter of Celeborn and Galadriel,\nand sailed into the west at the conclusion of the War of the Ring.\n\nThe children of Elrond and Celebrian were also given free choice of\nkindred, and therefore Arwen could choose to be counted amongst the\nEdain even though her father had chosen to be counted as Elven. She\nexercised this option, marrying Aragorn II Elessar, king of the Reunited\nKingdom, and finally dying at the age of 2,901 years. Their son Eldarion\nand their daughters were not counted as Half-elven, but rather as\nDúnedain restored.\n\nIt is unclear whether Elladan and Elrohir chose to be of the Edain, or\nthe Eldar; this information is not given in the books. After the books\nwere published, however, Tolkien did have this to say, “The end of his\nsons, Elladan and Elrohir, is not told; they delay their choice, and\nremain for a while”. Letters, #153. “Since most felt that their choice\nwas expressed by whether they would follow their father to Valinor at\nthe time of his own departure, and they were described as remaining in\nRivendell, they are often said to have chosen the Edain”. On the other\nhand, some believe that the twins were allowed to delay their decision\nfor a time.\n\nIt was a tradition in Dol Amroth that Imrazôr the Númenórean had married\nan elf, and therefore the Princes of Dol Amroth were of elven descent.\nLegolas of Mirkwood believed as much upon meeting Prince Imrahil, but\nthe matter remains unclear.\n\n\nEtymology\n\nThe Elvish form of “Half-elven” is _Peredhil_ (singular _Peredhel_),\nwhich is a Sindarin word.\n\n\nNamed Half-elves\n\n-   Dior Eluchíl, son of Beren and Lúthien and grandson of Melian the\n    Maia\n-   Eärendil, son of Tuor and Idril\n-   Elwing, daughter of Dior and Nimloth, Queen of Doriath\n-   Eluréd and Elurín, the sons of Dior and Nimloth\n-   Elrond, son of Eärendil and Lord of Rivendell\n-   Elros, the son of Eärendil, brother of Elrond, and first King of\n    Númenor\n-   Arwen Undómiel, or ARWEN EVENSTAR, daughter of Elrond and Celebrían,\n    and Queen of the Reunited Kingdom\n-   Elladan and Elrohir, the twin sons of Elrond and Celebrían\n-   Galador, son of Imrazôr and Mithrellas\n\n\nBeyond Tolkien\n\nUnlike in some other fantasy worlds, Tolkien's Half-elves are not a\ndistinct race per se. In _Dungeons & Dragons_ and other fantasy\nrole-playing games, these beings are simply known as half-elves\n(singular half-elf) instead of using other terms. Some other fantasy\nstories call beings who are half-human and half-\n_Halflings_; the term “Halfling” in Tolkien's legendarium pertains only\nto hobbits.",
    "other_names": "Half-elven, Peredhil",
    "languages": "Quenya, Telerin, Westron, Sindarin, Nandorin, Elvish",
    "characters": "Dior, Elwing, Eärendil, Elros, Elrond, Elladan, Elrohir, Arwen",
    "distinctions": "May choose immortality or mortality, Elf-like attributes",
    "skin_color": "Fair complexion",
    "hair_color": "Dark",
    "locations": "Doriath, Rivendell"
  },
  {
    "name": "Valar",
    "lotr_page_id": "199",
    "text": "The VALAR (Quenya; singular\nVALA) were the _Powers of Arda_ who lived on the Western continent of\nAman.\n\n\nHistory\n\nThe Valar were the fourteen Ainur who, after being molded of Eru's\nthought, entered Arda after its creation, to give order to the world and\ncombat the new evils of Melkor. They had helped to begin the shaping of\nArda through the music of Ilúvatar, and often referred to one another as\n“brother” or “sister”. Each of the Ainur had added his or her own part\nto the music creating the world incarnate, save for Melkor, who at the\ntime was counted as the strongest of them. His vision of what Arda\nshould have been differed from Eru's, which led to his banishment and\ngreat rebellion that would cause most of the ills of the world of Arda.\n The fourteen Valar originally dwelt on\nAlmaren, a hidden island on the “Great Lake”, but after it was destroyed\nand the earth was reshaped, long before the Awakening of the Elves, they\nrelocated to Aman and founded the realm of Valinor. They would become\nknown as the 'Powers of the World', though rarely directly intervening\nin the world's course of events. Eru instead gave them delegation of\nArda, and so at Valinor they constructed the golden city of Valimar,\ntheir own mansions dispersed cross the plain; and Máhanaxar, the “Ring\nof Doom”, at which they would confer and hold counsels.\n\nEru created for them lesser heavenly beings named the 'Maiar', who were\ntheir servants. Though subordinate to the Valar, the Maiar were powerful\nnonetheless, and included Melian, Sauron (named _Mairon_), Olórin (later\nnamed _Gandalf_) and the other Istari, and those who would become the\nBalrogs. Most Maiar were associated with particular Valar: Ossë and\nUinen, the “powers of the oceans”, served under Ulmo, while Curumo (much\nlater known as _Saruman_), served Aulë the Smith. Sauron also served\nAulë before he was corrupted by Melkor.\n\nIt was originally Melkor's intention to rule Arda for himself, but\nManwë, the superior of the Valar, called other spirits to help him\nconfront Melkor. (Among these were the other Valar and the Maiar.)\nMelkor withdrew from Arda after the short War for Sake of the Elves, and\nthe Valar continued their creation and furnishing of the World, while\nMelkor plotted to return and regain dominance. In time, once he returned\nin secret and ruined the Two Trees of Valinor with Ungoliant, Valinor\nlost its light, and the Valar eventually set to creating the Sun and\nMoon in the sky.  The War\nof the Jewels was prompted after Fëanor refused to forfeit his Silmarils\nto the Valar, for the rekindling of the Two Trees. He ended his and the\nÑoldor's allegiance with the Valar, and bore a new conflict between the\nElves and Melkor. The Valar soon fortified their realm, and brought\nabout the “Hiding of Valinor”, preventing Melkor and Fëanor and his\nfollowers from entering. The conflict between Melkor and the Valar was\nnot resolved until the war's climax, during which the Valar came\nphysically into Beleriand, helped conquer Melkor's forces at Angband,\nand captured him. He was taken to Aman and cast behind the Door of\nNight.\n\nIn the Second Age, the Valar created anew the island of Elenna in the\nmiddle of the Sea, for the noble peoples of the Edain who had resisted\nand endured the war against Melkor. On this island was established the\nkingdom of Númenor, which lasted three millennia until their king\nAr-Pharazôn attempted to contravene the Ban of the Valar. The Valar sank\nthe island, and the living Numenoreans sailed eastward, and settled\nMiddle-earth.\n\nOnce Sauron had begun to regain power in Middle-earth after his defeat\nin the War of the Last Alliance, the Valar sent an order of five Maiar,\nthe “Istari”, unto Middle-earth, to provide a strong opposition to\nSauron until his final destruction.\n\n\nNames\n\n\n\nThese are the names of the Valar as they were known to the Eldar. In\nMiddle-earth, they were known by other names of Sindarin origin; for\nexample they called Varda Elbereth. Men knew them by many other names,\nand sometimes worshiped them as Gods. The Elves called Varda, the\ncreator of the stars, ELENTÁRI. The dwarves called Aulë, their creator,\nMAHAL. The Ents called Yavanna, their creator, KEMENTÁRI. It should be\nnoted that, with the exception of Oromë, the names listed below are not\nactual names but rather titles: the true names of the Valar are nowhere\nrecorded. Male Valar are called “Lords of the Valar”; females are called\n“Ladies of the Valar,” or VALIER. Among these exist six married couples,\nwith only Ulmo and Nienna remaining single. \n\nLords of the Valar\n\n-   Manwë Súlimo, the Wind-king and the King of the Valar.\n-   Morgoth Bauglir, the Lord and Creator of Dark Powers who, when he\n    was counted as a Valar, was most powerful of them\n-   Ulmo, the Sea-king and the Lord of Water\n-   Aulë, the Smith and the Lord of Earth and all that's underneath\n-   Oromë Aldaron, the Huntsman, the Lord of Forests and the Great Rider\n    (husband of Vána)\n-   Námo (Mandos), the Doomsman and the Judge of the Dead (husband of\n    Vairë)\n-   Irmo (Lórien), Lord and Master of Dreams, Visions, and Desires, and\n    Creator of the Oloré Mallé, or Path of Dreams (husband of Estë).\n-   Tulkas Astaldo, the Wrestler, the Champion of Valinor, and last of\n    the Valar to come to Arda (husband of Nessa)\n\n\n\nLadies of the Valar\n\n-   Varda Elentári, the Star-queen and the Queen of the Valar\n-   Yavanna Kementári , the Fruit-Giver and the Lady of Earth\n-   Nienna, the Weeper and the Lady of Mercy\n-   Estë the Gentle, Lady of Healing and Rest, and spouse of Irmo\n-   Vairë, the Weaver and spouse of Mandos\n-   Vána, the Ever-young and spouse of Oromë\n-   Nessa, the Dancer and spouse of Tulkas\n\nOther names\n\nThe ARATAR (Sindarin: _Exalted_) or HIGH ONES OF ARDA were the eight\ngreatest of the Valar: Manwë, Varda, Ulmo, Yavanna, Aulë, Mandos,\nNienna, and Oromë. Melkor, the most powerful of all, is not counted\namong them. Lórien and Mandos were brothers, and would be referred to\ntogether as the _FËANTURI_ or “Masters of Spirits”.\n\nIn earlier versions of the legendarium, “GODS” was a word used often to\nrefer to them , and VALUR and VALIR for a short time denoted male and\nfemale Valar.\n\n\nPowers and abilities\n\nAs with the other Ainur, the powers of the Valar were very mysterious or\nambiguous.\n\nThe Valar appear to have had similar, though superior, abilities to the\nMaiar, such as the control of light and of fire. Clear abilities\nincluded shifting forms and placing Man or Elves in a trance with their\npresence. Manwë and Ulmo could both control and perceive massive volumes\nof matter at once, perhaps giving evidence of advanced intelligence.\nYavanna and Nessa’s efforts combined could create Laurelin, a tree which\nhad at the very least thousands of Sun-like flowers, and Telperion,\nwhich produced light “for millions of stars”. Varda could lift enormous\nstars weighing billions of metric exatons, on which speculation is based\nthat she, if not all Valar, could move at any desired speed through\nspace.",
    "other_names": "Valar",
    "languages": "Valarin, Quenya, Sindarin, Telerin, Khuzdul",
    "lifespan": "Immortal",
    "distinctions": "Immortality; rulers of the World",
    "height": "Varies",
    "skin_color": "Varies",
    "locations": "Almaren, Aman",
    "characters": "Irmo, Tulkas, Estë, Vairë, Vána, Nessa, Melkor"
  },
  {
    "name": "Balrogs",
    "lotr_page_id": "399",
    "text": "BALROGS, also known as the VALARAUKAR, were Maiar that were seduced and\ncorrupted by Melkor into his service.\n\n\nOrigins\n\nOriginally, Balrogs were Maiar that were later persuaded by Melkor\nbefore the Awakening of the Elves. Their first dwellings had been\nUtumno, but after their master's defeat during the War for Sake of the\nElves, the Balrogs and other creatures in Melkor's service escaped and\nwent to Angband.\n\n\nHistory\n\nYears of the Trees\n\n[The Balrogs of Morgoth, by Thylacinee ]\n\nBalrogs were present as early as the Years of the Trees when Melkor and\nUngoliant went to Valinor and destroyed the Two Trees. By then, the\nBalrogs remained in the pits of Angband. After Morgoth destroyed the\nTrees with Ungoliant, he came to the ruins of Angband to renew his rule\nin Middle-earth. A disagreement with Ungoliant led to her attacking him,\nand Morgoth gave out a great cry that roused the Balrogs from their\nslumber. In a tempest of fire, the Balrogs drove Ungoliant away and\nprepared to pursue her. However, they were halted by Morgoth and\nreturned to Angband, which shortly thereafter was constructed anew.\n===First Age===\n\n[Death of Fëanor, by LuisFBejarano]\n\nWhen the Noldor managed to win the battle Dagor-nuin-Giliath,  Fëanor,\nstill in a great rage, pressed on toward Angband. He came even within\nsight of Angband, but was ambushed by a force of Balrogs, with few elves\nabout him. Soon he stood alone, but long he fought on with all Balrogs\nalone, so how was mightiest the strength, valour, and endurance, of all\nthe Children of Iluvatar, though he was wrapped in fire and wounded with\nmany wounds. But at the last Gothmog, Lord of the Balrogs, smote him to\nthe ground, inflicting a mortal wound.\n\nMaedhros, Fëanor's son, persuaded the forces of Morgoth for a feigned\ntreaty, but Morgoth sent his Balrogs. The entire company was slain,\nexcept for Maedhros, who was later brought to Angband.\n\nYears later, during the Dagor Bragollach, the Balrogs, along with\nGlaurung and Orcs, were issued forth from Angband assault the fortresses\nof the Elves and to kill their allies, the Men.\n\nThe Balrogs fought during the Nírnaeth Arnoediad, where Gothmog led the\ninvasion. He threw aside Húrin and Turgon, turned upon Fingon and killed\nhim with the help of another Balrog, securing the field for Morgoth's\nforces. He also captured Húrin, after Húrin was buried under a mountain\nof slain foes. He bound the human warrior and delivered him to Angband,\nwhereupon Morgoth attempted unsuccessfully to pry the location of\nGondolin from him.\n\n[Glorfindel and the Balrog, by John Howe]\n\nIn FA 510, during the Fall of Gondolin, the Balrogs rode upon the backs\nof dragons to reach the hidden city of Gondolin. The Lord of the House\nof the Fountain, Ecthelion, managed to kill Gothmog at the cost of his\nown life. While attempting to escape the burning city, Glorfindel and\nhis companions were blocked by another Balrog. To save Tuor, Idril and\ntheir young son Eärendil, Glorfindel fought the Balrog on a cliff and\ncast it down, but he was pulled down with the Balrog to their deaths.\n\nThe last of the Balrogs fought in the War of Wrath and were destroyed,\nthough some managed to escape and hide in the caverns of the earth.\n\nThird Age\n\nIn TA 1980, a Balrog awoke in Moria when the Dwarves had mined too deep\nfor Mithril. It drove the Dwarves out of their home and slew King Durin\nVI, and the Balrog was thereafter called “Durin's Bane”.\n\nDuring the War of the Ring, the Fellowship of the Ring passed through\nMoria and encountered Durin's Bane, which pursued them to the Bridge of\nKhazad-dûm. Gandalf the Grey fought the Balrog, allowing the Fellowship\nto escape Moria. Both fell into the abyss, but the battle continued\nat the peak of Zirakzigil. Finally, it ended, but both Gandalf and\nDurin's Bane were slain in the process. Gandalf was later “sent back” by\nthe Valar, as Gandalf the White.\n\n\nAppearance\n\n[The Durin's Bane uses its fiery whip against Gandalf]Balrogs generally\ntook the form of a tall, menacing beings roughly in the shape of a Man,\nthough seeming to consist or be surrounded by shadow. They used both a\nflaming sword, and a many thronged whip; and, were constantly burning,\nwith all their weapons having appeared to be made of lava. Gothmog, the\nLord of Balrogs in the First Age, used a black axe as well. Balrogs\ninduced great terror in friends and foes alike; many who faced Balrogs\nreferred to them as monsters consisting purely of shadow and flame.\n\nThe issue of Balrog wings has been long-debated in Tolkien circles. The\nuse of “like wings” to describe the shadow around the Balrog is the\nepicenter of the discussion. It remains somewhat ambiguous whether they\nhad wings, but the description of the shadow as stretching from “wall to\nwall” does not fit the scale of the Balrog in the book. The use of a\nsimile also suggests that they did not have them; however, there is also\na quote that states the Balrog's wings stretched from wall to wall,\ncausing more confusion, as just a few lines earlier there was the\naforementioned use of “like wings”.\n\nBalrogs seemed to encapsulate and project power and terror, perhaps\nmeant to be a dark shadow of the majesty that the Valar radiate.\nAdditionally, Tolkien refers to Balrogs with “streaming fiery\nmanes”.\n\nAdditionally, they may have been able to alter their body structures on\noccasion, as in the battle between Durin's Bane and Gandalf, when the\nBalrog fell into a body of water he shifted himself into something\nslimy. However, it is also possible that this alternate form was\nsimply Gandalf using colorful language to describe what the Balrog was\nlike after having its flame extinguished and being covered in water. It\nis also possible that, while the Balrog, like all other Ainur, could\nshift form, this was not a case of that.\n\n\nPowers and abilities\n\nBalrogs were exceptionally powerful creatures. Only seven Balrogs were\nrequired to drive away Ungoliant, a large monster powerful enough to\ndevour consume the fruits of Telperion, which produced the light for\nbillions of stars.\n\nA single Balrog, who became known as Durin's Bane, alone managed to\ndrive the Dwarves of Moria from their ancient and supremely fortified\nnation-state, which was at the time the greatest kingdom of Dwarves that\nhad ever been. It also contended with Gandalf, and shattered the side of\na mountain with physical might alone. The Balrogs were considerably\nbodily agile, such that their passing is once described as a “tempest of\nfire”.\n\nGothmog fought against and overcame Fëanor, an elf who was powerful\nenough to control the light of the two trees. He also spread chaos\nthrough the city of Gondolin, filled with elves of similar, though far\nlower, caliber. It was even thought to be at least somewhat comparable\nto Sauron during the first age.\n\n\nEtymology\n\nIn Sindarin, the word _BALROG_ means “Demon of Might”, from the\nwords _bal_ (“power”) and _raug, rog_ (“demon”). Balrogs are called\n_Valarauko_ or _Valaraukar_ in Quenya, from the words _vala_\n(“power”) and _rauco_ (“demon”).\n\nOther names\n\nIn other writings, _Balrog_ is derived from _ñgwalaraukô_ (“demon”).\n\n\nKnown Individuals\n\n[Durin's Bane]\n\n-   Gothmog - the Lord of the Balrogs and High-captain of Angband, slain\n    by Ecthelion during the Fall of Gondolin\n-   Durin's Bane - awakened in the Third Age, slain by Gandalf at the\n    peak of Zirakzigil\n\n\nIn other versions of the legendarium\n\nIn Tolkien's later writings, he made note of the fact that there could\nnot have ever been more than seven Balrogs, yet they were able to\ndrive away Ungoliant in what was described as a “tempest of fire”.\n\nIn another early writing, the Lord of the Balrogs was named Lungorthin.",
    "origins": "Maiar",
    "locations": "Angband, Khazad-dûm",
    "lifespan": "Immortal",
    "distinctions": "Man-like, surrounded by shadow and fire, covered in smoke",
    "characters": "Gothmog, Durin's Bane",
    "height": "Twice the height of a man"
  },
  {
    "name": "Orcs",
    "lotr_page_id": "676",
    "text": "Before Oromë found the Elves at Cuiviénen, Melkor enslaved some of them\nand cruelly tortured them, turning them into ORCS.\n\nMany Orcs (along with fallen Maiar and other evil servants of Melkor)\nsurvived in the deep caves, pits, chambers, and tunnels of Melkor's\ngreat underground fortresses of Utumno and Angband. They multiplied and\nlater spread through northern Middle-earth. They were first seen by the\nDwarves who reported them to King Thingol, the High King of the Sindar,\ncausing the latter to seek weapons of war for the first time. For\nover a millennium, the orcs were only a minor problem, but when Melkor\n(Morgoth) returned with the Silmarils he took full charge of them and\nsoon unleashed them on Beleriand. The newly organised orcs killed\nDenethor, the King of the lightly armed Laiquendi, but were eventually\ndefeated by Thingol and his allies. They besieged the Havens of the\nFalas under Círdan, and the siege wasn't broken until the arrival of the\nÑoldor. The heavy losses that the Sindar suffered at the hands of the\nOrcs frightened them to the point that Melian, Queen of Doriath raised a\ngreat enchantment to protect their kingdom. The Laiquendi, who suffered\nthe most in the battle, hid themselves in the Ossiriand under the cloak\nof secrecy, or took refuge in Doriath.\n\n\nHistory\n\nBefore First Age\n\nMelkor was the first to learn of the Awakening. He soon began sending\nevil spirits among the Elves, who planted seeds of doubt against the\nValar. It is also rumoured that some of the elves were being captured by\na Rider if they strayed too far, and the elves later believed these were\nbrought to Utumno, who cruelly tortured and twisted them into ORCS.\n\nFirst Age\n\nIn the First Age, thousands of Orcs were bred in Angband by Morgoth and\nto participate in the Battles of Beleriand, which lasted 587 years. They\nfirst appeared in the Battle of Lhammoth, where they were defeated by\nthe Noldor. When the House of Fëanor returned to Middle-earth Morgoth\nsent a force of Orcs against them. Although the Orcs outnumbered the\nexiles they were no match for the power and wrath of the Ñoldor, and\nwere quickly and easily defeated. However, Fëanor could not defeat the\npower of Morgoth alone and he was killed, leaving the Orcs to continue\nto breed under the Dark Lord. Years later, when the House of Fingolfin\narrived in Middle-earth, Orcs were sent against them as well, but they\nwere utterly defeated in the Battle of the Lammoth.\n\nAfter their crushing defeat in the Dagor Aglareb and in a minor raid on\nHithlum, the Orcs nevertheless regained their numbers and fought again\nin large numbers in the Dagor Bragollach and Nirnaeth Arnoediad. They\nwere nearly destroyed in the War of Wrath, and those that survived fled\neastwards into the Mountains of Angmar and the Grey Mountains.\n\nSecond Age and on\n\nSometime around SA 1000, Sauron reappeared in Middle-earth and made the\nland of Mordor his realm, and then started to build the foundations of\nBarad-Dûr. During the War of the Elves and Sauron in SA 1700, the Orcs\nformed the main host of Sauron's power. Despite the immeasurable number\nof Orcs present, the battle was won by the Elves and the Numenoreans due\nto their united force and numbers.\n\nUntil Sauron's final downfall in the Third Age, Orcs remained the\nbackbone of the armies of Mordor, and of Isengard when Saruman ruled it.\n\n\nCharacteristics\n\nAppearances\n\nIn Tolkien's writings, Orcs were evil, cruel, wicked, hateful,\nblackhearted, and hated everybody and everything, particularly the\norderly and prosperous. Physically, they were short in stature\n(unless of the Uruk variety) and humanoid in shape. They were generally\nsquat, broad, flat-nosed, sallow-skinned, bow-legged, with wide mouths\nand slant eyes, long arms, dark skin, and fangs. Tolkien describes one\n“huge Orc chieftain” as “almost Man-high”, and some must have been close\nto Hobbit height, as Sam and Frodo are able to disguise themselves as\nOrcs in Mordor. They were shaped in mockery of the elves(and possibly\nmen) they descended from. They were humanoid in shape with pointed ears,\nsharpened teeth and grimy skin. Their appearance was considered\nrevolting by most of the other races.\n\nOrcs made no beautiful things, but many clever ones including machines,\ntools, weapons, and instruments of torture, were delighted by wheels,\nengines, and explosions, and could tunnel and mine as well as any but\nthe most skilled Dwarves. This was so since the day they were bred by\nMelkor from corrupted, tortured and mutilated Men. They hate themselves\nand have an even deeper hatred of the Dark Lord who has brought them to\nthis end. The result is a violent and warlike race in a perpetual state\nof chaos with itself and others. Despite their abominable nature, they\nare not dim-witted and are clever and crafty and make good tools,\nweapons, and machines of war but produce no beautiful things nor do they\ntrade or share anything with others, unless ordered to by a Dark Lord\nfor the purposes of war and conquest. Their tools and weapons, however,\nare of poor quality when compared to those of the Free Peoples.\n\nThey also developed tunnel-making, for living underground away from the\nlight. Wickedness and violence were their nature, and they were known to\nquarrel and kill each other over petty things. An example of this\ndestructiveness was its effect on nature such as was the case with\nforests and trees, which were often destroyed to fuel their war-making.\nSee: Fangorn forest during the War of the Ring and the western part of\nMiddle-earth after Sauron's War on the Elves in the mid-Second Age.\nHowever, perhaps the best example of this was during the War of the\nRing, when two different groups of Orc soldiers captured the Hobbit\nFrodo Baggins, and then killed each other to the last in the Tower of\nCirith Ungol due to a quarrel over his belongings. This allowed Samwise\nGamgee to rescue Frodo and ultimately caused the destruction of the One\nRing. Orcs generally hated all Elves, Dwarves, and Men, and yet some\nwere said to make alliances with wicked Dwarf groups and others with\ncorrupted Men. Without the leadership of a Dark Lord, Orcs usually live\nin tribal communities in underground lairs under mountains under the\nrule of brutal chieftains, raiding and pillaging settlements of other\nraces that are unfortunate enough to live near them. Thus, they were\nhated by almost every race that knows them, even those allied with them.\nWithout firm leadership, Orcs presumably went into battle often in\ncomplete disarray and without any semblance of formation or tactics.\nTheir strength in combat came from numbers and sheer violence. Due to\nsuperior organization, training and weaponry, Men, Dwarves, Elves, and\nat times even Hobbits, were able to defeat larger numbers of Orcs,\nprovided an ability to withstand the horror and shock of the initial\nonslaught.\n\n\nEtymology\n\nIn Tolkien's Sindarin language, “Orc” is _orch_, plural _yrch_. In his\nlate, post-_Lord of the Rings_ writings (published in _The Peoples of\nMiddle-earth)_, he preferred the spelling “Ork”, evidently mainly to\navoid the form _Orcish_, which would be naturally pronounced with the c\nas /s/ instead of /k/. (In Tolkien's languages the letter _c_ was always\npronounced /k/.) It is also possible that the word is a Common Tongue\nVersion of 'orch', the Sindarin word for Orc. The original sense of the\nword seems to be “bogey”, “bogeyman”, that is, something that provokes\nfear, as seen in the Quenya cognate _urko_, pl. _urqui_. In the old\nEnglish Orc means “demon.” The term _Uruk-hai_ merely means\n“orc-folk” in the Black Speech, and was the Uruk-hai's name for\nthemselves.\n\nOther names\n\n“GORGÛN” was the name that Ghân-buri-Ghân of the wild men of the Drúadan\nForest used for the Orcs in their own language.\n\n'''“Yrrch” '''was the name used by Haldir and his brother, Elves of\nLothlorien. This same variation on “orc” was also used by Legolas\nindicating that it is Sindarin.\n\n\nNotable Orcs\n\n\n\n-   Azog\n-   Balcmeg\n-   Boldog\n-   Bolg\n-   Golfimbul\n-   Gorbag\n-   Gorgol\n-   Gothmog\n-   The Great Orc\n-   Grishnakh\n-   Lagduf\n-   Muzgash\n-   Radbug\n-   Shagrat\n-   Snaga\n-   Ufthak",
    "other_names": "Goblins, Glamhoth, Yrch",
    "origins": "Obscure, but apparently bred from Elves or Men",
    "languages": "Black Speech, numerous Orkish languages, Westron",
    "characters": "Azog, Bolg, Gorbag, Great Goblin, Grishnakh",
    "distinctions": "Most common servants of evil",
    "height": "Almost man-high, or short",
    "skin_color": "Sallow, green, brown, grey, black, swarthy",
    "locations": "Utumno, Angband, Mordor, Misty Mountains, Angmar, Mount Gundabad, High Pass, Dol Guldur, Isengard"
  },
  {
    "name": "Trolls",
    "lotr_page_id": "677",
    "other_names": "Ogres",
    "text": "TROLLS were a very large and monstrous (ranging from between 10-50 feet\ntall), and for the most part unintelligent, humanoid race inhabiting Middle-earth.\n\n\nHistory\n\nMelkor created trolls before the First Age. They were very strong, but\nturned into stone in sunlight. Many trolls died in the War of Wrath, but\nsome survived and joined the forces of Sauron, the greatest surviving\nservant of Morgoth. In the Second and Third Age, trolls were among\nSauron's most dangerous warriors. He created the Olog-hai, which were\nsmarter than earlier breeds of trolls. While most trolls cannot bear\nexposure to sunlight without turning to stone, the Olog-hai apparently\ncould (to the same extent as orcs); this attribute was mentioned in _The\nReturn of the King_ as making them particularly dangerous.\n\n[A mountain troll at the Black Gate, used for opening the gate]\n\nDuring Bilbo's quest to the Lonely Mountain, trolls were known to speak\nwith thick Cockney accents, specifically three hill trolls who dwelt in\nthe Trollshaws and had gotten there from the Ettenmoors . They turned to\nstone when exposed to sunlight, for stone, as told in _The Hobbit_, is\nwhat trolls were originally made of. They enjoyed eating anything they\ncould get their hands on. While threatening, the trolls in The Hobbit\nserve as a comic element. They even had normal names: Tom, Bert, and\nWilliam (Bill) Huggins (the only one with a given surname).[Armored\nMountain Troll]During the War of the Ring, Frodo and the Fellowship\nencountered cave trolls alongside various orcs within Moria. Boromir's\nsword recoiled off the scaled hide of one troll. As things seemed\nperilous, however, the trolls fled (although this was due to the\napproach of the far more threatening balrog, Durin's Bane). Sauron used\nOlog-hai in the Siege of Gondor and Battle of the Pelennor Fields. In\nthe subsequent Battle at the Black Gate, the hobbit Peregrin Took killed\na large Olog-hai troll with a huge sword. As a result of the One Ring\nbeing destroyed, the Black Gate collapsed into ruin during that battle.\nMost of the trolls present at the battle were killed, and the others are\nknown to have fled.\n\n\nPhysiology and characteristics\n\nThey were strong and vicious, but generally dim-witted and stupid at\nbest. Some were described as being able to speak, while others appear to\nbe as irrational as animals. The major weakness of at least some trolls\nwas that they turned to stone in sunlight. Their hide was as thick as\nstone and nigh-impervious to physical attacks. It is stated that they\nwere created by Melkor, although it's not clear exactly how. The Ent\nTreebeard says that trolls were “made in mockery” of ents, as Orcs were\nof elves, though not necessarily from Entish stock. However, they could\nbe based on another race of Middle-earth, as neither Morgoth nor Sauron\nhas access to the Secret Fire, and therefore cannot create things, only\nalter that which already exists. There is reference that sunlight will\nreturn them to the stone they were made from in _The Hobbit_ and _The\nLord of the Rings_. They seem to be fond of meat, and will eat almost\nany animal or being they come across. They also have very disgusting\nmanners.\n\n[A Cave Troll]\n\nDuring the wars of Beleriand, Gothmog, the Lord of Balrogs, had a\nbodyguard of trolls. While leading his men in a final stand to protect\nthe retreat of Turgon and the continued secrecy of the Kingdom of\nGondolin, the great warrior Húrin faced them and, due to Morgoth's\nemphatic orders to have Húrin captured alive, he managed to kill many of\nthem. Their apparently caustic blood, however, melted his axe, allowing\nOrcs to swarm over him and bind him, his capture ending the Nirnaeth\nArnoediad, where Morgoth triumphed over the united armies of Elves, Men,\nand Dwarves.\n\nDuring the Battle of the Pelennor Fields, there is a reference to\n“men-like half-trolls”, also called troll-men, but it is unclear whether\nthese men actually had some trollish ancestry or were simply compared to\ntrolls (for some readers, the first interpretation is supported by the\nsimilar and interchangeable terms “orc-men” and “half-orcs”, referring\nto crossbreeds of Saruman).\n\n\nTypes\n\n[Stone troll]Originating in Norse mythology, an extremely widespread\nbelief in its time, there are many types of trolls, each unique to its\ninhabitants:\n\n-   “Stone-trolls” were trolls who turned into stone during daylight,\n    like the trolls in _The Hobbit_. They could speak, and used a\n    debased form of Westron (presumably rendered into Cockney English in\n    Tolkien's “translation” of Bilbo's diary).\n\n&nbsp;\n-   Two-headed trolls are said in _The Hobbit_ to be more ferocious than\n    those with one head. It is unknown if they actually have two heads\n    or if it is a term for those working for Sauron, for he controlled\n    them, meaning they have two “heads”.\n\n&nbsp;\n-   Hill-trolls are described in the chronology at one instance as\n    having killed Arador, grandfather of Aragorn, at the Coldfells.\n    Tolkien described the trolls of that region, including the three\n    from The Hobbit, as stone trolls, suggesting that hill trolls might\n    be a subclass or alternate term for such. However, the Army of the\n    West fought “hill trolls” of Gorgoroth that could move in sunlight\n    at the Black Gate, inferring that these hill trolls, at least, were\n    Olog-hai rather than stone trolls. Hill trolls hardly differ from\n    stone trolls and were probably of the same beast-race.\n\n[A cave troll fighting Gondorian soldiers in the BFME series.]\n\n-   Cave-trolls were seen in Moria, and were also in the Ettenmoors. One\n    was described as having dark greenish scales and black blood. Their\n    hide was thick enough that when Boromir struck one on the arm his\n    sword was notched and did no damage. However, Frodo Baggins was able\n    to impale the “toeless” foot of the same troll with the enchanted\n    sword Sting.\n-   Mountain-trolls were mentioned once, wielding the great battering\n    ram Grond in shattering the gates of Minas Tirith. From their name,\n    they are generally assumed to live in the mountains, and their\n    choice as the creatures to wield Grond is sometimes taken to suggest\n    that they were particularly strong even for trolls.\n\n&nbsp;\n-   Snow-trolls are mentioned only in comparison to Helm Hammerhand.\n    When Helm went out clad in white during the Long Winter to stalk and\n    slay his enemies, he was described as being like a snow troll. It\n    thus seems implied that these trolls were white in colour and lived\n    in cold climates, but otherwise nothing is known of them.\n\n&nbsp;\n-   Olog-hai were “strong, agile, fierce, and cunning” trolls created by\n    Sauron, not unlike the Uruk-hai, and were able to withstand sunlight\n    while under the sway of Sauron's will.\n-   Half-trolls were troll-like humanoids from Harad who served Sauron\n    in The Battle of the Pelennor Fields. While it is unlikely that they\n    had any actual troll blood in them, it is still possible (but more\n    likely they were a superior breed of orcs and/or men).\n\n[A half-troll]\n\nThe Olog-hai were actually a breed of mountain trolls. They seldom spoke\nand were said to know no language other than the Black Speech, in which\nOlog-hai means “troll-folk” (singular olog, “troll”). Because of their\ncunning, they were (incorrectly) believed by some to be giant orcs\nrather than trolls. They appeared towards the end of the Third Age and\ncould be found near Dol Guldur and in the mountains around Mordor. In\nthe Battle of the Black Gate, there appear “Hill trolls” of Gorgoroth,\nwhich are implied to be Olog-hai in one of the appendices to The Lord of\nthe Rings (the term is not used within the story proper). These were\ndescribed as being taller and wider than men and their hide or armour\nwas described as a mesh of horny scales. They had black blood. Peregrin\nTook slew one of these trolls at the Battle of the Black Gate and, after\nthe destruction of the One Ring and the fall of Sauron, the surviving\ntrolls scattered as if mindless.\n\n\nOther names\n\n_Torog_ was the Elven (Sindarin) name for those of troll-kind. Tolkien\nnormally renders it as “troll” in his works. The derivation of this word\nis uncertain - it may be derived from old Elvish words or perhaps\nimitates olog, which seems to be the comparative term in Black Speech.",
    "origins": "Created by Morgoth in mockery of Ents",
    "locations": "Mordor, Ettenmoors",
    "languages": "Black Speech, various Mannish tongues",
    "distinctions": "Strong beasts with limited intellect",
    "skin_color": "Grey",
    "characters": "The three Trolls",
    "height": "Large (9 - 10 ft)"
  },
  {
    "name": "Dragons",
    "lotr_page_id": "2275",
    "distinctions": "They were greedy, cunning, seductive and malicious",
    "text": "DRAGONS were ancient, intelligent, powerful creatures, as feared by\nothers as they were admired in Middle-earth. Their exact origin is\ndebated, though it was clearly stated that they were created by Morgoth\nin some sense.\n\n\nHistory\n\n[A drawing by Tolkien of his dragons]\n\nDragons lived throughout the First, Second, and Third ages of\nMiddle-earth and may have lived longer. They were originally bred\nby Morgoth during the first age to serve as gigantic shock troopers and\nmobile artillery. The first dragon ever seen in Middle-earth was\nGlaurung, the father of dragons, who Morgoth used to great effect during\nthe fourth and fifth battles in the War of the Jewels. Like most of the\ncreatures made or twisted by Morgoth, they were capable of reproducing\nnaturally. Dragons were sometimes referred to as SERPENTS, GREAT WORMS,\nor simply DRAKES, with the first two specifying the Wingless Dragons.\n\nDuring the First Age, the greatest heirloom of the house of Hador was\nthe Dragon-helm of Dor-lómin, which was a helm of great weight that had\nas its crest an image of the head of Glaurung the Dragon. \n\nThe dragons of the Second Age and Third Age were a blight upon the\nDwarves and all those who hoarded treasure. Some, like Smaug the Golden\nand Scatha the Worm, went from the Withered Heath and invaded Dwarven\nkingdoms. Before the coming of Smaug, there had not been notable\nactivities observed during the Second Age, but dragons seemingly kept\nserving as dark servants (partially at least).\n\nThere was an inn in The Shire called _The Green Dragon_, and a type of\nflower and firework called a Snap Dragon. For Bilbo Baggins' 111th\nbirthday, Gandalf made a special dragon firework.\n\nIt is presumed that, after the death of Smaug in the Third\nAge, the great dragons had become extinct. According to Gandalf, the\nfire-drake race survived until at least just before the War of the Ring,\nand some lesser kin survived even after the war. It may have been\npossible that some races of dragon still existed throughout the Fourth\nAge.\n\n\nTypes of Dragons\n\nThe taxonomic system for Dragons in Middle-earth is based on two\nfactors: means of locomotion, and fire breathing.\n\n-   Fire. Depending on whether a Dragon can breathe fire, it might be\n    termed\n    -   Urulóki (_Urulokë_, Fire-drakes) - fire-breathing serpent-like\n        Dragons with or without wings\n    -   Cold-drakes - Dragons who could not breathe fire\n        -   Smoke-breathing Dragons - Cold-drakes that could not breathe\n            fire, but had the ability to breathe a mist and smoke.\n-   Means of locomotion\n    -   Winged Dragons - Dragons that had four legs but also wings which\n        enabled them to fly.\n    -   Wingless Dragons - Dragons with no wings that walked on four\n        legs. Spark-dragons are possibly categorized in this group.\n    -   Serpent-like Dragons - Dragons with no legs and no wings, such\n        as the Wyrms/Long-worms (and perhaps the Sea-serpents).\n\nSome Dragons could not breathe fire and were known as Cold-drakes. Of\nthese most could not breathe anything at all, but some few could breathe\na smoke or vapor or mist. In particular many Dragons without legs or\nwings were Cold-drakes. Cold-drakes are not referred to until the Third\nAge, though that does not mean they did not exist before. Possibly some\nDragons, or perhaps some of their descendants, lost the ability to\nbreathe fire in the millennium after the War of Wrath.\n\n\nCharacteristics\n\n[Glaurung, Father of Dragons, slain by Túrin Turambar]\n\nDragons were long-lived, powerful, cunning, possessed of subtle\nintelligence, had great physical strength, and were covered in nearly\nimpenetrable scales everywhere except their undersides. They also\nposessed an overwhelming greed for treasure, especially gold, and were\nwell known for sleeping on piles of stolen treasure. By their very\nnature, they relished not only the theft of beautiful things, but the\nact of dispossession itself; essentially, it was more satisfying for\nthem to steal treasure from another rather than come upon unclaimed\nvaluables. According to Thorin Oakenshield they had a very keen sense of\nthe value of their hoard, but never themselves crafted so much as a\nbrass ring. Dragons were prone to fits of anger, which could result in\ndevastating effects upon the surrounding land and those living on it.\nThe reasons behind their strong affinity for gold are unknown, but\ndragons often put a greater priority on possessing gold than on\nobtaining food, and they can survive not eating (and maybe drinking as\nwell) for decades or perhaps centuries. This suggests that jewels may be\nprimal sources of the great serpents' life forces (though they could\nalso simply possess extremely slow metabolisms, similar to other\nreptiles but exaggerated).. Due to this fact, dragons of Arda may or\nmay not be immortal in ideal conditions, though regardless they are\nknown to live for very long periods of time. Not much is known about\nthe life cycle of dragons, but it is known that Glaurung, the progenitor\nof the species, took three centuries to grow from infancy to adulthood,\nand that he was considered an “adolescent” after growing for around a\ncentury. If Glaurung's development mirrors that of other dragons, then\nit also takes a great deal of time for their scales to become hard, as\nGlaurung's could still be penetrated by arrows after a century of\ndevelopment.\n\nMany accounts of interaction between dragons and other beings makes\nmention of them speaking, using the Common Tongue. In conjunction with\nthis, they also possessed a hypnotic power known as the “dragon-spell”,\nby which weaker-willed beings could be put into a trance or bent to a\ndragon's will when the beast spoke. Even those of strong will could be\nsubjected to this ability, especially if they were not prepared for it.\nDragons could make even greater use of this ability through\npsychological manipulation, increasing the power of the spell by\ntaunting a subject with knowledge of some inner conflict on the part of\nthe subject. Glaurung, for instance, was not fully capable of bending\nTúrin to his will, but when the dragon began to taunt him with his own\nfailings, Túrin became far more receptive to the dragon's\nsuggestions. In addition, this dragon-spell seems to have had the\nability to plant mistrust in the listener's mind. This power also\nextended to a dragon's treasure hoard, causing it to excite feelings of\ngreed and animosity among others who would possess it. Feuds and battles\nfrequently followed upon the death of a dragon; usually between the\nindividual who slew the beast and the original owners (or their heirs)\nof its hoard, as well as an occasional ambitious third party. Some have\nspeculated that this 'curse' played a part in Fram's death at the hands\nof the Dwarves after he had slain Scatha. The same could be said of the\nfamous Battle of Five Armies upon the death of Smaug, though other\nexternal circumstances clearly played a significant role in causing that\nconflict.\n\nDragons evidently delighted in sowing discord and strife among others,\nand apparently had a love of riddles and puzzling talk, spending long\nhours trying to decipher it. Therefore, speaking in ambiguous riddles\nwas the best way to converse with a dragon, as it was quite unwise to\neither tell the full truth or to directly refuse them. Bilbo Baggins\nused this knowledge to great effect during his confrontation with Smaug,\nentertaining him with vague doublespeak in order to keep him mentally\noccupied and relatively calm.\n\nDragons had an acute sense of smell. During his encounter with Smaug,\nBilbo Baggins was informed in no uncertain terms by the dragon that knew\nthat Bilbo was in the company of Dwarves due to the scent of a\n“dwarf-ridden pony” upon Bilbo. However, he was unable to determine what\nBilbo was by scent, as he had never encountered a hobbit before.\nFurthermore, despite his invisibility, thanks to the One Ring, Smaug was\naware of the Hobbit's presence by both his breath and the movement of\nthe air he caused in the great hall. Dragons were known to be able to\nsleep with half an eye open, on the alert for intruders if they were\nsuspicious. The hobbit, his senses perhaps heightened by wearing the\nring, also reported seeing a pale ray of light emanating from Smaug's\neye as he probed the chamber back and forth for the burglar.\n\n[Smaug the Golden]\n\nDragons had strong scales covering the majority of their bodies, which\ncould resist most weapons, though young dragons had to grow into their\nnatural armour. Mithril is said to have been as strong as dragon scales,\nthough lighter in weight. The underbelly of a dragon was described as\nsoft, slimy, and unarmored, and was often exploited as a point of\nvulnerability in combat. However, Smaug had lain so long on the heap of\ntreasure in the deep of the Lonely Mountain that gems and coins had\nbecome encrusted in the slime, so that he was “armored above and below\nwith iron scales and hard gems”; he was also said to have had scales\nthere too making his underbelly harder to strike at than his back\n(though this protection was not complete, and ultimately resulted in him\nbeing killed). The Dwarves appear to have had some skill at fighting\ndragons, as seen when they held off Glaurung for a time in the Nirnaeth\nArnoediad. This was one of the few instances where the battle was ''not\n''due to stolen gold. The age-old fight between dwarves and dragons was\nprimarily a result of the dwarves placing great value on their\nhard-earned treasure, and the dragon's habit of stealing it. King Dain I\nand his son Fror of the Grey Mountains were both slain at the doors of\ntheir hall by a great cold-drake. Both races had a lust for beautiful\nmetals and gems, and so, naturally, came into conflict, with the dragons\ngenerally prevailling.\n\nA great stench went before Glaurung, and his blood contained some sort\nof venom, though it is not known if all dragons had these two traits,\nalthough the Dwarves commented on the reek of Smaug that filled the\nLonely Mountain's halls after the dragon's long stay there.\n\nDragon fire was hot enough to melt the Rings of Power. Indeed, four of\nthe seven rings gifted to the Dwarves were consumed by dragon fire.\nHowever, it was said by Gandalf that no dragon's fire would be hot\nenough to melt the One Ring, not even that of Ancalagon the Black, the\ngreatest dragon.\n\n\nMentioned Individuals\n\n[Dragons and Balrogs before Gondolin, by John Howe]\n\n-   Glaurung - Slain by Túrin Turambar, also known as the “Father of\n    Dragons”.\n-   Ancalagon the Black - The mightiest Winged Dragon to have ever\n    lived; slain by Eärendil.\n-   Scatha the Worm - Slain by Fram, the hoard Scatha guarded was taken\n    from the Dwarves, thus Fram taking it led to arguments and his\n    eventual death at the hands of the Dwarves.\n-   The Great Cold Drake - A cold drake of great power which attacked\n    Dwarves of Grey Mountains and killed Dáin I and his second son Frór.\n-   Fire-drake of Gondolin - A large dragon that participated in the\n    Fall of Gondolin.\n-   Smaug - Slain with the Black Arrow by Bard the Bowman, afterward\n    King Bard, of Dale.\n-   Gostir - a name-only known individual.\n-   An unnamed individual - Mentioned in “The Hoard”, _The Adventures of\n    Tom Bombadil_, with red eyes, black wings and teeth like knives.",
    "other_names": "Great worms",
    "origins": "Created by Morgoth in Angband",
    "locations": "Angband, Nargothrond, Grey Mountains, Lonely Mountain, Withered Heath",
    "languages": "Various Mannish and Elvish tongues",
    "lifespan": "Long and slow",
    "skin_color": "Black, golden, red",
    "characters": "Glaurung, Ancalagon, Scatha, Smaug"
  },
  {
    "name": "Ents",
    "lotr_page_id": "561",
    "text": "ENTS, also known as ONODRIM (_TREE-HOST_) by the Elves, are a very old\nrace that appeared in Middle Earth at the same time that the elves did.\nThey were apparently created at the behest of Yavanna after she learned\nof Aulë's children, the dwarves, knowing that they would want to fell\ntrees.\n\nEnts were envisioned as Shepherds of the Huorns, to protect the forests\nfrom orcs and other perils. The elves had tales of teaching the trees\nand the Ents to talk: although the Ents were sentient beings at the\ntime, they did not know how to speak until the elves taught them.\nTreebeard spoke of the elves “curing the Ents of their dumbness”, that\nit was a great gift that could not be forgotten (“always wanted to talk\nto everything, the old Elves did”).\n\nEnts are tree-like creatures, having become more and more like the trees\nthat they herded. They vary in traits, from everything to height and\nsize, colouring, and the number of fingers and toes. An individual Ent\nmore or less resembles the specific species of tree that they typically\nguard. For example, Quickbeam guarded huorns that resembled rowans, and\nthus looked very much like those huorns (tall and slender, etc.). Ents\nare very strong, as recounted by Merry and Pippin: “_their punches can\ncrumple iron like tinfoil, and they can tear apart solid rock like\nbreadcrusts_.” In the Third Age of Middle-earth, the forest of Fangorn\nwas apparently the only place ents still inhabited, although the huorns\nmay still have survived elsewhere, as in the Old Forest.\n\n\nHistory\n\n[A group of Ents with Treebeard, the eldest Ent, in the center. From\nPeter Jackson's The Two Towers] Almost nothing is known of the early\nhistory of the Ents — they apparently lived in and protected the large\nforests of Middle-earth in previous ages, and they briefly appear near\nthe end of the First Age, attacking a band of Dwarves, apparently\nsummoned by Beren and Lúthien. Treebeard told of a time when apparently\nall of Eriador was one huge forest and part of his domain, but these\nimmense forests were cut by the Numenoreans of the Second Age, or\ndestroyed in the calamitous War of the Elves and Sauron of the 17th\ncentury of the Second Age. Treebeard's statement is also supported by\nremarks Elrond the half-elf made at the Council of Elrond. Elrond said\nthat “Time was once when a squirrel could carry a nut from tree to tree\nfrom Rivendell to the Great Sea...”, further indicating that all of\nEriador was once a single vast primeval forest, of which Fangorn Forest\nwas just “the eastern end of it” according to Treebeard.\n\nTreebeard boasted to Merry and Pippin about the strength of the Ents. He\nsaid that they were much more powerful than trolls, which Morgoth (in\nthe Elder Days or First Age) supposedly made as imitations of the Ents,\nbut did not come near to their power. He compares this with how orcs\nwere Morgoth's imitation of elves. There used to be _entwives_\n(literally “ent-women”), but they started to move farther away from the\nEnts because they liked to plant and control things, so they moved away\nto the region that would later become the Brown Lands across the Great\nRiver Anduin. This area was destroyed by Sauron, and the entwives\ndisappeared. The ents looked for them, but have never found them. It is\nsung by the Ents that one day they will find each other, when they lose\nall else. In the Fellowship of the Ring, Sam Gamgee says his cousin Hal\nsaw a walking tree in the north of the Shire. When Pippin and Merry tell\nTreebeard about the Shire, Treebeard says the entwives would like that\nland, suggesting Hal saw either an Entwife or a Huorn. It is safe to say\nthat with no entwives and their slow decline with time, numbers of the\nEnts had dwindled to around fifty only by the end of The Third age.\nAccording to Treebeard there are no entings upon Middle-earth at the\ntime of the Third Age, and there have not been any for quite some time.\nAnd there will never be any more entings afterwards either, “as there\nare no Entwives”. What exactly happened to the Entwives was something\nTolkien wanted to keep a mystery, even to himself, but in one of his\nletters he said, “I think that in fact the Entwives have disappeared for\ngood, being destroyed with their gardens in the War of the Last\nAlliance.”\n\n[An Ent shepherd of Fangorn Forest]\n\nEvidence of the origin of the Ents can be found in the Valaquenta, in an\nexchange between Yavanna (a queen of the Valar, “...lover of all things\nthat grow in the earth.”) and Manwë (“...the first of all Kings: lord of\nthe realm of Arda.”), after Yavanna's spouse Aulë secretly endeavors to\ncreate the Dwarves. Aulë reminds her that the children of Ilúvatar\n(elves, men and now Dwarves) will exploit her creations for their own\nbenefit, “though not without respect and gratitude.” The defenselessness\nof her realm moves Yavanna to plead with Manwë: \"My heart is anxious,\nthinking of the days to come. All my works are dear to me... Shall\nnothing that I have devised be free from the dominion of others?” Manwë\nresponds by asking, of all she holds dear, what she would have preserved\nagainst exploitation, and she answers: \"...the Kelvar can flee or defend\nthemselves, whereas the olvar that grow cannot. And among these I hold\ntrees dear... Would that the trees might speak on behalf of all things\nthat have roots, and punish those that wrong them!” Manwë, while\ndeliberating, is overcome by a vision of the music of the Ainur, and\ngrants her request: “Behold! When the Children awake, then the thought\nof Yavanna will awake also, and it will summon spirits from afar, and\nthey will go among the kelvar and the olvar, and some will dwell\ntherein, and be held in reverence, and their just anger shall be\nfeared.” Yavanna returns to her spouse Aulë and reports: “Eru is\nbountiful. Now let thy children beware! For there shall walk a power in\nthe forests whose wrath they will arouse at their peril.” He responds\nominously: “Nonetheless they will have need of wood.”\n\n[Treebeard grabbing Pippin.]\n\nIn _The Two Towers_, the second volume of Tolkien's _The Lord of the\nRings_, the ents — usually very patient, deliberate beings — do become\nangry at Saruman, whose armies are cutting down (in their eyes, killing)\nlarge numbers of their trees. They convene an _Entmoot_, a meeting of\nthe Ents of Fangorn Forest at Derndingle to discuss the argument of\ngoing to war.\n\n[The Last March of the Ents, as depicted in Peter Jackson's _The Two\nTowers_.]\n\nAfter lengthy deliberation (though from the perspective of the Ents,\nthis is very quick action), they come to the conclusion (in the book) to\ndestroy Isengard, and head toward it. They are led by Treebeard, the\noldest ent, and accompanied by the hobbits Meriadoc Brandybuck and\nPeregrin Took. They destroy Isengard in an all-out assault and trap\nSaruman in the tower of Orthanc.\n\nDuring the ents' assault on Isengard, they destroyed the dams built by\nSaruman's minions and therefore flooded the place.\n\nAfter that, they moved many of their trees there and the place became\nknown as the Watchwood.\n\n\nLanguage\n\nEnts are not hasty creatures; they take their time, and even their\nlanguage is “unhasty”. In fact, their language appears to be based on an\nancient form of Common Eldarin, later enriched by Quenya and Sindarin,\nalthough it includes many unique 'tree-ish' additions. There are\nactually two different languages:\n\n-   Old Entish: originally, the Ents had a language of their own,\n    described as long and sonorous; it was a (like ). It is unknown if a\n    non-ent could even pronounce Old Entish correctly: it was filled\n    with many subtle vowel shades, and was very longwinded. Only Ents\n    spoke Old Entish, not because they kept their language a secret, as\n    the dwarves did with Khuzdul, but because no other could master it.\n    It was quite an alien language to all others. The huorns and trees\n    of Fangorn Forest could understand Old Entish and converse with the\n    Ents and each other with it. The only extant sample,\n    _a-lalla-lalla-rumba-kamanda-lindor-burúme_, the word for _hill_ (or\n    possibly even just part of the name of a specific hill), was\n    described as a very inaccurate sampling. Even the elves, master\n    linguists, could not learn Old Entish, nor did they attempt to\n    record it due to its complex sound structure. The grammar structure\n    of Old Entish was also quite bizarre, often described as a lengthy,\n    long-winded discussion of a topic. There may not even have been a\n    word for _yes_ and _no_: such questions would be answered by a long\n    monologue on why the Ent in question did or did not agree with the\n    Ent who asked the question. The Ent Quickbeam was regarded as a very\n    “hasty” Ent for answering a question before another Ent had\n    finished: the end may only have been another hour away. Ents as a\n    rule would say nothing in Old Entish unless it was worth taking a\n    long time to say. For everyday language function, they usually\n    resorted to “New” Entish.\n-   “New” Entish (never named as such in the text). Due to contact with\n    the elves, the ents learned much. The ents found the Elvish Quenya\n    to be a lovely language, and adapted it after their fashion to\n    everyday use. However, they basically adapted Quenya vocabulary to\n    Old Entish grammatical structure. Thus, unlike Old Entish, the\n    individual words of “New Entish” that characters such as Treebeard\n    spoke were easily translatable. However, in context they formed\n    lengthy run-on sentences of redundant adjectives that could still\n    stretch well over an hour in length. For example, when Treebeard\n    essentially wanted to tell Merry and Pippin, “There is a shadow of\n    the Great Darkness in the deep dales of the forest”, he literally\n    said in New Entish, “Forest-golden-leaves, deep-dales-winter,\n    forest-many-shadowed, deep-valley-black”. Unlike Old Entish, a\n    non-ent conceivably could speak “New” Entish. Even when speaking the\n    Common Speech, Westron, Ents fell into the habit of adapting it into\n    their grammatical structure of repeating compound adjectives used to\n    express fine shades of meaning.\n\nThe Elvish name for Ents is _Onodrim_, singular _Onod_.\n\n[Attack of the Ents]\n\nTolkien later noted that the destruction of Isengard by the ents was\nbased on his disappointment in Macbeth; when “Birnham Wood is come to\ncastle Dunsinane”, Tolkien was less than thrilled that it amounted to\nmen walking on stage with leaves in their hats. He decided that when he\ndid that scene for himself, he'd do it right.\n\n\nStatue\n\nThere are plans to erect a statue of Treebeard, by Tim Tolkien, J.R.R.'s\ngreat-nephew, near the latter's former home in Moseley, Birmingham. []\n\n\nEtymology\n\nThe word “ent” was taken from Anglo-Saxon, where it means “giant”.\nTolkien may have extracted the word from the Anglo-Saxon poetry\nfragments _orþanc enta geweorc_ = “work of cunning giants” and _eald\nenta geweorc_ = “old work of giants”, which described ruins; see\nOrthanc. In this sense of the word, ents are probably the most\nubiquitous of all creatures in fantasy and folklore, perhaps second only\nto dragons. The word _ent_, as it is historically used, can refer to any\nnumber of large, roughly humanoid creatures, including, but not limited\nto, giants, trolls, orcs, and even Grendel from the epic poem Beowulf.\n\nIn this meaning of the word, ents are one of the staples of fantasy and\nfolklore/mythology, alongside wizards, knights, princesses, and dragons,\nalthough modern English-speakers would probably not call them by their\ntraditional name.\n\nTolkien's ents are very different from traditional ents, appearing as\nhumanoid trees. They appear to have been inspired by the of many of the\nworld's folklores. See for more information.\n\nAs with _hobbit_, _ent_ is a term that in modern times is almost\nexclusively connected with J.R.R. Tolkien, and the usage of the term\nseldom evokes in people its earlier meanings.",
    "other_names": "Onodrim",
    "origins": "Created by Ilúvatar at Yavanna's request",
    "locations": "Eriador, East Beleriand, Fangorn Forest",
    "languages": "Entish, Elvish, Westron",
    "lifespan": "Immortal",
    "distinctions": "Tree-like appearance",
    "height": "Very tall",
    "skin_color": "Earthy colors",
    "characters": "Treebeard, Bregalad"
  },
  {
    "name": "Men",
    "lotr_page_id": "150",
    "text": "_'Men (THAT IS, Atani_') were one of several races inhabiting Arda. They\nare the HUMANS of Middle-earth, and the second of the Children of\nIlúvatar.\n\n\nOrigins\n\nThe race of Men was the second significant race of beings created by the\nsupreme God, Ilúvatar, since they awoke at the start of the First Age,\nat the first rising of the Sun (FA 1), while the elves awoke three Ages\nbefore them. They were called the “AFTERBORN” (Quenya _Atani_, Sindarin:\n_EDAIN_) by the Elves.\n\nMen bear the _Gift of Men_, which is mortality, and therefore they age\nand die when their time comes, and are susceptible to illness and\ndisease. Elves are immortal, in the sense that they are not susceptible\nto aging and disease. Even if their bodies are slain, their spirits will\nremain bound to the world for as long as it lasts, and pass to the Halls\nof Mandos to wait until they are released or the world ends.\n\n\nTerms\n\nThe Elves called the race of Men (in Quenya) _Atani_, meaning “Second\nPeople”, but also _HILDOR_ (Aftercomers), and _FÍRIMAR_ (Mortals) or\n_ENGWAR_ (the sickly).  They were also called the Usurpers, the\nStrangers, the inscrutable, the Self-cursed, the Heavyhanded, the\nNightfearers and THE CHILDREN OF THE SUN.  The name _Atani_ became\n_EDAIN_ in Sindarin, but this term was later applied only to those Men\nwho were friendly to the Elves.\n\nTerms used in the First Age to refer to Men who were not Edain were\n_RHEVAIN_ and ''HRAVANI,''' ''_'which both translate to 'the Wild'. The\n“Black Men” and the “Swarthy Men” (who would become known as the\n_Haradrim_ and the _Easterlings__, ''respectively) were both held to be\nethnicities of this distinction.\n\n\nGroups and alignments\n\nAlthough all Men of Middle-earth were related to one another, there were\nmany different sunderings and cultures. The most important group in the\ntales of the First Age were the Edain. Although the word Edain refers to\nall Men, the Elves use it to distinguish those Men who fought with them\nin the First Age against Morgoth in Beleriand from others.\n\nThose Men who fought with them against Morgoth in the First Age were\ndivided into three Houses. The First House of the Edain was the House of\nBëor, and entered Beleriand in FA 305 and were granted the fief of\nLadros in Dorthonion by Finrod Felagund. The Second House of the Edain,\nthe Haladin was led by Haldad, and later by his daughter, Haleth, and\nsettled in the Forest of Brethil. The Third House, which became the\ngreatest, was led by Marach, and later his descendant, Hador, and they\nsettled in Dor-lómin. This house was known both as the House of Marach\nand the House of Hador.\n\nOther Men didn't cross the Misty Mountains or fight against Morgoth.\nSome, such as the Easterlings, fought openly on his side. Later on, the\nHaradrim would fight on Sauron's side against the descendants of the\nEdain. Below follow short descriptions of the most important groups of\nMen in the First, Second, and Third ages.\n\nEdain and Dunedain\n\n\n\nFor their services and assistance rendered to the Elves and the Valar in\nthe War of Wrath at the end of the First Age, the Edain were rewarded\nwith a new land of their own between Middle-earth and the Undying Lands.\nThis was the island of Númenor, an island far away from the evil of\nMiddle-earth.\n\nThe Edain were led to this island by Elros with the help of his father\nEärendil, who sailed the heavens as the bright star of the same name.\nOnce there Elros became the first king of Númenor as Tar-Minyatur and\nthe Edain became known as the Dunedain (Sindarin for _Men of the West_).\nThe kingdom of Númenor grew steadily in power and the Dunedain became\nthe noblest and highest of all Men on Arda. Allied to the Elves, Númenor\nfought against Morgoth's lieutenant Sauron.\n\nNow that the Men of the West had become powerful they came to resent the\nGift of Men, Death. They wanted to become immortal like the Elves, and\nenjoy their accumulated power for all time. The Numenoreans turned away\nfrom the Valar, began to call the Gift of Men the _Doom of Men_ and\ncursed the Ban of the Valar which forbade them to sail west beyond sight\nof Númenor or to enter Valinor. In SA 2899 Ar-Adûnakhôr became the first\nking of Númenor who took his royal name in Adûnaic, the language of Men\ninstead of Quenya, the language of the Elves. This led to civil war in\nNúmenor.\n\nThe people of Númenor were divided into two factions: the KING'S MEN,\nwho enjoyed the support of the King and the majority of the people. They\nfavoured Adûnaic as language. The minority faction, the FAITHFUL, were\nled by the lord of Andúnië, the westernmost province of Númenor, and\nfavoured Quenya. Sauron who by the second millennium of the Second Age\nwas nearly defeated by the Elves and Numenoreans, took advantage of the\ndivision. He surrendered to the last Númenórean King, Ar-Pharazôn and\nworked his way into the King's counsels. Ultimately, Sauron advised him\nto attack Valinor and claim immortality. This he foolishly did, and as a\npunishment Númenor, the island of the Men of the West fell and only the\nFaithful escaped and founded the twin kingdoms of Gondor and Arnor.\n\nBlack Numenoreans and Haradrim\n\nBefore the fall of Númenor, however, as it was growing in naval power,\nmany Numenoreans sailed east and founded colonies in Middle-earth. In\nthe second millennium of the Second Age there was an exodus of Men from\novercrowded Númenor. The King's Men migrated because they wanted to\nconquer more lands, and the Faithful because they were persecuted by the\nKings. The Faithful settled in Pelargir and the King's Men settled in\nUmbar. When Númenor was destroyed the King's Men became known as the\nBlack Numenoreans and remained hostile against the Faithful of Gondor.\nFrom their ranks Sauron recruited the kings who would become the nine\nRingwraiths in the second millennium of the Second Age. Umbar was\nconquered by Gondor in TA 933.\n\nAmong the Black Númenórean race was the wicked Queen Berúthiel, wife of\nTarannon Falastur, King of Gondor.\n\nFurther east of Umbar another group of Men lived, the HARADRIM. They\nwere dark skinned Men and waged war on great Oliphaunts or _Mûmakil_.\nHostile to Gondor, they were subdued in TA 1050 by Hyarmendacil I.\n\nBoth Umbar and the Harad were left unchecked by Gondor's waning power by\nthe time of the War of the Ring, and presented grave threats from the\nsouth. Many Haradrim fought with Sauron's forces in Gondor in that War.\n\n    _See also_: Southrons\n\nCORSAIRS Pirates who hail from the havens of Umbar are masters of the\nsea and ships. Although they were due to fight for Sauron in the Battle\nof the Pelennor Fields, they were mysteriously delayed and their ships\nwere hijacked by the Dead Men of Dunharrow. After the fall of Sauron,\nthe corsairs were not even punished by the West because they were\nmercenaries.\n\nVARIAGS Although Variags do not appear in the films, it is confirmed\nthat they came from Khand, south of Rhun . They were excellent horsemen\nand, like the Easterlings, they had wains. They had brown skin and\nhandlebar mustaches and chest-length beards.\n\nEasterlings\n\n\n\nMost of the Men who fought in the armies of Morgoth and Sauron were\nEasterlings, who came from the region around the Sea of Rhûn. Some\nEasterlings offered their services to the elvish kingdoms in Beleriand,\namong them were BÓr and his sons and Ulfang the Black and his sons. This\nproved to be disastrous for the Free Peoples in the Nirnaeth Arnoediad\nwhen Ulfang and his clan switched sides and defected to Morgoth, while\nBor and his sons died bravely fighting on the side of the Elves.\n\nAfter Morgoth's defeat Sauron extended his influence over the\nEasterlings and although Sauron was defeated by the Last Alliance of\nElves and Men at the end of the Second Age, the Easterlings were the\nfirst enemies to attack Gondor again in TA 492. They were soundly\ndefeated by King Rómendacil I, but invaded again in TA 541 and took\nrevenge by slaying King Rómendacil. Rómendacil's son Turambar took large\nportions of land from them. In the next centuries Gondor held sway over\nthe Easterlings. When Gondor's power began to decrease in the twelfth\ncentury Third Age, the Easterlings took the complete eastern bank of the\nAnduin except Ithilien crushing Gondor's allies, the Northmen.\n\nThe Easterlings of the Third Age were divided in different tribes, such\nas the Wainriders and the Balchoth. The Wainriders were a confederation\nof Easterlings which were very active between TA 1856 and TA 1944. They\nwere a serious threat to Gondor for many years, but were utterly\ndefeated by Eärnil IIin1944. When Gondor lost its royal dynasty in TA\n2050 the Easterlings started to reorganize themselves and a fierce tribe\ncalled the Balchoth became the most important tribe. In TA 2510 they\ninvaded Gondor again and conquered much of Calenardhon, until they were\ndefeated by the Éothéod, coming to Gondor's aid.\n\nUntil the War of the Ring, the Easterlings didn't launch any further\ninvasion. During the War of the Ring, they were amongst the fiercest\nwarriors deployed at the Battle of the Pelennor Fields by Sauron\nhimself.\n\nNorthmen\n\n\n\nThe Northmen were composed of two principal groups. First, not all the\nMen who remained east of the Blue Mountains and Misty Mountains were\ntempted by Morgoth or Sauron. They were joined after the War of Wrath by\nthose of the Edain who did not wish to travel to Númenór (similar to\nhow, at the end of the first age, various eldar remained and went east,\nbecoming lords of the silvan elves). The Northmen who dwelt in Greenwood\nthe Great and other parts of Rhovanion were friendly to the Dunedain,\nbeing for the most part their kin, and many of them became Gondorian\nsubjects. The Men of Dale and Esgaroth were Northmen, as were the\nWoodmen of Mirkwood, and the Éothéod, who became the Rohirrim.\n\nDunlendings and Drúedain\n\n\n\nWhen Elendil founded the Kingdom of Arnor its borders were quickly\nextended towards the river Greyflood (Sind:_Gwathló_), and Gondor\nlikewise extended up through Enedwaith. In Enedwaith (Middle-land) and\nMinhiriath (Sindarin for _Land between the Rivers_) lived a group of Men\nrelated to those Men that became the House of Haleth, and they were\nknown as the Dunlendings. They had lived in the great woods that covered\nmost of Eriador, and when the Numenoreans started to chop these woods\ndown to build their ships in the Second Age, the Dunedain of Númenor\nearned the hostility of the Dunlendings. The Dunlendings later became\nbitter enemies of Rohan. The Dunlendings served Saruman in the War of\nthe Ring and participated in the Battle of the Hornburg.\n\nAnother group of Men were the Woses or Druedain. They were small and\nbent compared to other Men. The Woses had brown to black skin. They\nlived among the House of Haleth in the First Age, and were held as Edain\nby the Elves, who called them _Drúedain_ (from _Drûg_, their own name\nfor themselves, plus _Edain_). At the end of the Third Age some Woses\nlived in the Drúadan forest, small in number but experienced in wood\nlife. They held off orcs with poisoned arrows and were vital in securing\nthe aid of the Rohirrim in the Battle of the Pelennor Fields. King\nElessar granted the Drúadan Forest “forever” to them in the Fourth Age.\n\n\nNotable Men\n\nFirst Age\n\n-   Beren, son of Barahir\n-   Bëor the Old\n-   Haleth, daughter of Haldad\n-   Hador, son of Hathol\n-   Galdor, son of Hador\n-   Húrin, son of Galdor\n-   Túrin Turambar, son of Húrin\n-   Tuor, son of Huor\n\nSecond Age\n\n-   Elros Tar-Minyatur, son of Eärendil (Half-elven)\n-   Elendil, son of Amandil\n-   Isildur, son of Elendil\n-   Anárion, son of Elendil\n-   Tar-Minastir, the eleventh King of Númenor\n-   Ar-Pharazôn the Golden, the last King of Númenor\n\nThird Age\n\n-   Bard the Bowman, slayer of the dragon Smaug and king of Dale\n-   Hyarmendacil I, son of Ciryandil, perhaps the greatest king Gondor\n    has had until Elessar\n-   Aragorn II Elessar, son of Arathorn\n-   Denethor II, and his sons Boromir and Faramir\n-   Boromir, son of Denethor II\n-   Faramir, son of Denethor II\n-   Théoden, son of Thengel\n-   Éomer, nephew and heir of Théoden, and his sister Éowyn\n-   Gríma Wormtongue, counsellor of Edoras\n-   Mouth of Sauron, Lieutenant of Barad-dûr",
    "other_names": "Atani, Secondborn, Hildor, Apanónar",
    "origins": "Children of Ilúvatar",
    "languages": "Westron, Adûnaic, Rohirric, Dalish, Rhûnic, Harad, Black Speech",
    "characters": "Bëor, Hador, Barahir, Beren, Húrin, Morwen, Túrin, Niënor, Tuor, Elros, Ar-Pharazôn, Elendil, Isildur, Bard, Denethor, Boromir, Faramir, King Theoden, Eomer, Eowyn, Aragorn",
    "lifespan": "ordinary Men - c. 80-100 years, Numenoreans - c. 300-350 years, Kings of Númenor - c. 400-500 years, Dunedain - c. 150-250 years, Hobbits - c. 100 years, Drúedain - shorter",
    "distinctions": "Mortality, rulers of Middle-earth",
    "height": "Nigh seven feet",
    "skin_color": "White, brown, black",
    "hair_color": "Black, brown, blond, red, and (when older) grey or white",
    "locations": "Hildórien, Beleriand, Numenor, Gondor, Arnor, Rohan, Dunland, Harad, Khand, Forochel, Rhûn, Harad, Rhovanion"
  },
  {
    "name": "Hobbits",
    "lotr_page_id": "61",
    "text": "HOBBITS, also known as HALFLINGS, were an ancient mortal race that lived\nin Middle-earth. Although their exact origins are unknown, they were\ninitially found in the northern regions of Middle-earth and below the\nVales of Anduin. At the beginning of the Third Age, Hobbits moved north\nand west. Most of their race eventually founded the land of the Shire in\nabout the year TA 1601, though one type of Hobbit known as _Stoors_\nremained in the Anduin Vale (the type of Hobbit Sméagol was).\n\n\nHistory\n\nThe exact origins of the Hobbits are unknown and it is also unknown what\nAge the Hobbits first appeared. Hobbits are known to have originated\nsomewhere in the Valley of the Anduin River. During their early history,\nthere were three sub-species of Hobbit. By the time they were discovered\nby the other peoples of Middle-earth, they had already been around for\nmany generations. The earliest known group of hobbits lived in the\nValley of Anduin, in the region of Wilderland between Mirkwood and the\nMisty Mountains. According to The Lord of the Rings, they have lost the\ngenealogical details of how they are related to the Big People. At this\ntime, there were three breeds, or tribes, of Hobbits, with different\nphysical characteristics and temperaments: Harfoots, Stoors and\nFallohides. While situated in the valley of the Anduin River, the\nHobbits lived close by the Éothéod, the ancestors of the Rohirrim, and\nthis led to some contact between the two. As a result, many old words\nand names in “Hobbitish” are derivatives of words in Rohirric.\n\nAbout the year TA 1050, they undertook the arduous task of crossing the\nMisty Mountains. Reasons for this trek are unknown, but it possibly had\nto do with Sauron's growing power in nearby Greenwood, which was later\nnamed _Mirkwood_ because of the shadow that fell on it, as Sauron was\nsearching the area for the One Ring. The Hobbits took different routes\nin their journey westward, but as they began to settle together in\nBree-land, Dunland, and the Angle formed by the rivers Hoarwell and\nLoudwater; the divisions between the Hobbit-kinds began to blur.\n\nIn the year 1601 of the Third Age, two Fallohide brothers named Marcho\nand Blanco gained permission from the King of Arnor at Fornost to cross\nthe River Baranduin and settle on the other side. Many Hobbits followed\nthem, and most of the territory they had settled in the Third Age was\nabandoned. Only Bree and a few surrounding villages lasted towards the\nend of the Third Age. The new land that they founded on the west bank of\nthe Brandywine was called the Shire. The crossing of the Brandywine, as\nthe hobbits called it, was the event that led to the settlement of the\nShire, thus the Shire Reckoning began. Originally, the Hobbits of the\nShire swore nominal allegiance to the last Kings of Arnor, being\nrequired only to acknowledge their lordship, speed their messengers, and\nkeep the bridges and roads in repair. During the final fight against\nAngmar at the Battle of Fornost, the Hobbits maintain that they sent a\ncompany of archers to help, but this is recorded nowhere else. After the\nbattle, the kingdom of Arnor was destroyed, and in absence of the king,\nthe Hobbits elected a Thain of the Shire from among their own\nchieftains.\n\nThe first Thain of the Shire was Bucca of the Marish, who founded the\nOldbuck family. However, the Oldbuck family later crossed the Brandywine\nRiver to create the separate land of Buckland and the family name\nchanged to the familiar “Brandybuck”. Their patriarch then became Master\nof Buckland. With the departure of the Oldbucks/Brandybucks, a new\nfamily was selected to have its chieftains be Thain: the Took family\n(Indeed, Pippin Took was son of the Thain and would later become Thain\nhimself). The Thain was in charge of Shire Moot and Muster and the\nHobbitry-in-arms, but as the Hobbits of the Shire led entirely peaceful,\nuneventful lives, the office of Thain was seen as something more of a\nformality. The major political power in the Shire was actually held by\nthe Mayor of Michel Delving (the Shire's chief township). His duties\nincluded overseeing the post and the “police” force (Shirriffs); he was\nalso obliged to preside at banquets. The Hobbits' numbers dwindled, and\ntheir stature became progressively smaller after the Fourth Age.\nHowever, they are sometimes spoken of in the present tense, and the\nprologue “Concerning Hobbits” in _The Lord of the Rings_ states that\nthey have survived into Tolkien's day.\n\n\nTypes of Hobbits\n\n-   The Harfoots were the most common Hobbits. They were smaller and\n    shorter than the other kinds and had browner skin. They did not grow\n    beards and rarely wore shoes or boots. They were skilled with their\n    hands and feet and preferred hillsides and highlands to live in. In\n    ancient times, they had frequent contact with the Dwarves of\n    Middle-earth and lived in the foothills of the mountains for a long\n    time. While the other varieties of Hobbits were still in the\n    Wilderland, the Harfoots moved west, travelling across Eriador as\n    far as Weathertop.\n\n&nbsp;\n-   The Stoors often chose to live near water or on flat land. They were\n    broader and heavier in build than the other Hobbits and their feet\n    and hands were larger. They were the most reluctant variety of\n    Hobbit to leave the River Anduin, where some Stoors continued to\n    stay. Others travelled west after the Harfoots and followed the\n    River Loudwater southward. Many of the Stoors settled between\n    Tharbad and the borders of Dunland before they continued north.\n\n&nbsp;\n-   The Fallohides, who preferred trees and woodland, were the least\n    common variety of Hobbits. They had fairer skin and hair and were\n    taller and slimmer than the others. They also had better relations\n    with the elves of Middle-earth, were more skilled with language and\n    song, and preferred hunting to tilling. They crossed the mountains\n    north of Rivendell and then followed the River Hoarwell.\n\nAlthough the Hobbits took different routes west, they eventually arrived\nin a land between the River Baranduin (which they renamed the\nBrandywine) and the Weather Hills. There, they founded many settlements,\nand the divisions between the varieties of Hobbits began to blur. By TA\n3001, the Hobbits of the Shire included families of Bagginses, Boffins,\nTooks, Brandybucks, Grubbs, Chubbs, Hornblowers, Bolgers, Bracegirdles,\nand Proudfoots.\n\nOriginally, Fallohides were often found as leaders among clans of the\nother Hobbits. Around the year TA 1600, two Fallohide brothers, Marcho\nand Blanco, decided to journey across the River Brandywine and settle on\nthe other side. Large groups of Hobbits followed them, and most of their\nformer territory was depopulated. The Hobbits who had left called their\nnew home the Shire.\n\nThe Hobbits of the Shire originally swore their allegiance to the last\nKings of Arnor. However, after the Battle of Fornost, the kingdom of\nArnor was destroyed. To replace the king's authority and leadership, the\nHobbits elected their first Thain of the Shire, Bucca of the Marish,\nfrom among their own chieftains. The Thain was responsible for mustering\nthe Shire-Moot and -Muster, and leading the Hobbitry-in-arms in\nemergency situations. However, conflict rarely threatened the Hobbits of\nthe Shire, and the Thain usually had no need to exercise his\nauthority.\n\n\nAge and appearance\n\n\n\nMost Hobbits lived longer than Men, a race of which they might have been\nan off-shoot. The average lifespan of a Hobbit was about 100 years,\nthough it was not unusual for a Hobbit to live as many as three decades\nbeyond that. The time at which a young Hobbit matured and was accepted\nas an adult was 33, compared to a Man's 18 years. Thus, a 50-year-old\nHobbit would only be middle-aged. The most distinguishing feature of\nHobbits was their short stature. They were smaller than Dwarves and were\nusually between two and four feet in height. With the gradual passing of\ntime, Hobbits became even shorter. By the Third Age, they were usually\nless than three feet tall. Hobbits' ears were slightly pointed and their\nfurry feet had leathery soles, so they generally didn't need (and rarely\nwore) shoes or boots. Tolkien wrote that a typical Hobbit had a “round,\njovial face; ears only slightly pointed and 'elvish'.” Hobbits were\nskilled listeners and had good eyesight. Although they were inclined to\nbe fat and did not hurry unnecessarily, they were also nimble and deft\nin their movements. In _The Hobbit_, Bilbo manages to sneak up on the\nTrolls without them hearing him because he, like all Hobbits, could walk\naround very quietly. The Hobbits who lived in the Shire dressed in\nbright colors and were fond of yellow and green. Their hair usually\nranges from a light or dark brown to blonde or a golden red and is\nalmost always curly.\n\n\nCulture\n\nMost Hobbits enjoyed farming, food, ales, parties and the giving and\nreceiving of presents. They were usually friendly and happy-go-lucky,\nalthough they were often shy of Men. Hobbits preferred a quiet, normal,\nand peaceful life, which is why Gandalf was frowned upon sometimes,\nbecause he brought adventure to Bilbo. Many of them had seen him\nreturning from his long journey to the Lonely Mountain (the journey told\nof in _The Hobbit_) with his steed laden with great chests of gold. They\nalso have developed a keen taste in the smoking of Pipe-weed and blowing\nsmoke rings. This was first started by Tobold Hornblower of Longbottom\nin the Southfarthing. They were very ignorant and knew little of the\nhappenings of the world. They dwelt in Hobbit-holes (known also as\nSmials).\n\nHobbits, particularly those of the Shire are very insular and suspicious\nof other people from other places and anything that disturbs the peace.\nHobbits refer to people outside the Shire as OUTSIDERS, being a very\nbroad term, were simply those foreign to any region.\n\nSpeech\n\nIn ''The Hobbit ''and _The Lord of the Rings_, the vernacular of the\nShire is the Common Speech. Some names of families and locations\noriginated from variants and contractions of Mannish words (e.g.\n_Holman_ Cotton's name simply meaning “hole-man”), if not simply\nindividual or contractions of English words (e.g. _Bracegirdle_,\n_Cotton_, _Daisy_, _Bowman_, _Ruby_). The Stoors, however, who in early\ntimes did not dwell in the Shire, are said to have probably adopted\nspeech similar to Dunlendish. \n\nThe only occurrences of Hobbits speaking in other tongues as if\nnaturally are the times in _The Return of the King_ when Frodo and Sam\nfind themselves invoking Elbereth out loud, or when Frodo cries the\nQuenya phrase ''Aiya elenion ancalima! ''to break the spell of the\nWatchers at the Tower of Cirith Ungol. \n\nLifestyle\n\n\n\nHobbits are fond of an unadventurous bucolic life of farming, eating,\nand socializing. According to Jackson's trilogy, they enjoy seven meals\na day, when they can get them: breakfast, second breakfast, elevensies,\nluncheon, afternoon tea, dinner, and, later in the evening, supper. In\nthe book, however, supper is simply an alternative name for dinner;\nBilbo only served three official meals at his Birthday Party: lunch,\ntea, and dinner (or supper). They like simple food such as bread, meat,\npotatoes, and cheese, and also like to drink ale, often in inns — such\nas the English country folk, who were Tolkien's inspiration. They have\nalso been known to have a particular fondness for cake. The name Tolkien\nchose for one part of Middle-earth where the Hobbits live, “The Shire”,\nis clearly reminiscent of the English Shires. Hobbits also enjoy smoking\nherbs, which they refer to as “pipe-weed”, out of long wooden pipes.\nThis can be attributed to their love of gardening and herb-lore (as\nexemplified by Sam Gamgee). Another interesting fact is that hobbits\nhave an inordinate liking of mushrooms, prizing them above many other\nfoods. A common pursuit for younger hobbits is mushroom-hunting, and\nFrodo Baggins said he had stolen Farmer Maggot's mushrooms on at least\none occasion. Some Hobbits live in hobbit-holes, known as “smials” which\nresembled the characteristics of the original places where they dwelt\nunderground. They were found in hillsides, downs, and banks. By the late\nThird Age, only rich and poor hobbits continued to live in smials; the\nmiddle-class hobbits usually lived in large, low buildings, like Brandy\nHall. Almost every building in the Shire has round doors and windows, a\nfeature more practical to tunnel-dwelling that the Hobbits retained in\ntheir later structures.\n\nAlthough Hobbits are a peaceful people, who usually shun fighting, they\nare also, as a race, uncanny marksmen adept with missile weapons of all\nkinds, from throwing stones to slings and bows - hence the company of\narchers purportedly sent to aid the Arnorians at the Battle of Fornost.\nShire lore says that squirrels, rabbits, and other garden pests have\nlearned to run away quickly if a hobbit so much as reaches for a pebble.\n\n\nAppearance\n\nIn the prologue to The Lord of the Rings, Tolkien said that Hobbits are\nbetween two and four feet (0.6m-1.2m) tall, the average height being\nthree feet six inches. In another instance Tolkien described hobbits as\nbeing “between 3 and 4 feet tall, never less and seldom more”. They are\nnot quite as stocky as the similarly-sized dwarves, but still tend to be\nstout, with slightly pointed ears. Tolkien says the following of the\nHobbit Bilbo Baggins:\n\n“I picture a fairly human figure, not a kind of fairy rabbit as some of\nmy British reviewers seem to fancy: fat in the stomach, shortish in the\nleg. A round, jovial face; ears only slightly pointed and 'elvish'; hair\nshort and curling (brown). The feet from the ankles down, covered with\nbrown hairy fur that are extremely small. Clothing: green velvet\nbreeches; red or yellow waistcoat; brown or green jacket; gold (or\nbrass) buttons; a dark green hood and cloak (belonging to a dwarf).”\n\nIn the Prologue to _The Lord of the Rings_, he wrote that they dress in\nbright colours, favouring yellow and green. Nowadays (according to\nTolkien's fiction), they are very shy creatures, but they are and have\nbeen capable of amazing things. Their feet are covered with curly hair\n(usually brown, as is the hair on their heads) and have leathery soles,\nso most Hobbits hardly ever wear shoes. Hobbits (Halflings) are often\ndepicted with large feet for their size, perhaps to visually emphasize\ntheir unusual nature. This is especially prominent in the influential\nillustrations by the Brothers Hildebrandt and the large prosthetic feet\nused in the films by Peter Jackson. Tolkien does not specifically give\nsize as a generic hobbit trait, but does makes it the distinctive trait\nof the Proudfoot hobbit clan. Hobbits can sometimes live for up to one\nhundred and thirty years, although their average life expectancy is one\nhundred years. The time at which a young Hobbit “comes of age” is\nthirty-three. Thus, a fifty-year-old Hobbit would only look 26–30 years\nby human standards.\n\nThe Hobbits had a distinct calendar. Every year started on a Saturday\nand ended on a Friday, with each of the twelve months consisting of\nthirty days. Some special days did not belong to any month - Yule 1 and\n2 (New Year's Eve and New Years Day) and three Lithedays in mid summer.\nEvery fourth year there was an extra Litheday.\n\n\nBirthdays\n\nThe Hobbits of the Shire developed the custom of giving away gifts on\ntheir birthdays instead of receiving them. They use the term Mathom for\nold and assorted objects, which are invariably given as presents many\ntimes over or were stored in a museum (Mathom-house).\n\nInstead of saying “one hundred and twelve” they say “eleventy two” and\nthat with every other three plus digit number (although in Jackson's\nTrilogy, Bilbo tells the party-goers that it was his One Hundred and\nEleventh Birthday).\n\n\nEtymology and Names\n\nThe name “Hobbit” is derived from the Rohirric word _Holbytla_, a word\nwhich means “Hole-builder”. In the original Common Speech, the name was\nKuduk (Hobbit), derived from the actual Rohirric Kûd-dûkan (hole\ndweller).",
    "locations": "Shire, Bree, Gladden Fields",
    "languages": "Hobbitish, Westron",
    "characters": "Marcho, Blanco, Gollum, Bandobras Took, Bilbo Baggins, Frodo Baggins",
    "lifespan": "Mature at thirty-three, generally live to be one hundred years old",
    "distinctions": "Small stature, sometimes heavy, curly hair, thick leathery soles and, hairy feet, Pointed ears compared to elves, Dwarf-like appearance due to small size and stature, Gnome-like traits since they are known to live underground",
    "height": "between 2' and 4', around 60 to 120 cm. Elsewhere noted as between 3', and 4' never less and seldom more.",
    "skin_color": "Nut-brown to White",
    "hair_color": "Typically curly brown, rarely blond (until the Fourth Age), and white, and grey in later years",
    "other_names": "Halflings"
  },
  {
    "name": "Elves",
    "lotr_page_id": "147",
    "text": "The ELVES, who called themselves the QUENDI, and who in lore are\ncommonly referred to as the '''Eldar '''(adj. _ELDARIN_), were the first\nand eldest of the Children of Ilúvatar, and are considered to be the\nfairest and wisest of any race of Arda given sapience.\n\nSome, known afterwards as the Calaquendi (Elves of the Light), were\nbrought by the Valar from Middle-earth to Valinor across the Sea, where\nthey were taught by the Ainur. But after the Silmarils were stolen by\nMelkor, some of the Elves returned to Middle-earth, where they remained\nuntil the end of the Third Age.\n\nElves do not physically age, and are not subject to illness. However,\nthey can be slain by violence or extreme negative emotion.\n\n\nHistory\n\nCreation and Awakening\n\n\n\nThe Firstborn, the Elder Children of Ilúvatar, were conceived by Eru\nalone in the third theme of Ainulindalë. They are the eldest and noblest\nof the speaking races of Middle-earth. They awoke at Cuiviénen, the\nWater of Awakening, in the far east of Middle-earth, in the starlight of\nthe Sleep of Yavanna, as the Sun and Moon had yet to be created. The\nfirst Elves to awake were three pairs: Imin (“First”) and his wife\nIminyë, Tata (“Second”) and Tatië, and Enel (“Third”) and Enelyë.\n\nAccording to legend, Imin, Tata, and Enel, and their wives joined up and\nwalked through the forests. They came across six, nine, and twelve pairs\nof elves, and each “patriarch” claimed the pairs as his folk in order.\nThe now sixty elves dwell by the rivers, and they invented poetry and\nmusic in Middle-earth. Journeying further, they came across a band of\nElves watching the stars, which Tata claims as his. These were tall and\ndark-haired, the fathers of most of the Ñoldor. The ninety-six elves now\ninvented many new words. Continuing their journey, they found\ntwenty-four pairs of elves, singing without language, and Enel added\nthem to his people. These were the ancestors of most of the Lindar or\n“singers”, later called Teleri. They found no more Elves; Imin's people,\nthe smallest group, were the ancestors of the Vanyar. All in all they\nnumbered 144. Because all elves had been found in groups of twelve,\ntwelve becomes their base number and 144 their highest number (for a\nlong time). None of the later Elvish languages had a common name for a\ngreater number.\n\nAt first the elves sang with grace and merriment without speech but soon\nthey developed speech and spoke with words, so their first name for\nthemselves was _Quendi_ (The Ones Who Speak With Voices).\n\nDiscovery and Sundering\n\nThe Elves were content and dwelt long under the stars of the forest near\nCuiviénen. However, Melkor, the Dark Lord, became aware of them and\ntheir location before the Valar, and during this time he sent evil\nspirits to spy on them and do them harm. Many of the spirits that\nharassed the Elves came in the form of great horsemen for the purpose of\ncausing the Elves to fear the Vala Oromë, whom Melkor knew would likely\nbe the first Vala to discover the Elves. And so it was that, on one of\nhis many journeys in the wilds of Middle-earth, Oromë came upon the\nElves. Due to Melkor's foresight and malice, some elves were afraid.\nHiding and fleeing, some of these early elves were taken by Melkor or\nhis agents. These elves were never seen again and were taken to Utumno,\nand were believed to be twisted and mutilated into the first Orcs.\nHowever, the Elves who stayed quickly learned that Oromë was far\ndifferent from the evils that had been pursuing them. Oromë quickly came\nto love the Elves, and them and gave them the name _Eldar_ (People of\nthe Stars).\n\nOromë spent some time with them and then returned to Valinor to tell\nManwë of his discovery. He then returned to live with elves for a time,\nlearning about them. Not long after, the Valar decided that, for the\ngood of the Elves, that Melkor needed to be overthrown. The Valar made\nwar upon Melkor and set a guard on Cuiviénen. The elves knew nothing of\nthe war save that the earth shook and thunderous lightning was seen in\nthe north. After a long, grievous war, the Valar were triumphant, and\nMelkor was imprisoned. Oromë then returned to the Elves with a summons\nof the Valar to Aman. However, many of the Elves were afraid, as they\nfelt and seen rumor of the terrible power of the Valar as they made war\nagainst Melkor. As such, the it was decided by the Elves to choose\nambassadors one from each kindred to go to Valinor and report back to\ntheir kindred what they saw. The names of these representatives were\nIngwë, Finwë, and Elwë.\n\nWhen the three returned, they spoke to their people of the beauty and\nbliss of what they had seen and urged them to travel to Valinor and\nabide there. Thus began the Great Journey, also known as the Sundering\nof the Elves. All of the elves agreed, save for the Avari, who chose to\nremain in Middle-earth. Led by Oromë, the elven kindreds marched out of\nCuiviénen but as they moved out of the forest area and saw the black\nclouds surrounding the north where Melkor had once lived, some grew\nafraid and turned back to Cuiviénen. The rest continued, albeit slowly,\noften stopping until Oromë returned, but were curious about what they\nsaw.\n\nThe Vanyar and the Ñoldor, who were most eager to reach Valinor pressed\non with the greatest speed and were the first to reach the coasts and to\nbe taken to Valinor on an island that the Vala Ulmo guided across the\nBelegaer. The Teleri were the slowest of the groups as they were drawn\nto what they had seen and encountered in the western and southern parts\nof Middle-earth. This caused them to separate into several different\ngroups, such as the Nandor who became Wood-elves of the Wilderland and\nlater the Beleriand. Some of the Teleri who did not like the seas and,\npartly due to the disappearance of Elwë in Nan Elmoth for a time, drew\nback and settled in the wooded areas of Region and Neldoreth that later\nbecame Doriath. The Teleri that were drawn to the sea settled along the\nwestern shores later becoming the Falathrim ruled by Círdan, who founded\nthe coastal cities of Eglarest and Brithombar. Eventually, most of the\nTeleri went into the west.\n\nLife in Aman\n\nThe elves that came to Aman were enriched by the knowledge of the Valar\nand the bliss of their lands, and the three Elven clans developed their\nown cultures. The former ambassadors Ingwë of the Vanyar and Finwë of\nthe Ñoldor became kings of their people and, as Elwë never returned to\nValinor, his brother Olwë became Lord of the Teleri. The Vanyar were\ndrawn to the Valar and the full light of the Two Trees of Valinor and\nsettled at the foot of Taniquetil with their king Ingwë, who became High\nKing of the Elves revered by all Elves living in the mountain below\nManwë. The Ñoldor, beloved by Aulë the Smith for their love of arts and\ncrafts, built the great city of Tirion on Túna where Finwë, the High\nKing of the Ñoldor, lived. The Teleri were drawn to sea and some never\nleft the island ferry of Tol Eressëa until Olwë their lord later built\nAlqualondë, with the help of the Ñoldor.\n\n\n\nThey developed writing and the arts of building, metallurgy, arts and\ncrafts, and shipbuilding. Things like high culture, poetry, and many of\nthe more subtle things were valued as well. For three ages, the Elves\nlived in total peace and bliss wandering the lands and beautifying its\nglory. Unfortunately, after three ages of imprisonment, Melkor completed\nhis sentence. He feigned rehabilitation, and convinced Manwë that he was\nno longer a threat. However, his stay in prison had only increased his\nmalice, and remembering that it was for the sake of the Elves that he\nhad been overthrown, he sought to poison the peace of Valinor and bring\nruin to the Elves. Adopting a fair and wise form, he began to cultivate\nthe trust of those living in Valinor. Of the three Elven clans, Melkor\nsaw the Teleri as being rather useless to him, and the Vanyar would have\nnothing to do with him, being content in their development. But the\nÑoldor, desiring more knowledge, were willing to listen to him, and\nMelkor saw that, due to their creative skill, they were more potentially\nuseful than the Teleri. And so Melkor began to teach them, and for a\nlong while none of his evil was made manifest, for any who sought his\naid and counsel benefited greatly from it. But with his genuine\nteachings came half-truths and disguised lies regarding the intentions\nof the Valar. Most harmful among these was the knowledge that Men, the\nSecond Children of Illuvatar, would one day appear in Middle-earth. The\nValar had not revealed this to the Elves, and after a time, rumors began\nto circulate amongst the Ñoldor that the Valar had brought them to Aman\nso that Men might inherit Middle-earth and usurp the glory that might\nhave belonged to the Elves. Chief amongst these discontented Elves was\nFëanor, the firstborn son of Finwë, King of the Ñoldor. Fëanor was\ngifted beyond virtually all of his peers in terms of beauty, skill,\nsubtlety, and craftsmanship. It was he who had developed, amongst many\nother wonders, the system of letters used by the Ñoldor. But his\ngreatest creation had been the Silmarils, three diamond-like gems in\nwhich the intermingled light of the Two Trees of Valinor had been\ncaptured.\n\nHowever, despite Fëanor's capabilities (or perhaps because of them), he\nwas exceedingly arrogant, and his actions were often rashly conducted.\nHe hated and feared Melkor, but unwittingly provided his lies with their\nmost prominent voice. Eventually, Melkor's lies and Fëanor's own vanity\nresulted in him drawing his sword against his half-brother Fingolfin.\nThe Valar had, up until this, been troubled by the unrest of the Ñoldor,\nbut had simply watched and waited. Now however, with the peace of\nValinor having been violated, they could no longer ignore the issue.\nFëanor was brought to Máhanaxar and told to explain himself. With this,\nthe lies of Melkor were at last laid bare, and he fled before the Valar\ncould recapture him. However, for his actions, Fëanor was banished from\nTirion for a time. Twelve years later, Manwë sought to heal the wounds\nbetween the Ñoldor at a festival held in Valmar, but Melkor and the\nGreat Spider Ungoliant destroyed the Two Trees, darkening Valinor,\nkilling Finwë, stealing the three Silmarils of Fëanor, and fleeing to\nMiddle-earth.\n\nRevolt of Ñoldor\n\nWhen the tragic death of his father became known, the wrath of Fëanor\ncould no longer be contained. He gathered all the Ñoldor in Tirion and\nbeneath the Tower of Mindon he urged the Ñoldor to return to\nMiddle-earth in pursuit of Melkor and the Silmarils swearing an oath to\nwar with Melkor, now known as Morgoth. After being banned by the Valar\nfor the rebellion and the violent deeds of the House of Fëanor, the\nÑoldor returned to Middle-earth as exiles to battle Morgoth, and to\nestablish and rule realms of their own.\n\nThe War of the Jewels\n\n\n\nThe crimes of Melkor in Aman and the subsequent rebellion of the Ñoldor\nstarted a centuries-long war that would come to involve all the Elven\nkindreds of Middle-earth, as well as other races, directly or\nindirectly. During this time, five great battles were fought against\nMorgoth and although many were victorious for the elves and their\nallies, the ultimate result was disastrous. Additionally, the doom that\nfollowed the Ñoldor as a result of the Kinslaying of Alqualondë was\ndiscovered by Thingol, the King of Doriath and High King of the Sindar.\nThis discovery all but destroyed the relationship between the Sindar and\nthe Ñoldor. There were also other elves and races such as the\nPetty-dwarves that resented the exiled Ñoldor for usurping their\nrightful place in Middle-earth.\n\nThough for hundreds of years, the Ñoldor elves fought and endured the\nforces of Morgoth with little military aid from the other Elven\nkindreds, a common fear and a common foe allowed for the Elves\n(especially the Ñoldor) to mingle with mortal Men, who had recently come\ninto the Beleriand from the east. The first of these were the Three\nHouses of the Edain. They were followed by the Easterlings, some of whom\nserved Morgoth. At first only the Ñoldor had dealings with Men, as the\nother elves feared them, but over the generations men served the Ñoldor\nand gained their respect. After the Quest for the Silmaril, the blood of\nthe Eldar and the Edain mingled with each other, first through the\nmarriage of Beren and Lúthien, and then through Tuor and Idril.\nThis union would create a bond that would enrich and ennoble both\nkindreds from then to later ages.\n\n\n\nThe terrible Oath of Fëanor created strife between the Elven kindreds,\nas even those not bound were drawn into it over the Silmaril recovered\nby Beren and Lúthien. The two brothers Celegorm and Curufin attempted to\nusurp the throne of Nargothrond after the loss of Finrod in the Quest\nfor the Silmaril, but were thwarted by the hound Huan and Orodreth and\nexpelled. It was because of this deed that the Ñoldor of Nargothrond\nlent little aid to the Union of Maedhros during the Nirnaeth\nArnoediad. Twice in the latter half of the First Age, the Sons tried\nto take the Silmaril from those who inherited it. These acts of cruelty\nand violence against their Elven kin caused great loss of life and\nresulted in the deaths of all of them except Maglor, who now wanders the\ncoasts of Middle-earth singing about the suffering of the Ñoldor.\n\nLater Days and Decline\n\n\n\nAfter the destruction of Beleriand in the War of Wrath, the remaining\nÑoldor repented of their rebellion and many returned to Eldamar along\nwith some of the Sindar. The elves that chose to remain in Middle-earth\nfounded peaceful realms. Most of the Ñoldor lived in Lindon with\nGil-galad, the High King of the Ñoldor. Hundreds of years later\nCelebrimbor, the last of the House of Fëanor, founded a new Ñoldorin\nrealm called Eregion. The Sindar joined also with Gil-galad in Lindon\nand few went beyond the Misty Mountains into Wilderland, becoming\nleaders of the Silvan Elves in places such as Lothlórien and Greenwood\nthe Great.\n\nThe Elven realms flourished for over one thousand years until SA 1200\nwhen Sauron, under the guise of a messenger from the Valar, appeared out\nof the East to offer knowledge to the elves. Gil-galad mistrusted him\nand barred him from his kingdom. Sauron then approached Celebrimbor and\nthe Elves of Eregion, and against Gil-galad's advice they accepted him\nand his knowledge. With Annatar's help, Celebrimbor forged the Rings of\nPower, but Three Rings alone were made in secret by Celebrimbor and were\nnot directly touched by Sauron's power. Then, Sauron forged the One Ring\nin order to control the others. The elves discovered Sauron's plan and\ntook off their rings. Celebrimbor sent the ring Nenya to Galadriel and\nsent Vilya and Narya to Gil-galad in Lindon.\n\n\n\nFurious that the elves had foiled his plans for domination, Sauron\ndemanded the return of the rings and when they refused he prepared for\nwar. For eight years, Sauron laid waste to Middle-earth in his war\nagainst the Elves, destroying Eregion and killing Celebrimbor.\nEventually, with help of the Numenoreans, Gil-galad was able to lead the\nelves to victory. Gil-galad then decided to abandon Eregion in favor of\nthe new refuge of Rivendell formed at the foothills of the Misty\nMountains and he made his herald, Elrond, the Lord of Rivendell and his\nrepresentative in Eriador. Lindon survived still as the greatest kingdom\nof elves in Middle-earth. The rest of the elves of Middle-earth who\nsurvived either moved to Lindon, sailed for the West, or continued to\nlive in their lands under caution due to the continued threat from\nSauron.\n\nBy the latter half of the Second Age, Men continued to spread and grow\nin Middle-earth. The Faithful from the Downfall of Númenór founded the\ngreat mannish kingdoms of Arnor and Gondor. Though Men were set to\nsupplant them in Middle-earth, the Elves were powerful and numerous\nenough to join with Men one last time to defeat Sauron. Gil-galad led\nthe second greatest host of elves ever seen in Arda and formed the Last\nAlliance with Elendil, High King of all Dunedain, and vanquished Sauron\nin SA 3441.\n\nWith the Dominion of Men at hand, the Elves became less numerous and\nmore secluded with many becoming wearier of the now mortal lands. Only\nthe realms of Lindon, Lothlórien, and Rivendell survived as havens of\nElven bliss. High Elves continued to live in Lindon but most sailed into\nthe West after their king's death. The last of the High Elves left\nMiddle-earth after the final defeat of Sauron in the War of the\nRing.\n\n\n\nBeing immortal, Elves will continue to live in the world until its\ncompletion. Elves living in Aman live in a state of blissful happiness\nas they did before the Revolt of the Ñoldor. Elves that never chose to\nsail into Utter West instead choosing to remain in Middle-earth in\nplaces such as the Woodland Realm in the former Mirkwood, would probably\nbecome more and more secretive, less numerous, and hidden. Eventually,\nthese Lingerers would fade away entirely as their bodies were consumed\nby the power of their spirits. Now, in the sixth/seventh age, they are\nnothing more than empty souls, invisible and with no real conscience.\n\n\nSunderings\n\n\n\nWhen the elves were first summoned to Aman by the Valar, they became\ndivided into two groups - the Eldar (Quenya Tengwar: full spelling or\nvowel-abbreviated spelling ; IPA: ; singular ELDA; ; adjectival ELDARIN;\nor ; ), who accepted the summons of the Valar and undertook the Great\nJourney, and the Avari, who refused the summons and became the lesser\nelves. The elves flourished in the First Age, but the Eldarin realms of\nBeleriand were destroyed by Morgoth, and in later ages their power\nwaned. In the Second and Third Ages some Elves still lived in Wandering\nCompanies, traveling through the broad lands they loved, but many were\ngathered in Elven-realms and refuges such as Lindon, Rivendell, the\nWoodland Realm, and Lorien, where Sindar and Ñoldor lords ruled over\nSilvan populations. By the end of the Third Age the Dominion of Men was\nat hand, and the elves who remained in Middle-earth dwindled and became\na secret people. Yet in Eldamar the Eldar live nigh to the Valar until\nthe End of the World.\n\n\nCharacteristics\n\nElves, like Men, are Children of Eru Ilúvatar and thus are very similar\nto Men. Unlike Men, however, they are immortal, in that their bodies do\nnot age once they have reached maturity, so that they do not seem to\nbecome elderly or die of old age. They can be killed by physical injury\nhowever, or they may come to death from wasting away if after long eons\nof life they lose the will to live. Some Elves in the First Age living\nnear Angband died from a wasting disease, which was presumably issuing\nfrom Thangorodrim, Morgoth's fortress. The Elves came into existence\nbefore Men, and when Elves die they pass to the Halls of Mandos in\nValinor. After a long period of waiting, the Elf (unless unwilling to\nreturn to life or judged a perpetrator of unforgivable crimes) will be\nreincarnated.\n\nFor Elves, sex and marriage are one and the same, and it is that bodily\nunion that achieves marriage. Elves lose interest in sex after they've\nhad children. They do not consider the day a child was born as the\nmoment they came into existence. Instead, they celebrate the day the\nchild's parents begat them. Elves come of age at around fifty years old,\nand generally marry around this age. Elves who marry late or never are\nsaid to have strange fates. Elves can tell in the eyes and voice of\nanother Elf whether they are married, and it is against an Elf's nature\nto take another by force; one so forced would reject bodily life and\ndie. Because of the union of souls that occurs when Elves marry, and\nbecause of the eternal nature of Elven souls, they do not divorce or\nhave multiple marriages. Elves have a taboo against incest, but marriage\namong second cousins is seen as acceptable. Whether this results in\ndegradation from strong bloodlines is unknown.\n\nElves are (generally) unusually beautiful of face and body. There is\nlittle physical difference between males and females except that which\nis required for reproduction. They have far better vision and\nhearing than Men. They also have skills and abilities beyond what is\npossible for Men, and many can craft seemingly magical objects. In _The\nSilmarillion_, it is mentioned that the Elves are indeed closest in kin\nto the Ainur, given that Elves possess ethereal grace and various\npowers. Elves are light of foot, can travel long distances without\nleaving tracks, and often can walk lightly across snow where the boots\nof Men would sink. They do not require sleep, but are able to enter\na waking meditative state to regain their strength which means they can\nbe exhausted and tire. Although the Elves are more resistant to\nadverse environments and lack of food than Men, they can succumb to them\nthus Elves do require sustenance.",
    "other_names": "People of the Stars, Firstborn, Elder Children of Ilúvatar",
    "origins": "Firstborn of the Children of Ilúvatar",
    "languages": "Various Elvish languages, notably Quenya and Sindarin; Westron",
    "lifespan": "Immortal",
    "distinctions": "Tall, agile, graceful, wise, fair",
    "height": "Very tall",
    "skin_color": "Pale complexion",
    "hair_color": "Black, silver, gold, blonde, auburn (rare among the Ñoldor), Golden, (Vanyar), Silver (Teleri)",
    "characters": "Ingwë, Thingol, Finwë, Fëanor, Fingolfin, Gil-galad, Galadriel, Finrod, Lúthien, Fingon, Turgon, Idril, Maeglin, Círdan, Celeborn, Celebrimbor, Legolas",
    "locations": "Cuiviénen, Tirion, Taniquetil, Formenos, Alqualondë, Tol Eressëa, Doriath, Falas, Hithlum, Ossiriand, Vinyamar, Nargothrond, Gondolin, Edhellond, Mouths of Sirion, Isle of Balar, Lindon, Eldalondë, Eregion, Belfalas, Lothlórien, Rivendell, Mirkwood, Ithilien"
  },
  {
    "name": "Dwarves",
    "lotr_page_id": "156",
    "text": "DWARVES were a race in Middle-earth also known as the KHAZAD, the\nNAUGRIM (meaning 'STUNTED PEOPLE'), and '''Gonnhirrim '''(meaning\n'MASTERS OF STONE').\n\n\n\n\nHistory\n\nCreation\n\n\n\nThe Dwarves were made by Aulë, whom they themselves call Mahal, meaning\n“maker.” Aulë was unwilling to wait for the coming of the Children of\nIlúvatar, for he was impatient and desired to have someone to teach his\nlore and crafts. Therefore, he made the first Seven Fathers of the\nDwarves in secret in a hall under the mountains of Middle-earth.\n\nIt was, however, not within Aulë's power to create life. After being\nreprimanded by Ilúvatar and realizing his error, Aulë offered his\ncreations to his father to do with as he would, including their\ndestruction. Even as the offer was made, Ilúvatar accepted and gave the\nDwarves a life of their own. So when Aulë picked up a great hammer to\nsmite the Seven Fathers and destroy his presumptuous creations, they\nshrank back in fear and begged for mercy.\n\nIlúvatar was however not willing to suffer that the Dwarves should come\nbefore the Firstborn (Elves), and he decreed that the Seven Fathers\nshould sleep underground and should not come forth until the Firstborn\nhad awakened.\n\nFirst Age\n\nAbout a century after the Elves awakened, the Seven Fathers of the\nDwarves were roused. Of those seven, only the name of one is known,\nDurin I, who was called the deathless. Each one of the seven fathers\nbecame a king of his own clan, and each built his own great hall. Three\nmajor holds are known to have been built in the First Age. Belegost and\nNogrod were built in the Blue Mountains, and the Dwarves of these holds\nformed alliances with the Ñoldor and fought in their wars. Durin I, on\nthe other hand, wandered into a vale in the Misty Mountains he named\nAzanulbizar. In a still pool in that vale, he saw a reflection of\nhimself with a crown of seven stars. Ever after, the constellation of\nstars that the Elves call Valacirca was called by the Dwarves Durin’s\nCrown, and it could be seen reflected in the water at any time of the\nday, though only Durin could see his own reflection. Durin I named the\nlake Kheled-zâram and proceeded to build his great hall, Khazad-dûm, in\nthe mountains above. In the First Age, the Dwarves made alliances with\nthe Elves, and both prospered from trade. Dwarves from Belegost invented\nthe famous Dwarf-mail of linked rings and fashioned the finest steel the\nworld had ever seen. They also constructed the hall of Thingol,\nMenegroth, and were rewarded with the pearl Nimphelos. They fought\nalongside Elves and Men and participated in some of the major battles of\nthe First Age, including The First Battle of Beleriand and the Nirnaeth\nArnoediad in which the Dwarves of Belegost won great renown for being\nthe only ones able to stand against the dragon Glaurung, for 'it was\ntheir custom moreover to wear great masks in battle hideous to look\nupon', which 'set them good stead against dragons', and besides they\nwere 'naturally able to resist fire better than elves or men'. In that\nbattle, Azaghâl the Lord of Belegost was killed by Glaurung, who crawled\nover him. Before dying, the dwarf stabbed at the dragon's belly with his\nknife and 'pricked him so deep that he fled back to Angband'.\n\nThe Dwarves of Nogrod were famous for the craftsmanship of their\nweapons. Most notable amongst their smiths was Telchar. Dwarves from\nNogrod crafted the necklace Nauglamír, and Thingol requested Dwarven\nsmiths from Nogrod to set a Silmaril into that necklace. Thus were\nunited the greatest works of Elves and Dwarves. Those Dwarf-smiths were\ndriven mad by gold-lust, however, and murdered Thingol and stole the\nnecklace and the stone, igniting the bitter rivalry between Dwarves and\nElves that would rage between the two races until the end of the Third\nAge.\n\nThe Elves of Doriath pursued the smiths to their deaths and reclaimed\nNauglamír. But two of the slayers of Thingol escaped from the pursuit\nand in Nogrod told how Dwarves were slain by command of the Elven-king,\nwho thus would cheat them of their just reward. The Dwarves of Nogrod\nlamented the deaths of their kin and their great craftsmen and took\nthought of vengeance. Though the Dwarves of Belegost tried to dissuade\nthem from their purpose, the Dwarves of Nogrod invaded Doriath. After a\nhard battle in the Thousand Caves, the Dwarves of Nogrod were victorious\nand took Nauglamír and the Silmaril. On their return journey to the Blue\nMountains, however, the Dwarves of Nogrod were assailed by a company\nthat included Beren, his son Dior, and many Green-elves of Ossiriand.\nMany of the Dwarves were slain, and Beren himself slew the Lord of\nNogrod and wrested from him the necklace Nauglamír. Some of the Dwarves\nescaped from the battle, but they were ambushed in the slopes beneath\nMount Dolmed by the Shepherds of the Trees.\n\nSome stories from the first age tell of petty Dwarves who were called\nNoegyth Nibin. Those were Dwarves exiled from their homes during the\nPeace of Arda and were the first Dwarves to enter Beleriand. It was\npetty Dwarves who first inhabited and carved out The Caverns of Narog,\nwhich they called Nulukkizdîn, but were later taken over by Finrod and\ncalled Nargothrond. The last of this line were Mîm and his two sons who\nlived at Amon Rûdh. Mîm aided Túrin in his adventures, but subsequently\nbetrayed him to Orcs.\n\nSecond Age\n\n\n\nAfter the First Age most tales telling of Dwarves are about the Dwarves\nof the line of Durin, who are commonly called Durin’s Folk or\nLongbeards. Durin I enjoyed a very long life and lived through most of\nthe First Age. Every now and then through the following ages a Dwarf was\nborn of this line that was so alike to Durin that he was considered to\nbe Durin reborn. Prophecy told that Durin would be reborn seven times\nand the coming of Durin VII would mark the decline of the Dwarves.\n\nDurin II was born in the Second Age. It is not known exactly when, but\nhe was in power when the smith Narvi built the west gate of Khazad-dûm\nin the year 750. His reign was an era of great prosperity in which the\nhalls of Khazad-dûm were greatly expanded and the Noldorin Elves of\nLindon moved into Eregion to trade with the Dwarves for mithril.\nPopulation boomed because many refugees from Belegost and Nogrod, which\nwere destroyed at the end of the First Age, moved to Khazad-dûm.\n\nDurin III was in power around the year 1600 of the Second Age. He was\ngifted with the seventh and most powerful of the Dwarven Rings of Power.\nIt was the Elven smith Celebrimbor and not Sauron who gave him the ring.\nThe rings of power did not have the effects that Sauron had intended,\npossibly because Aulë had made the Dwarves especially resistant to evil\ndomination. The only apparent effect of the Dwarven rings was that the\nDwarves became more greedy with gold lust, but they were not turned into\nwraiths like men. Sauron tried to recover the rings. Two he reclaimed\nfairly soon and four ended up in dragon hoards. Sauron did not reclaim\nthe ring of Durin until the 2845th year of the Third Age when he\ncaptured Thráin II.\n\nOf the Dwarves, few fought upon either side; but the kindred of Durin of\nMoria fought against Sauron.\n\nThird Age\n\nIn Third Age 1980, after centuries of greedy digging for _mithril_ and\nother minerals, the Dwarves woke a Balrog that was sleeping in the deeps\nof the Misty Mountains since the First Age. The Dwarves fled Khazad-dum,\nwhich from then on was called _Moria_, which means “Black pit”.\n\nMost of Durin's folk left for the Grey Mountains in the North, while\nsome followed the new king, Thráin I, who briefly went to Erebor. For\nmore than 300 years the Dwarves of the Grey Mountains prospered until\nthe Dragons in the far North started to gain strength. Some fled to the\nIron Hills, while most followed the new king Thrór to Erebor to start a\nnew Kingdom under the Mountain. There, they prospered for over 200 years\nuntil the dragon Smaug descended in TA 2770. The King and his company\nwent in exile South, while most of the survivors went to the Iron Hills.\n\nDurin's folk settled in Dunland, and King Thrór traveled North to Moria\nwhere he was killed by the Goblin king Azog. Thrór's son Thráin II (who\nhad received the Last of the Seven Rings from his father before his\ndeparture) summoned all the Houses of Dwarves to war. Thus began the War\nof Dwarves and Orcs, in which the Dwarves destroyed all the Goblin\nstrongholds in the Misty Mountains culminating to the great Battle of\nAzanulbizar where all the dwarven clans united. The Goblin hosts issuing\nfrom Moria were strong and relentless until the arrival of fresh Dwarves\nof the Iron Hills. The Battle ended with the victory of Dwarves, but at\ngreat cost. The Dwarven clans however were unwilling to repopulate\nMoria. Thráin therefore came to the Blue Mountains and established his\nrealm there.\n\nThe Wizard Gandalf was instrumental into helping Thráin's son Thorin in\nreclaiming the Kingdom of Erebor. Thorin gathered around him twelve\ndwarves, mostly from his own line, and was joined by Gandalf and Bilbo\nBaggins. The Quest of Erebor ended with the death of Smaug. After a\nquarrel with the Men and Elves over the unguarded hoard, the Dwarves -\nassisted by those from the Iron Hills - united with the Men and Elves to\nfight the attacking Goblins and Wargs, in what was called the Battle of\nFive Armies, where Thorin was killed.\n\nGimli son of Glóin joined the Fellowship of the Ring as a representative\nof the Dwarves and befriended Legolas during the War of the Ring. After\nthe Battle of the Pelennor Fields, a force of 30,000 Longbeards and\n20,000 Men of Dale held the Lonely Mountain in a similar siege against\n200,000 Men of Rhun who had taken all of Brand's lands, leaving only his\ncapital city of Dale. The Dwarves and Men of Dale stood for three days\nagainst the Easterlings, and once the news of Sauron's death spread to\nthe Lonely Mountain the Easterlings retreated, having lost over 100,000\ntroops, as opposed to the defenders who lost 14,000 Dwarves and 12,000\nMen. The sturdy nature of the Mountain Rock, combined with the Dwarven\nmasonry and the Dwarven quality of the defenders' weapons, reduced the\nhitting power of the Easterlings' two-armed catapults and semi-automatic\nballistas, and allowed the defenders to drive the attackers from the\nMountain and out of Brand's realm.\n\nAfter the Third Age\n\nDuring the Fourth Age, which began after the destruction of Mordor and\nSauron, Dwarves and Men re-forged their friendship. Dáin was killed\nduring the War of the Ring, and was succeeded by his son Thorin III\nStonehelm who ruled well into the Fourth Age. During this time, Dwarves\nfrom the Lonely Mountain helped rebuild cities in Gondor and the\nfortress of Helm's Deep, and some went to the newly established Dwarven\nrealm of the Glittering Caves where Gimli was lord. Nevertheless, the\nKingdom of the Lonely Mountain apparently continued to prosper\nthroughout the Fourth Age.\n\nFourth Age\n\nNot much is known about the Dwarves in the Fourth Age. After the War of\nthe Ring, Gimli brought a part of Durin's Folk from the Lonely Mountain\nto the Glittering Caves behind Helm's Deep and founded a colony there.\nSubsequently, Gimli went on many travels with his friend Legolas, and\nHistory lost track of their fate. Through their friendship and\ninfluence, the feud between the two races that had lasted for millennia\nfinally ended, shortly before the departure of the last Elves from\nMiddle-earth. It is rumored that Gimli and Legolas eventually boarded a\nship that sailed down the river Anduin, out to sea and across to Valinor\nin the year FO 120. Gimli would thus have become the only Dwarf to ever\nbe permitted to cross to the Undying Lands.\n\nDue to the diminished states of dragons and orcs, dwarves may have been\nable to reclaim their ancient kingdoms such as Gundabad and the Grey\nMountains.\n\nDurin VII (the Last), retook Moria and brought Khazad-dûm back to its\noriginal splendor, and the Longbeards lived there till the “world grew\nold and the days of Durin's race ended.” \n\n\nCulture\n\nAppearance\n\n\n\nWhen Aulë created the Dwarves he had only a vague idea of what the\nChildren of Ilúvatar should look like. Because of the threat of Morgoth\nover the world, Aulë made them very strong, both in body and character.\n\nDwarves were a short, stocky race, a little taller than hobbits but much\nbroader and heavier. Most Dwarves had thick, luxuriant beards in which\nthey took great pride, and often forked or braided them and tucked them\ninto their belts.\n\n\n\nThey seem to have favoured simple durable clothing, coloured hoods and\nheavy cloaks for travelling, and belts of gold or silver. For battle\ntheir soldiers would have elaborately crafted armor and helmets, bearing\nvarious angles and styles that were trademarks of Dwarven crafting\nstyles. Their armor was masked with symbols (after the manner of those\nused in forges for shielding the eyes) that were hideous to look upon.\n\n\n\nDwarven women were alike in manner, voice and appearance to their\nmenfolk. They were few in number, less than a third of all dwarf-kind,\nand they were seldom seen outside their own halls, often not venturing\nfar due to their duties as caretakers and crafters in Dwarven society.\nThey typically only travelled when in great need, and they usually\ndressed similarly to Dwarf men. This often led other folk to believe\nthere were no women among the Dwarves, that Dwarves grew from stone when\ncreated. Few female Dwarven warriors were known, but some tales say that\nfemale Dwarves were as fierce as their male counterparts, especially in\nprotecting their families and offspring. Dwarves were usually\nmonogamous, and fewer than one-third of Dwarven men took a wife, the\nrest busying themselves with their crafts.\n\nPhysiology\n\n\n\nDwarves were a proud and stern race and were made to be sturdy to resist\nthe dangers of their time. They were physically very strong, had great\nendurance, especially in the ability to resist heat and cold, and they\nmade light of heavy burdens. Dwarves lived longer than Men, often up\nto two hundred and fifty years. The Dwarven lords of the First and\nSecond Age may have lived for several hundred years. Dwarves had the\nability to learn new artisanal skills quickly, especially those dealing\nwith metal or stone.\n\nDwarves were typically stubborn, secretive, and fiercely loyal to their\nfriends. They cared greatly about mining, crafting, crafts, gold and\ngems, their acquisition of which often fueled the envy of the Elves.\nDwarves were easily offended by rude comments, and had a propensity to\nhold long-lasting grudges. Dwarves were often seen as greedy, but their\nnature gave them resistance to many external influences, including to\nthe evil of the Rings of Power given them. Whereas the Men who owned the\nnine Rings were corrupted and became the Nazgûl, the Dwarves were\nunaffected, save by an increase of their goldlust and hatred for\nanything that stood between them and what they perceived as their\ntreasure.\n\nCrafting\n\nDwarves were taught special skills by the Vala Aulë and spent most of\ntheir time crafting, smithing and mining in their massive underground\ncities.\n\nThe Dwarves were some of the greatest miners ever to exist in\nMiddle-earth. The Dwarves dug immense halls under mountains where they\nbuilt their cities. Dwarven miners dug for precious minerals such as\ngold, iron, copper, and silver from all over mountains in Middle-earth,\nthough the Dwarves considered coal mining degrading. In ancient times,\nthe Dwarves found Mithril in the mines of Khazad-dûm. While mining\nbeneath the Lonely Mountains, they discovered the Arkenstone at the\nHeart of the Mountain.\n\nThey were also capable masons and smiths - Dwarven smithing skills were\nsaid to be rivaled only by those of the Elves, and their masonry\ncreations were bested by none. The skill of the Dwarves was unmatched;\nthey crafted objects of great beauty out of diamond, emerald, ruby and\nsapphire. Everything Dwarven was beautifully crafted and intricate. They\ncrafted many famed weapons, armors, and items of art and beauty, among\nthem Narsil, the sword of Elendil, the Dragon-helm of Dor-lómin and the\nnecklace Nauglamír.\n\nDwarven armies were vast and powerful, and possessed vast legions of\nsoldiers, cavalry and siege weapons, and their soldiers were equipped\nwith powerful weapons, armors and tools for battle. Many different\nweapons were utilized by their soldiers, such as swords, axes, throwing\naxes, throwing knives, and warhammers.\n\nThey had a knack for starting a fire almost anywhere out of almost\nanything. Although they knew how, Dwarves did not farm or herd often, as\nthey preferred to spend their time underground mining and crafting. They\nrather traded crafted items with men and elves in exchange for food.\n\nArchitecture\n\n\n\nThey built many famed halls including the Lonely Mountain, Belegost,\nNogrod, Khazad-dum, and Menegroth. The Dwarves also reforged the gates\nof Minas Tirith and rebuilt the walls of Helm's Deep after the War of\nthe Ring.\n\nTheir cities appeared to be constructed just under mountains or mountain\nranges. Dwarven miners would excavate into the mountains to create an\nentrance, and then dig through and under the mountain to create the\ngroundwork for their cities. Dwarven cities were absolutely massive and\nvery expansive, reaching the far depths of the earth. Dwarves continued\nto mine in their cities to expand them and discover more resources like\nprecious metals and minerals.\n\nDwarven cities ran throughout mountains and mountain ranges, stretched\nup, down and side-to-side in the massive caverns beneath the surface,\nbut it was largely unknown how cities were structured and sectioned off.\nIn Khazad-dum, there was a section of the city known as the Chamber of\nMazarbul, also known as the Chamber of Records. There were also sections\nof the city mentioned in the Book of Mazarbul such as the “First Hall,”\n“Second Hall,” “Third Deep,” “Twenty-first hall” and the “North end.”\n\nThe beauty of the Dwarves' cities was legend. One stronghold, Erebor\n(located in the Lonely Mountains), had its wealth coming from precious\ngems hewn from rock and in “great seams of gold running like rivers\nthrough stone.”\n\nA name for where the Dwarves' were located was Phurunargian, which meant\nDwarf-delving in the Common Tongue.\n\nNotable Dwarven Realms\n\n-   Khazad-dum, under the Misty Mountains\n-   Nogrod and Belegost, under the Blue Mountains\n-   Lonely Mountain/Erebor\n-   Grey Mountains\n-   Iron Hills\n-   Glittering Caves\n-   Orocarni (Red Mountains)\n\nLanguage and Writing System\n\nLanguage\n\nThe Dwarven language was created by Aulë when he created the Dwarves\nthemselves, and called it Khuzdul, which meant 'Dwarvish'. The language\nwas a harsh sounding tongue and sounded strange and harsh to other\nraces, and no other non-dwarf did they permit to learn their language\nfor it was guarded jealously. They rarely spoke their own language\naround other races, and preferred to use the languages of other races\nwhen around them.\n\nCertainly in the First Age when they first made contact with the Elves,\nthe only tongue in Beleriand would have been Sindarin at that time as\nthe Noldor had not yet returned from Aman. As a logical consequence,\ntherefore, Sindarin was a language used by the dwarves. In fact, the\nDwarves were so impressed by the Elvish runes (The Cirth of Daeron) for\nwriting Sindarin that they adopted them for use in their own tongue and\nused them forever more. \n\nWriting System\n\nThe Dwarves used Angerthas, a runic writing system based on Cirth. There\nwere different variations of Angerthas, which varied by each Dwarven\nclan; the Dwarves of Khazad-dum had their own variation and introduced a\nnumber of unsystematic changes in the system. The Dwarves of Erebor also\nused a further modification of the system, which was known as the mode\nof Erebor. The mode of Erebor was notably exemplified in the Book of\nMazarbul.\n\nSome examples of Angerthas were seen in notable Dwarven texts, including\nthe Book of Mazarbul, Thror's Map, as well as other objects such as the\nKey to the Side-door, the key which unlocked the side door of Erebor.\n\nWeapons and Armour\n\n_See Dwarven Weapons and Armour_\n\nDwarven soldiers usually used axes as their weapon of choice because it\ncan be used as a tool or a weapon, but in addition to axes they used\nhatchets, mattocks, short swords, war hammers, and very occasionaly\nthere is mention of Dwarven archers.\n\nAs for armor, Dwarves favored chain-mail and other metallic armor — the\nmost expensive and precious of which was ring mail made of mithril. (A\nvest of mithril was given to Bilbo by Thorin before The Battle of the\nFive Armies. It was worn during the battle and later protected his\nnephew Frodo throughout his quest.) Gandalf said that this small coat\nwas worth more than the whole of the Shire combined.\n\nMusic\n\nMany songs were sung in the deep and grand halls of the Dwarves. One\nvery notable song of the Dwarves was “Far over the Misty Mountains\nCold”, also known as the “Song of the Lonely Mountain,” and commonly\nreferred by fans as the “Dwarf Song.” Another song sung in Dwarven\nculture was the Song of Durin. This song told of the history of\nKhazad-dum/Moria and honored Durin, first leader of Durin's Folk.\n\nWicked Dwarves\n\nOf the races, Dwarves are the most resistant to corruption and influence\nof Morgoth and later Sauron. The seven rings of Power of the dwarves did\nnot turn them to evil, but it did amplify their greed and lust for gold.\nIt is said that very few willfully served the side of darkness. The\nHobbit refers to these as wicked dwarves. Of the seven houses few\nfought on either side during The Last Alliance at the end of the Second\nAge, and none from the House of Durin ever fought on the side of\nevil. However, in times of war, Dwarves often refused to ally\nthemselves with Elves or Men, choosing to remain neutral or oblivious to\nthe clashes between good and evil. During the early parts of the Third\nAge, it is known that in some places wicked dwarves had made alliances\nwith the goblins and orcs. It is suggested by Tolkien in some of his\nnotes that the dwarves that turned to wickedness most likely came from\nthe far eastern mansions (and perhaps some of the nearer ones), and came\nunder the Shadow of Morgoth and finally turned to evil. It is however\nunclear if these refer to Dwarves beyond Iron Hills (the most eastern\nknown stronghold of the Dwarves) Because Dwarves are not evil by\nnature, few ever served the Enemy of their own free will (though rumors\nof Men suggest the total was greater).\n\nIn some of Tolkien's earliest writings the Dwarven race as a whole was\nportrayed as an evil creation of Melkor, but Tolkien's ideas evolved as\nhe continued to write about the Dwarves.\n\n\nThe Seven Clans\n\nThe Dwarves' seven clans were:\n\n-   1. Longbeards, also known as Durin's Folk; originally from Mount\n    Gundabad they also founded the great Dwarf Mansion of Khazad-dûm\n    (a.k.a. Moria or Dwarrowdelf) in the Misty Mountains, the Iron\n    Hills, the holds in the Grey Mountains and, finally, the Lonely\n    Mountain.\n\n&nbsp;\n-   2-3. Firebeards & Broadbeams. Originally from the Blue Mountains,\n    they were paired but Tolkien never cleared which tribe built Nogrod\n    and which Belegost.\n\n&nbsp;\n-   4-5. Ironfists & Stiffbeards. Originated in the Far East; Orocarni.\n\n&nbsp;\n-   6-7. Blacklocks & Stonefoots. Originated in the Far East; Orocarni.\n-   The Seven Clans of the Dwarves descended from the Seven Dwarf\n    Fathers created by Aulë\n\n\nLocation\n\nThe Dwarves lived and mined in several places throughout Middle-earth\nmany times, which included:\n\n-   Moria or Khazad-dûm and other places in the Misty Mountains.\n-   Lonely Mountain or Erebor.\n-   Mount Gundabad.\n-   The Iron Hills.\n-   The Blue Mountains or Ered Luin, where the cities Nogrod and\n    Belegost existed during the First Age.\n-   The Grey Mountains or Ered Mithrin, although the dwarves were later\n    driven out by dragons.\n-   The Orocarni, the Red Mountains of the East.\n\nNames\n\nThe Dwarves called themselves the _Khazad_, the name Aulë gave them;\nthis translates as the _Hadhodrim_ in Sindarin, and the _Casari_ in\nQuenya. Casari was the common word for Dwarves among the Ñoldor, but the\nSindar usually called them the _Naugrim_ or _Nogothrim_, the Stunted\nPeople.\n\nDwarves would, as a rule, not tell people of other races their real\nnames, but take names in Westron instead, and keep their real names\nsecret, not even on their tombs would they inscribe it.\n\nMany Dwarven names in the works of Tolkien are taken from the poetic\nViking prophecies, Völuspá (Old Norse: _Vǫluspá_). A significant part of\nthe prophecy describes the pagan world view of the Vikings, and in that\npart can be found the Count of Dwarves, which is mostly a list of names.\nAll the dwarf names from the Hobbit are taken from that source as well\nas the name of Gandalf. Some other names, such as Gimli (meaning shelter\nfrom fire), and Harlan are taken from the Icelandic language, but not\nfrom Völuspá. Only a few Dwarves in the works of Tolkien have original\nnames in Khuzdul. These include Azaghâl, and Telchar.\n\nIn the earlier forms of Tolkien's Mythology, the Dwarves were also\ncalled the 'Nauglath'.",
    "other_names": "_Naugrim_ (S), _Nogothrim_ (S)._Khazâd_ (K), _Hadhodrim_ (S), _Casari_, (Q)",
    "origins": "Created by Aulë",
    "locations": "Belegost, Blue Mountains, Amon Rûdh, Glittering Caves, Grey Mountains, Iron Hills, Lonely Mountain, Khazad-dûm, Nogrod, Nargothrond, Mount Gundabad, Dunland",
    "languages": "Khuzdul, Westron, Sindarin",
    "characters": "Durin, Gimli, Thorin, Dain Ironfoot, Azaghâl, Mîm, Balin",
    "lifespan": "Around 250-350 years",
    "distinctions": "Stocky; bearded; never bald; especially hardy and loyal; notoriously, stubborn",
    "height": "Taller than Hobbits, shorter than Men; around 4'6",
    "skin_color": "White",
    "hair_color": "Blond, brown, black, blue, red, and (when older) grey or white"
  }
]